Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# maxIncorrectAnswersDescription
source: Pass/Fail Exam. No numeric grade; you either pass or fail.
ar: امتحان نجاح/رسوب. لا توجد درجة رقمية، إما أن تنجح أو ترسب.
ca: Examen d'Apte/No Apte. No hi ha nota numèrica, aproves o suspens.
el: Εξέταση Επιτυχίας/Αποτυχίας. Δεν υπάρχει αριθμητική βαθμολογία.
es: Examen de Apto / No Apto. No hay nota numérica, apruebas o suspendes.
eu: Azterketarako erantzun okerren muga ezarri. Muga horretara iritsiz gero, quiz-a berehala geldituko da.
gl: Establece un límite de respostas incorrectas para o exame. Se se chega a este límite, o quiz deterase inmediatamente.
hi: उत्तीर्ण/अनुत्तीर्ण परीक्षा। कोई संख्यात्मक ग्रेड नहीं है।
it: Il quiz terminerà immediatamente se raggiungi questo limite.
ja: 制限に達するとクイズは直ちに終了します。
pt: O quiz terminará imediatamente se atingir este limite.
zh: 及格/不及格考试。没有具体分数，只有及格或不及格。

# maxIncorrectAnswersOffDescription
source: The exam has a numeric grade from 0 to 100.
ar: للامتحان درجة رقمية من 0 إلى 100.
ca: L'examen té una nota numèrica del 0 al 100.
el: Η εξέταση έχει αριθμητική βαθμολογία από 0 έως 100.
es: El examen tiene una nota numérica del 0 al 100.
hi: परीक्षा में 0 से 100 तक संख्यात्मक ग्रेड होता है।
zh: 考试将有 0 到 100 的数值评分。

# maxIncorrectAnswersLimitLabel
source: Maximum allowed errors
ar: الحد الأقصى للأخطاء المسموح بها
ca: Nombre màxim d'errors
el: Μέγιστος αριθμός επιτρεπόμενων σφαλμάτων
es: Máximo de errores permitidos
eu: Gehienezko errore kopurua
gl: Número máximo de erros
hi: अधिकतम अनुमत त्रुटियां
it: Massimo errori consentiti
ja: 最大許容エラー数
pt: Máximo de erros permitidos
zh: 允许的最大错误数

# examFailedStatus
source: Exam FAILED (Fail)
ar: اختبار لم يجتز
ca: Examen NO APTE
el: Η εξέταση ΑΠΕΤΥΧΕ
es: Examen NO APTO
hi: परीक्षा अनुत्तीर्ण (Fail)
zh: 考试不及格

# examPassedStatus
source: Exam PASSED (Pass)
ar: اختبار اجتيز
ca: Examen APTE
el: Η εξέταση ΠΕΤΥΧΕ
es: Examen APTO
hi: परीक्षा उत्तीर्ण (Pass)
zh: 考试及格

# quizFailedLimitReached
source: Exam Finished: Maximum error limit has been reached
ar: انتهى الاختبار: تم تجاوز الحد الأقصى للأخطاء المسموح بها
ca: Examen Finalitzat: S'ha superat el límit màxim d'errors permesos
el: Η εξέταση ολοκληρώθηκε: Συμπληρώθηκε το μέγιστο όριο σφαλμάτων
es: Examen Finalizado: Se ha alcanzado el límite máximo de errores
eu: Quiz-a Geldituta: Errore Muga Gaindituta
gl: Quiz Detido: Límite de Erros Acadado
hi: परीक्षा समाप्त: अधिकतम त्रुटि सीमा समाप्त हो गई है
it: Quiz interrotto: Limite errori raggiunto
ja: クイズ停止：エラー制限に達しました
pt: Quiz interrompido: Limite de erros atingido
zh: 考试结束：已达到最大错误限制

source: Close
ar: إغلاق
ca: Tancar
de: Schließen
el: Κλείσιμο
es: Cerrar
eu: Itxi
fr: Fermer
gl: Pechar
hi: बंद करें
it: Chiudi
ja: 閉じる
pt: Fechar
zh: 关闭

# randomizeAnswersOffDescription
source: Answer options will appear in their original order
ar: ستظهر خيارات الإجابة بترتيبها الأصلي
ca: Les opcions de resposta apareixeran en el seu ordre original
el: Οι επιλογές απάντησης θα εμφανίζονται με την αρχική τους σειρά
es: Las opciones de respuesta aparecerán en su orden original
eu: Erantzun-aukerak jatorrizko ordenan agertuko dira
hi: उत्तर विकल्प अपने मूल क्रम में दिखाई देंगे
it: Le opzioni di risposta appariranno nel loro ordine originale
zh: 答案选项将按原始顺序出现

# scoringAndLimitsTitle
source: Scoring and Limits
ar: الدرجات والحدود
ca: Puntuació i límits
el: Βαθμολογία και όρια
es: Puntuación y límites
eu: Puntuazioa eta mugak
hi: स्कोरिंग और सीमाएँ
it: Punteggio e limiti
zh: 评分和限制

source: 🎉 Congratulations! 🎉
ar: 🎉 تهانينا! 🎉
ca: 🎉 Enhorabona! 🎉
de: 🎉 Herzlichen Glückwunsch! 🎉
el: 🎉 Συγχαρητήρια! 🎉
es: 🎉 ¡Enhorabuena! 🎉
eu: 🎉 Zorionak! 🎉
fr: 🎉 Félicitations ! 🎉
gl: 🎉 Parabéns! 🎉
hi: 🎉 बधाई हो! 🎉
it: 🎉 Congratulazioni! 🎉
ja: 🎉 おめでとうございます！ 🎉
pt: 🎉 Parabéns! 🎉
zh: 🎉 恭喜！ 🎉

# examConfigurationTitle
source: Exam Configuration
ar: إعدادات الامتحان
ca: Configuració de l'examen
el: Διαμόρφωση Εξέτασης
es: Configuración del examen
eu: Azterketaren konfigurazioa
hi: परीक्षा कॉन्फ़िगरेशन
zh: 考试配置

# validationMin1Error
source: Minimum 1 minute
ar: دقيقة واحدة كحد أدنى
ca: Mínim 1 minut
el: Ελάχιστο 1 λεπτό
es: Mínimo 1 minuto
eu: Gutxienez minutu 1
hi: न्यूनतम 1 मिनट
zh: 最少1分钟

# remainingTimeWithDays
source: {days}d {hours}:{minutes}:{seconds}
ar: {days}ي {hours}:{minutes}:{seconds}
el: {days}ημ {hours}:{minutes}:{seconds}
eu: {days}e {hours}:{minutes}:{seconds}
hi: {days}दिन {hours}:{minutes}:{seconds}
zh: {days}天 {hours}:{minutes}:{seconds}

# remainingTimeWithWeeks
source: {weeks}w {days}d {hours}:{minutes}:{seconds}
ar: {weeks}أ {days}ي {hours}:{minutes}:{seconds}
ca: {weeks}s {days}d {hours}:{minutes}:{seconds}
el: {weeks}ε {days}ημ {hours}:{minutes}:{seconds}
es: {weeks}s {days}d {hours}:{minutes}:{seconds}
eu: {weeks}a {days}e {hours}:{minutes}:{seconds}
hi: {weeks}सप्ताह {days}दिन {hours}:{minutes}:{seconds}
zh: {weeks}周 {days}天 {hours}:{minutes}:{seconds}

# validationMax30DaysError
source: Maximum 30 days
ar: كحد أقصى 30 يومًا
ca: Màxim 30 dies
el: Μέγιστο 30 ημέρες
es: Máximo 30 días
eu: Gehienez 30 egun
hi: अधिकतम 30 दिन
zh: 最多30天

source: Evaluating responses...
ar: جاري تقييم الردود...
ca: Avaluant respostes...
el: Αξιολόγηση απαντήσεων...
es: Evaluando respuestas...
hi: प्रतिक्रियाओं का मूल्यांकन किया जा रहा है...
zh: 正在评估回答...

# pendingEvaluationsCount
source: {count, plural, =1{1 development question pending AI evaluation} other{{count} development questions pending AI evaluation}}
ar: {count, plural, =1{سؤال مقالي واحد قيد انتظار تقييم الذكاء الاصطناعي} other{{count} أسئلة مقالية قيد انتظار تقييم الذكاء الاصطناعي}}
ca: {count, plural, =1{1 pregunta de desenvolupament pendent d'avaluació per part de la IA} other{{count} preguntes de desenvolupament pendents d'avaluació per part de la IA}}
el: {count, plural, =1{1 ερώτηση ανάπτυξης σε αναμονή αξιολόγησης AI} other{{count} ερωτήσεις ανάπτυξης σε αναμονή αξιολόγησης AI}}
es: {count, plural, =1{1 pregunta de desarrollo pendiente de evaluación por IA} other{{count} preguntas de desarrollo pendientes de evaluación por IA}}
hi: {count, plural, =1{1 निबंध प्रश्न AI मूल्यांकन के लिए लंबित है} other{{count} निबंध प्रश्न AI मूल्यांकन के लिए लंबित हैं}}
zh: {count, plural, =1{1个简答题等待 AI 评估} other{{count}个简答题等待 AI 评估}}

# pendingStatus
source: Pending
ar: قيد الانتظار
ca: Pendent
el: Σε εκκρεμότητα
es: Pendiente
hi: लंबित
zh: 待处理

# notEvaluatedStatus
source: Not evaluated
ar: لم يتم التقييم
ca: No avaluada
el: Δεν αξιολογήθηκε
es: Sin evaluar
hi: मूल्यांकन नहीं किया गया
zh: 未评估

# retryButton
source: Retry Evaluation
ar: إعادة محاولة التقييم
ca: Reintentar avaluació
el: Επανάλυψη αξιολόγησης
es: Reintentar Evaluación
hi: मूल्यांकन पुन: प्रयास करें
zh: 重试评估

# featureComingSoon
source: Coming soon! Stay tuned for updates.
ar: الميزة قادمة قريبا! ابقَ على اطلاع على التحديثات.
ca: Properament disponible! Estigues atent a les novetats.
el: Σύντομα διαθέσιμο! Μείνετε συντονισμένοι.
es: ¡Próximamente disponible! Mantente al tanto de las novedades.

source: Show onboarding
ar: عرض العرض الترحيبي
ca: Mostra la benvinguda
el: Εμφάνιση καλωσορίσματος
es: Mostrar onboarding

# showOnboardingDescription
source: View the welcome tutorial again
ar: عرض البرنامج التعليمي الترحيبي مرة أخرى
ca: Torna a veure el tutorial de benvinguda
el: Δείτε ξανά το σεμινάριο καλωσορίσματος
es: Ver el tutorial de bienvenida de nuevo

# onboardingBack
source: Back
ar: عودة
ca: Enrere
el: Πίσω
es: Atrás

# onboardingGetStarted
source: Get Started
ar: ابدأ الآن
ca: Comença
el: Ξεκινήστε
es: Comenzar

# onboardingWelcomeTitle
source: Welcome to QuizLab AI
ar: مرحباً بك في QuizLab AI
ca: Benvingut a Quizdy
el: Καλώς ήρθατε στο Quizdy
es: Bienvenido a QuizLab AI

# onboardingWelcomeDescription
source: Your interactive quiz companion with AI-powered features, customizable questions, and real-time scoring.
ar: رفيقك التفاعلي للاختبارات مع ميزات مدعومة بالذكاء الاصطناعي، وأسئلة قابلة للتخصيص، وتسجيل في الوقت الفعلي.
ca: El teu company de qüestionaris interactius amb funcions impulsades per IA, preguntes personalitzables i puntuació en temps real.
el: Ο διαδραστικός σας σύντροφος κουίζ με λειτουργίες που υποστηρίζονται από AI, προσαρμόσιμες ερωτήσεις και βαθμολογία σε πραγματικό χρόνο.
es: Tu compañero interactivo de cuestionarios con funciones impulsadas por IA, preguntas personalizables y puntuación en tiempo real.

# onboardingWelcomeSubtitle
source: Your interactive quiz companion
ar: رفيقك التفاعلي للاختبارات
ca: El teu company de qüestionaris interactius
el: Ο διαδραστικός σας σύντροφος κουίζ
es: Tu compañero interactivo de cuestionarios

# onboardingStartQuizTitle
source: Start a Quiz
ar: ابدأ اختباراً
ca: Inicia un qüestionari
el: Ξεκινήστε ένα Κουίζ
es: Iniciar un cuestionario

# onboardingStartQuizDescription
source: Load an existing .quiz file or create a new one from scratch. Drag and drop files directly or use the file picker.
ar: قم بتحميل ملف .quiz موجود أو أنشئ ملفاً جديداً من الصفر. اسحب الملفات وأفلتها مباشرة أو استخدم منتقي الملفات.
ca: Carrega un fitxer .quiz existent o crea'n un de nou des de zero. Arrossega i deixa anar els fitxers directament o utilitza el selector de fitxers.
el: Φορτώστε ένα υπάρχον αρχείο .quiz ή δημιουργήστε ένα νέο από το μηδέν. Σύρετε και αποθέστε αρχεία απευθείας ή χρησιμοποιήστε τον επιλογέα αρχείων.
es: Carga un archivo .quiz existente o crea uno nuevo desde cero. Arrastra y suelta archivos directamente o usa el selector de archivos.

# onboardingStartQuizSubtitle
source: Load, create, and play
ar: تحميل، إنشاء، ولعب
ca: Carrega, crea i juga
el: Φόρτωση, δημιουργία και παιχνίδι
es: Carga, crea y juega

# onboardingCreateQuestionsTitle
source: Create Questions
ar: إنشاء أسئلة
ca: Crea preguntes
el: Δημιουργία Ερωτήσεων
es: Crear preguntas

# onboardingCreateQuestionsDescription
source: Build quizzes with multiple question types. Customize each question with options, correct answers, and explanations.
ar: قم ببناء اختبارات بأنواع أسئلة متعددة. خصص كل سؤال بالخيارات، والإجابات الصحيحة، والشروحات.
ca: Crea qüestionaris amb múltiples tipus de preguntes. Personalitza cada pregunta amb opcions, respostes correctes i explicacions.
el: Δημιουργήστε κουίζ με πολλαπλούς τύπους ερωτήσεων. Προσαρμόστε κάθε ερώτηση με επιλογές, σωστές απαντήσεις και επεξηγήσεις.
es: Crea cuestionarios con múltiples tipos de preguntas. Personaliza cada pregunta con opciones, respuestas correctas y explicaciones.

# onboardingCreateQuestionsSubtitle
source: Design your own quizzes
ar: صمم اختباراتك الخاصة
ca: Dissenya els teus propis qüestionaris
el: Σχεδιάστε τα δικά σας κουίζ
es: Diseña tus propios cuestionarios

# onboardingAiFeaturesTitle
source: AI-Powered Features
ar: ميزات مدعومة بالذكاء الاصطناعي
ca: Funcions impulsades per IA
el: Λειτουργίες με βάση το AI
es: Funciones con IA

# onboardingAiFeaturesDescription
source: Generate questions automatically with AI, get real-time study assistance, and learn smarter with intelligent tutoring.
ar: قم بتوليد الأسئلة تلقائياً باستخدام الذكاء الاصطناعي، واحصل على مساعدة دراسية في الوقت الفعلي، وتعلّم بذكاء أكبر مع التدريس الذكي.
ca: Genera preguntes automàticament amb IA, obté assistència d'estudi en temps real i aprèn de manera més intel·ligent amb tutoria intel·ligent.
el: Δημιουργήστε ερωτήσεις αυτόματα με το AI, λάβετε βοήθεια μελέτης σε πραγματικό χρόνο και μάθετε πιο έξυπνα με έξυπνη διδασκαλία.
es: Genera preguntas automáticamente con IA, obtén asistencia de estudio en tiempo real y aprende de forma más inteligente con tutoría inteligente.

# onboardingAiFeaturesSubtitle
source: Powered by AI
ar: مدعوم بالذكاء الاصطناعي
ca: Impulsat per IA
el: Με την υποστήριξη του AI
es: Impulsado por IA

# onboardingFeatureAiTitle
source: AI-powered question generation
ar: توليد الأسئلة بالذكاء الاصطناعي
ca: Generació de preguntes amb IA
el: Δημιουργία ερωτήσεων με AI
es: Generación de preguntas con IA

# onboardingFeatureAiDescription
source: Generate quizzes from any text with GPT or Gemini
ar: توليد اختبارات من أي نص باستخدام GPT أو Gemini
ca: Genera qüestionaris des de qualsevol text amb Gemini o GPT
el: Δημιουργήστε κουίζ από οποιοδήποτε κείμενο με Gemini ή GPT
es: Genera cuestionarios desde cualquier texto con GPT o Gemini

# onboardingFeatureTypesTitle
source: Multiple question types
ar: أنواع أسئلة متعددة
ca: Múltiples tipus de preguntes
el: Πολλαπλοί τύποι ερωτήσεων
es: Múltiples tipos de preguntas

# onboardingFeatureTypesDescription
source: Single choice, multiple choice, true/false, and essay
ar: اختيار واحد، اختيار متعدد، صح/خطأ، ومقالي
ca: Opció única, opció múltiple, vertader/fals i desenvolupament
el: Μονή επιλογή, πολλαπλή επιλογή, σωστό/λάθος και δοκίμιο
es: Opción única, opción múltiple, verdadero/falso y ensayo

# onboardingFeatureLanguagesTitle
source: 13 languages supported
ar: دعم 13 لغة
ca: 13 idiomes compatibles
el: Υποστήριξη 13 γλωσσών
es: 13 idiomas soportados

# onboardingFeatureLanguagesDescription
source: Create and take quizzes in multiple languages
ar: إنشاء وإجراء الاختبارات بلغات متعددة
ca: Crea i respon qüestionaris en diversos idiomes
el: Δημιουργήστε και κάντε κουίζ σε πολλές γλώσσες
es: Crea y realiza cuestionarios en múltiples idiomas

# onboardingStepCreateTitle
source: Create Quiz
ar: إنشاء اختبار
ca: Crea qüestionari
el: Δημιουργία Κουίζ
es: Crear cuestionario

# onboardingStepCreateDescription
source: Start from scratch with your own questions
ar: ابدأ من الصفر بأسئلتك الخاصة
ca: Començ de zero amb les teves pròpies preguntes
el: Ξεκινήστε από το μηδέν με τις δικές σας ερωτήσεις
es: Empieza desde cero con tus propias preguntas

# onboardingStepLoadTitle
source: Load File
ar: تحميل ملف
ca: Carrega fitxer
el: Φόρτωση Αρχείου
es: Cargar archivo

# onboardingStepLoadDescription
source: Import a .quiz file from your device
ar: استيراد ملف .quiz من جهازك
ca: Importa un fitxer .quiz des del teu dispositiu
el: Εισαγωγή αρχείου .quiz από τη συσκευή σας
es: Importa un archivo .quiz desde tu dispositivo

# onboardingStepTakeTitle
source: Take the Quiz
ar: إجراء الاختبار
ca: Fes el qüestionari
el: Κάντε το Κουίζ
es: Realizar el cuestionario

# onboardingStepTakeDescription
source: Answer questions and get scored in real-time
ar: أجب عن الأسئلة واحصل على النتائج في الوقت الفعلي
ca: Respon preguntes i obté la puntuació en temps real
el: Απαντήστε σε ερωτήσεις και λάβετε βαθμολογία σε πραγματικό χρόνο
es: Responde preguntas y obtén puntuación en tiempo real

# onboardingAiAutoGenerateTitle
source: Auto-Generate Questions
ar: توليد تلقائي للأسئلة
ca: Auto-genera preguntes
el: Αυτόματη Δημιουργία Ερωτήσεων
es: Auto-generar preguntas

# onboardingAiAutoGenerateDescription
source: From any text with GPT or Gemini
ar: من أي نص باستخدام GPT أو Gemini
ca: Des de qualsevol text amb Gemini o GPT
el: Από οποιοδήποτε κείμενο με Gemini ή GPT
es: Desde cualquier texto con GPT o Gemini

# onboardingAiStudyAssistantTitle
source: AI Study Assistant
ar: مساعد الدراسة بالذكاء الاصطناعي
ca: Assistent d'estudi IA
el: Βοηθός Μελέτης AI
es: Asistente de estudio IA

# onboardingAiStudyAssistantDescription
source: Get explanations while you learn
ar: احصل على شروحات أثناء التعلم
ca: Obtén explicacions mentre aprens
el: Λάβετε εξηγήσεις ενώ μαθαίνετε
es: Obtén explicaciones mientras aprendes

# onboardingAiMultiLanguageTitle
source: Multi-Language Support
ar: دعم لغات متعددة
ca: Suport multi-idioma
el: Υποστήριξη Πολλαπλών Γλωσσών
es: Soporte multiidioma

# onboardingAiMultiLanguageDescription
source: Generate in 13 different languages
ar: توليد بـ 13 لغة مختلفة
ca: Genera en 13 idiomes diferents
el: Δημιουργία σε 13 διαφορετικές γλώσσες
es: Genera en 13 idiomas diferentes

# validationMin0GenericError
source: Minimum 0
ar: بحد أدنى 0
ca: Mínim 0
es: Mínimo 0
eu: Gutxienez 0
hi: न्यूनतम 0
zh: 至少 0

# errorStatus
source: Error
ar: خطأ
zh: 错误

# aiButtonText
source: AI
ca: IA
de: KI
es: IA
fr: IA
gl: IA
it: IA
pt: IA

# defaultOutputFileName
source: output-file.quiz
ca: fitxer-sortida.quiz
de: ausgabe-datei.quiz
es: archivo-salida.quiz
eu: irteera-fitxategia.quiz
fr: fichier-sortie.quiz
gl: ficheiro-saída.quiz
it: file-output.quiz
pt: arquivo-saida.quiz
