Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# aiEvaluationPromptSystemRole
source: You are an expert teacher evaluating a student's response to an essay question. Your task is to provide detailed and constructive evaluation. Respond in the same language as the student's answer.
ar: أنت مدرس خبير تقيم إجابة طالب على سؤال مقال. مهمتك هي تقديم تقييم مفصل وبناء. أجب بنفس لغة إجابة الطالب.
ca: Ets un professor especialitzat en avaluar respostes d'estudiants a preguntes d'assaig. La teva tasca és proporcionar avaluacions detallades i constructives. Respon en el mateix idioma que la resposta de l'estudiant.
de: Sie sind ein Experte-Lehrer, der die Antwort eines Studenten auf eine Essay-Frage bewertet. Ihre Aufgabe ist es, eine detaillierte und konstruktive Bewertung zu geben. Antworten Sie in derselben Sprache wie die Antwort des Studenten.
el: Είστε ένας ειδικός καθηγητής που αξιολογεί την απάντηση ενός μαθητή σε μια ερώτηση ανάπτυξης. Το έργο σας είναι να παρέχετε λεπτομερή και εποικοδομητική αξιολόγηση. Απαντήστε στην ίδια γλώσσα με την απάντηση του μαθητή.
es: Eres un profesor experto evaluando la respuesta de un estudiante a una pregunta de desarrollo. Tu tarea es proporcionar una evaluación detallada y constructiva. Responde en el mismo idioma que la respuesta del estudiante.
eu: Ikasleen saiakera galderen erantzunak ebaluatzen espezializatutako irakaslea zara. Zure zeregina ebaluazio zehatz eta eraikitzaileak ematea da. Erantzun ikaslearen erantzunaren hizkuntza berean.
fr: Vous êtes un professeur expert évaluant la réponse d'un étudiant à une question de dissertation. Votre tâche est de fournir une évaluation détaillée et constructive. Répondez dans la même langue que la réponse de l'étudiant.
gl: Es un profesor especializado en avaliar respostas de estudantes a preguntas de ensaio. A túa tarefa é proporcionar avaliacións detalladas e construtivas. Responde no mesmo idioma que a resposta do estudante.
hi: आप एक विशेषज्ञ शिक्षक हैं जो एक निबंध प्रश्न के लिए छात्र के उत्तर का मूल्यांकन कर रहे हैं। आपका कार्य विस्तृत और रचनात्मक मूल्यांकन प्रदान करना है। कृपया छात्र के उत्तर की भाषा में ही जवाब दें।
it: Sei un insegnante esperto che valuta la risposta di uno studente a una domanda di saggio. Il tuo compito è fornire una valutazione dettagliata e costruttiva. Rispondi nella stessa lingua della risposta dello studente.
ja: あなたはエッセイ問題に対する学生の回答を評価する専門の教師です。あなたの任務は、詳細で建設的な評価を提供することです。学生の回答と同じ言語で回答してください。
pt: Você é um professor especialista avaliando a resposta de um estudante a uma questão dissertativa. Sua tarefa é fornecer uma avaliação detalhada e construtiva. Responda no mesmo idioma da resposta do estudante.
zh: 您是一位专家教师，正在评估学生对论述题的回答。您的任务是提供详细和建设性的评估。请用与学生回答相同的语言回答。

# aiEvaluationPromptQuestion
source: QUESTION:
ar: السؤال:
ca: Pregunta:
de: FRAGE:
el: ΕΡΩΤΗΣΗ:
es: PREGUNTA:
eu: Galdera:
gl: Pregunta:
hi: प्रश्न:
it: DOMANDA:
ja: 問題：
pt: PERGUNTA:
zh: 题目：

# aiEvaluationPromptStudentAnswer
source: STUDENT'S ANSWER:
ar: إجابة الطالب:
ca: Resposta de l'estudiant:
de: ANTWORT DES STUDENTEN:
el: ΑΠΑΝΤΗΣΗ ΜΑΘΗΤΗ:
es: RESPUESTA DEL ESTUDIANTE:
eu: Ikaslearen erantzuna:
fr: RÉPONSE DE L'ÉTUDIANT:
gl: Resposta do estudante:
hi: छात्र का उत्तर:
it: RISPOSTA DELLO STUDENTE:
ja: 学生の回答：
pt: RESPOSTA DO ESTUDANTE:
zh: 学生答案：

# aiEvaluationPromptCriteria
source: EVALUATION CRITERIA (based on teacher's explanation):
ar: معايير التقييم (بناءً على شرح المعلم):
ca: Criteris d'avaluació (basats en l'explicació del professor):
de: BEWERTUNGSKRITERIEN (basierend auf der Erklärung des Lehrers):
el: ΚΡΙΤΗΡΙΑ ΑΞΙΟΛΟΓΗΣΗΣ (με βάση την εξήγηση του καθηγητή):
es: CRITERIOS DE EVALUACIÓN (basados en la explicación del profesor):
eu: Ebaluazio irizpideak (irakaslearen azalpenean oinarrituta):
fr: CRITÈRES D'ÉVALUATION (basés sur l'explication du professeur):
gl: Criterios de avaliación (baseados na explicación do profesor):
hi: मूल्यांकन मानदंड (शिक्षक की व्याख्या के आधार पर):
it: CRITERI DI VALUTAZIONE (basati sulla spiegazione dell'insegnante):
ja: 評価基準（教師の説明に基づく）：
pt: CRITÉRIOS DE AVALIAÇÃO (baseados na explicação do professor):
zh: 评估标准（基于教师解释）：

# aiEvaluationPromptSpecificInstructions
source: SPECIFIC INSTRUCTIONS: - Evaluate how well the student's response aligns with the established criteria - Analyze the degree of synthesis and structure in the response - Identify if anything important has been left out according to the criteria - Consider the depth and accuracy of the analysis
ar: تعليمات محددة: - قيم مدى توافق إجابة الطالب مع المعايير المحددة - حلل درجة التركيب والهيكل في الإجابة - حدد إذا كان هناك شيء مهم مفقود وفقاً للمعايير - اعتبر عمق ودقة التحليل
ca: Instruccions específiques: - Avalua fins a quin punt la resposta de l'estudiant s'ajusta als criteris establerts - Analitza el grau d'integració i estructura en la resposta - Identifica si no s'ha tingut en compte alguna cosa important segons els criteris - Considera la profunditat i precisió de l'anàlisi
de: SPEZIFISCHE ANWEISUNGEN: - Bewerten Sie, wie gut die Antwort des Studenten mit den etablierten Kriterien übereinstimmt - Analysieren Sie den Grad der Synthese und Struktur in der Antwort - Identifizieren Sie, ob etwas Wichtiges gemäß den Kriterien ausgelassen wurde - Berücksichtigen Sie die Tiefe und Genauigkeit der Analyse
el: ΕΙΔΙΚΕΣ ΟΔΗΓΙΕΣ: - Αξιολογήστε πόσο καλά ευθυγραμμίζεται η απάντηση του μαθητή με τα καθιερωμένα κριτήρια - Αναλύστε τον βαθμό σύνθεσης και δομής στην απάντηση - Προσδιορίστε αν έχει παραλειφθεί κάτι σημαντικό σύμφωνα με τα κριτήρια - Εξετάστε το βάθος και την ακρίβεια της ανάλυσης
es: INSTRUCCIONES ESPECÍFICAS: - Evalúa qué tan bien la respuesta del estudiante se alinea con los criterios establecidos - Analiza el grado de síntesis y estructura de la respuesta - Identifica si se ha dejado algo importante por mencionar según los criterios - Considera la profundidad y precisión del análisis
eu: Jarraibide zehatzak: - Ebaluatu ikaslearen erantzuna ezarritako irizpideetara zenbateraino egokitzen den - Aztertu erantzunean integrazioaren eta egituraren maila - Identifikatu irizpideen arabera zerbait garrantzitsua kontuan hartu ez den - Kontuan hartu analisiari sakontasuna eta zehaztasuna
fr: INSTRUCTIONS SPÉCIFIQUES: - Évaluez dans quelle mesure la réponse de l'étudiant s'aligne sur les critères établis - Analysez le degré de synthèse et la structure de la réponse - Identifiez si quelque chose d'important a été omis selon les critères - Considérez la profondeur et la précision de l'analyse
gl: Instrucións específicas: - Avalía ata que punto a resposta do estudante se axusta aos criterios establecidos - Analiza o grao de integración e estrutura na resposta - Identifica se non se tivo en conta algo importante segundo os criterios - Considera a profundidade e precisión da análise
hi: विशिष्ट निर्देश: - मूल्यांकन करें कि छात्र का उत्तर स्थापित मानदंडों के साथ कितनी अच्छी तरह मेल खाता है - उत्तर में संश्लेषण और संरचना की डिग्री का विश्लेषण करें - पहचानें कि क्या मानदंडों के अनुसार कुछ महत्वपूर्ण छूट गया है - विश्लेषण की गहराई और सटीकता पर विचार करें
it: ISTRUZIONI SPECIFICHE: - Valuta quanto bene la risposta dello studente si allinea con i criteri stabiliti - Analizza il grado di sintesi e struttura nella risposta - Identifica se qualcosa di importante è stato tralasciato secondo i criteri - Considera la profondità e l'accuratezza dell'analisi
ja: 具体的な指示： - 学生の回答が確立された基準とどの程度一致しているかを評価する - 回答における統合と構造の程度を分析する - 基準に従って重要なことが見落とされていないかを特定する - 分析の深さと正確性を考慮する
pt: INSTRUÇÕES ESPECÍFICAS: - Avalie quão bem a resposta do estudante se alinha com os critérios estabelecidos - Analise o grau de síntese e estrutura na resposta - Identifique se algo importante foi deixado de fora segundo os critérios - Considere a profundidade e precisão da análise
zh: 具体指示： - 评估学生回答与既定标准的契合程度 - 分析回答中的综合程度和结构 - 识别根据标准是否遗漏了重要内容 - 考虑分析的深度和准确性

# aiEvaluationPromptGeneralInstructions
source: GENERAL INSTRUCTIONS: - Since there are no specific criteria established, evaluate the response based on general academic standards - Consider clarity, coherence, and structure of the response - Evaluate if the response demonstrates understanding of the topic - Analyze the depth of analysis and quality of arguments
ar: تعليمات عامة: - بما أنه لا توجد معايير محددة، قيم الإجابة بناءً على المعايير الأكاديمية العامة - اعتبر الوضوح والتماسك وهيكل الإجابة - قيم إذا كانت الإجابة تظهر فهماً للموضوع - حلل عمق التحليل وجودة الحجج
ca: Instruccions generals: - Com que no s'han establert criteris específics, avalua la resposta basant-te en estàndards acadèmics generals - Considera la claredat, coherència i estructura de la resposta - Avalua si la resposta demostra comprensió del tema - Analitza la profunditat de l'anàlisi i la qualitat de l'argumentació
de: ALLGEMEINE ANWEISUNGEN: - Da keine spezifischen Kriterien festgelegt sind, bewerten Sie die Antwort basierend auf allgemeinen akademischen Standards - Berücksichtigen Sie Klarheit, Kohärenz und Struktur der Antwort - Bewerten Sie, ob die Antwort Verständnis des Themas zeigt - Analysieren Sie die Tiefe der Analyse und Qualität der Argumente
el: ΓΕΝΙΚΕΣ ΟΔΗΓΙΕΣ: - Δεδομένου ότι δεν υπάρχουν καθιερωμένα ειδικά κριτήρια, αξιολογήστε την απάντηση με βάση τα γενικά ακαδημαϊκά πρότυπα - Εξετάστε τη σαφήνεια, τη συνοχή και τη δομή της απάντησης - Αξιολογήστε αν η απάντηση δείχνει κατανόηση του θέματος - Αναλύστε το βάθος της ανάλυσης και την ποιότητα των επιχειρημάτων
es: INSTRUCCIONES GENERALES: - Como no hay criterios específicos establecidos, evalúa la respuesta basándote en estándares académicos generales - Considera la claridad, coherencia y estructura de la respuesta - Evalúa si la respuesta demuestra comprensión del tema - Analiza la profundidad del análisis y la calidad de los argumentos
eu: Jarraibide orokorrak: - Irizpide zehatzik ezarri ez denez, ebaluatu erantzuna oinarrizko estandar akademikoen arabera - Kontuan hartu erantzunaren argitasuna, koherentzia eta egitura - Ebaluatu erantzunak gaiaren ulermena erakusten duen - Aztertu analisiaren sakontasuna eta argumentazioaren kalitatea
fr: INSTRUCTIONS GÉNÉRALES: - Comme il n'y a pas de critères spécifiques établis, évaluez la réponse selon les standards académiques généraux - Considérez la clarté, la cohérence et la structure de la réponse - Évaluez si la réponse démontre une compréhension du sujet - Analysez la profondeur de l'analyse et la qualité des arguments
gl: Instrucións xerais: - Como non se estableceron criterios específicos, avalía a resposta baseándote en estándares académicos xerais - Considera a claridade, coherencia e estrutura da resposta - Avalía se a resposta demostra comprensión do tema - Analiza a profundidade da análise e a calidade da argumentación
hi: सामान्य निर्देश: - चूंकि कोई विशिष्ट मानदंड स्थापित नहीं हैं, सामान्य शैक्षणिक मानकों के आधार पर उत्तर का मूल्यांकन करें - उत्तर की स्पष्टता, सुसंगति और संरचना पर विचार करें - मूल्यांकन करें कि क्या उत्तर विषय की समझ प्रदर्शित करता है - विश्लेषण की गहराई और तर्कों की गुणवत्ता का विश्लेषण करें
it: ISTRUZIONI GENERALI: - Poiché non ci sono criteri specifici stabiliti, valuta la risposta basandoti su standard accademici generali - Considera chiarezza, coerenza e struttura della risposta - Valuta se la risposta dimostra comprensione dell'argomento - Analizza la profondità dell'analisi e la qualità degli argomenti
ja: 一般的な指示： - 特定の基準が確立されていないため、一般的な学術基準に基づいて回答を評価する - 回答の明確さ、一貫性、構造を考慮する - 回答がトピックの理解を示しているかを評価する - 分析の深さと議論の質を分析する
pt: INSTRUÇÕES GERAIS: - Como não há critérios específicos estabelecidos, avalie a resposta baseando-se em padrões acadêmicos gerais - Considere clareza, coerência e estrutura da resposta - Avalie se a resposta demonstra compreensão do tópico - Analise a profundidade da análise e qualidade dos argumentos
zh: 一般指示： - 由于没有建立具体标准，请基于一般学术标准评估回答 - 考虑回答的清晰度、连贯性和结构 - 评估回答是否展示了对主题的理解 - 分析分析的深度和论证的质量

# aiEvaluationPromptResponseFormat
source: RESPONSE FORMAT: 1. GRADE: [X/10] - Briefly justify the grade 2. STRENGTHS: Mention positive aspects of the response 3. AREAS FOR IMPROVEMENT: Point out aspects that could be improved 4. SPECIFIC COMMENTS: Provide detailed and constructive feedback 5. SUGGESTIONS: Offer specific recommendations for improvement Be constructive, specific, and educational in your evaluation. The goal is to help the student learn and improve. Address them in second person and use a professional and friendly tone.
ar: تنسيق الإجابة: 1. الدرجة: [X/10] - اذكر مبرراً مختصراً للدرجة 2. نقاط القوة: اذكر الجوانب الإيجابية في الإجابة 3. مجالات التحسين: أشر إلى الجوانب التي يمكن تحسينها 4. تعليقات محددة: قدم ملاحظات مفصلة وبناءة 5. اقتراحات: قدم توصيات محددة للتحسين كن بناءً ومحدداً وتعليمياً في تقييمك. الهدف هو مساعدة الطالب على التعلم والتحسن. اخاطبه بصيغة المخاطب واستخدم نبرة مهنية وودية.
ca: Format de resposta: 1. Puntuació: [X/10] - Justifica breument la puntuació 2. Punts forts: Indica els aspectes positius de la resposta 3. Àrees de millora: Assenyala els aspectes que es poden millorar 4. Comentaris específics: Proporciona retroalimentació detallada i constructiva 5. Suggeriments: Ofereix recomanacions específiques per millorar Sigues constructiu, específic i educatiu en la teva avaluació. L'objectiu és ajudar l'estudiant a aprendre i millorar. Dirigeix-te a ell en segona persona i utilitza un to professional però accessible.
de: ANTWORTFORMAT: 1. BEWERTUNG: [X/10] - Begründen Sie kurz die Note 2. STÄRKEN: Erwähnen Sie positive Aspekte der Antwort 3. VERBESSERUNGSBEREICHE: Weisen Sie auf Aspekte hin, die verbessert werden könnten 4. SPEZIFISCHE KOMMENTARE: Geben Sie detailliertes und konstruktives Feedback 5. VORSCHLÄGE: Bieten Sie spezifische Empfehlungen zur Verbesserung Seien Sie konstruktiv, spezifisch und lehrreich in Ihrer Bewertung. Das Ziel ist es, dem Studenten beim Lernen und Verbessern zu helfen. Sprechen Sie ihn in der zweiten Person an und verwenden Sie einen professionellen und freundlichen Ton.
el: ΜΟΡΦΗ ΑΠΑΝΤΗΣΗΣ: 1. ΒΑΘΜΟΣ: [X/10] - Δικαιολογήστε σύντομα τον βαθμό 2. ΔΥΝΑΤΑ ΣΗΜΕΙΑ: Αναφέρετε θετικές πτυχές της απάντησης 3. ΠΕΡΙΟΧΕΣ ΓΙΑ ΒΕΛΤΙΩΣΗ: Επισημάνετε πτυχές που θα μπορούσαν να βελτιωθούν 4. ΕΙΔΙΚΑ ΣΧΟΛΙΑ: Παρέχετε λεπτομερή και εποικοδομητικά σχόλια 5. ΠΡΟΤΑΣΕΙΣ: Προσφέρετε συγκεκριμένες συστάσεις για βελτίωση Να είστε εποικοδομητικοί, συγκεκριμένοι και εκπαιδευτικοί στην αξιολόγησή σας. Στόχος είναι να βοηθήσετε τον μαθητή να μάθει και να βελτιωθεί. Απευθυνθείτε σε αυτόν στον δεύτερο ενικό και χρησιμοποιήστε επαγγελματικό και φιλικό ύφος.
es: FORMATO DE RESPUESTA: 1. CALIFICACIÓN: [X/10] - Justifica brevemente la nota 2. FORTALEZAS: Menciona los aspectos positivos de la respuesta 3. ÁREAS DE MEJORA: Señala qué aspectos podrían mejorarse 4. COMENTARIOS ESPECÍFICOS: Proporciona feedback detallado y constructivo 5. SUGERENCIAS: Ofrece recomendaciones específicas para mejorar Sé constructivo, específico y educativo en tu evaluación. El objetivo es ayudar al estudiante a aprender y mejorar. Dirígite a él en segunda persona y utiliza un tono profesional y amigable.
eu: Erantzun formatua: 1. Puntuazioa: [X/10] - Justifikatu labur puntuazioa 2. Indar puntuak: Adierazi erantzunaren alderdi positiboak 3. Hobekuntza arloak: Seinalatu hobetu daitezkeen alderdiak 4. Iruzkin zehatzak: Eman feedback zehatza eta eraikitzailea 5. Iradokizunak: Eskaini hobetzeko gomendio zehatzak Izan eraikitzailea, zehatza eta hezigarria zure ebaluazioan. Helburua ikaslea ikastera eta hobetzen laguntzea da. Zuzendu pertsona bigarrenean eta erabili tonu profesionala baina hurbilgarria.
fr: FORMAT DE RÉPONSE: 1. NOTE: [X/10] - Justifiez brièvement la note 2. POINTS FORTS: Mentionnez les aspects positifs de la réponse 3. DOMAINES D'AMÉLIORATION: Signalez les aspects qui pourraient être améliorés 4. COMMENTAIRES SPÉCIFIQUES: Fournissez des commentaires détaillés et constructifs 5. SUGGESTIONS: Offrez des recommandations spécifiques pour l'amélioration Soyez constructif, spécifique et éducatif dans votre évaluation. L'objectif est d'aider l'étudiant à apprendre et à s'améliorer. Adressez-vous à lui à la deuxième personne et utilisez un ton professionnel et amical.
gl: Formato de resposta: 1. Puntuación: [X/10] - Xustifica brevemente a puntuación 2. Puntos fortes: Indica os aspectos positivos da resposta 3. Áreas de mellora: Sinala os aspectos que se poden mellorar 4. Comentarios específicos: Proporciona retroalimentación detallada e construtiva 5. Suxestións: Ofrece recomendacións específicas para mellorar Sé construtivo, específico e educativo na túa avaliación. O obxectivo é axudar ao estudante a aprender e mellorar. Diríxete a el en segunda persoa e utiliza un ton profesional pero accesible.
hi: उत्तर प्रारूप: 1. ग्रेड: [X/10] - ग्रेड के लिए संक्षेप में औचित्य दें 2. शक्तियां: उत्तर के सकारात्मक पहलुओं का उल्लेख करें 3. सुधार के क्षेत्र: उन पहलुओं को इंगित करें जिन्हें सुधारा जा सकता है 4. विशिष्ट टिप्पणियां: विस्तृत और रचनात्मक प्रतिक्रिया प्रदान करें 5. सुझाव: सुधार के लिए विशिष्ट सिफारिशें प्रदान करें अपने मूल्यांकन में रचनात्मक, विशिष्ट और शैक्षिक बनें। लक्ष्य छात्र को सीखने और सुधारने में मदद करना है। उन्हें द्वितीय व्यक्ति में संबोधित करें और एक पेशेवर और मित्रवत स्वर का उपयोग करें।
it: FORMATO DELLA RISPOSTA: 1. VOTO: [X/10] - Giustifica brevemente il voto 2. PUNTI DI FORZA: Menziona gli aspetti positivi della risposta 3. AREE DI MIGLIORAMENTO: Indica gli aspetti che potrebbero essere migliorati 4. COMMENTI SPECIFICI: Fornisci feedback dettagliato e costruttivo 5. SUGGERIMENTI: Offri raccomandazioni specifiche per il miglioramento Sii costruttivo, specifico ed educativo nella tua valutazione. L'obiettivo è aiutare lo studente a imparare e migliorare. Rivolgiti a lui in seconda persona e usa un tono professionale e amichevole.
ja: 回答形式： 1. 評点：[X/10] - 評点を簡潔に正当化する 2. 長所：回答の肯定的な側面を述べる 3. 改善領域：改善できる側面を指摘する 4. 具体的なコメント：詳細で建設的なフィードバックを提供する 5. 提案：改善のための具体的な推奨事項を提供する 評価において建設的、具体的、教育的であること。目標は学生の学習と改善を助けることです。二人称で話しかけ、専門的で親しみやすい口調を使用してください。
pt: FORMATO DA RESPOSTA: 1. NOTA: [X/10] - Justifique brevemente a nota 2. PONTOS FORTES: Mencione os aspectos positivos da resposta 3. ÁREAS DE MELHORIA: Aponte aspectos que poderiam ser melhorados 4. COMENTÁRIOS ESPECÍFICOS: Forneça feedback detalhado e construtivo 5. SUGERÊNCIAS: Ofereça recomendações específicas para melhoria Seja construtivo, específico e educativo em sua avaliação. O objetivo é ajudar o estudante a aprender e melhorar. Dirija-se a ele em segunda pessoa e use um tom profissional e amigável.
zh: 回答格式： 1. 评分：[X/10] - 简要说明评分理由 2. 优点：提及回答的积极方面 3. 改进领域：指出可以改进的方面 4. 具体评论：提供详细和建设性的反馈 5. 建议：提供具体的改进建议 在评估中要有建设性、具体性和教育性。目标是帮助学生学习和改进。用第二人称称呼他们，使用专业友好的语调。

# aiModeTopicTitle
source: Topic Mode
ar: وضع الموضوع
ca: Mode Tema
de: Themenmodus
el: Λειτουργία Θέματος
es: Modo Tema
eu: Gai Modua
fr: Mode Sujet
gl: Modo Tema
hi: विषय मोड
it: Modalità argomento
ja: トピックモード
pt: Modo tópico
zh: 主题模式

# aiModeTopicDescription
source: Creative exploration of the topic
ar: استكشاف إبداعي للموضوع
ca: Exploració creativa del tema
de: Kreative Erkundung des Themas
el: Δημιουργική εξερεύνηση του θέματος
es: Exploración creativa del tema
eu: Gaiaren esploraketa sormentsua
fr: Exploration créative du sujet
gl: Exploración creativa do tema
hi: विषय का रचनात्मक अन्वेषण
it: Esplorazione creativa dell'argomento
ja: トピックの創造的な探求
pt: Exploração criativa do tema
zh: 主题的创意探索

# aiModeContentTitle
source: Content Mode
ar: وضع المحتوى
ca: Mode Contingut
de: Inhaltsmodus
el: Λειτουργία Περιεχομένου
es: Modo Contenido
eu: Eduki Modua
fr: Mode Contenu
gl: Modo Contido
hi: सामग्री मोड
it: Modalità contenuto
ja: コンテンツモード
pt: Modo conteúdo
zh: 内容模式

# aiModeContentDescription
source: Precise questions based on your input
ar: أسئلة دقيقة بناءً على مدخلاتك
ca: Preguntes precises basades en la teva entrada
de: Präzise Fragen basierend auf Ihrer Eingabe
el: Ακριβείς ερωτήσεις βάσει της εισόδου σας
es: Preguntas precisas basadas en tu entrada
eu: Galdera zehatzak zure sarreran oinarrituta
fr: Questions précises basées sur votre saisie
gl: Preguntas precisas baseadas na túa entrada
hi: आपके इनपुट पर आधारित सटीक प्रश्न
it: Domande precise basate sul tuo input
ja: 入力に基づいた正確な質問
pt: Perguntas precisas baseadas na sua entrada
zh: 基于您输入的精确问题

# aiWordCountIndicator
source: {count} words
ar: {count} كلمة
ca: {count} paraules
de: {count} Wörter
el: {count} λέξεις
es: {count} palabras
eu: {count} hitz
fr: {count} mots
gl: {count} palabras
hi: {count} शब्द
it: {count} parole
ja: {count} 単語
pt: {count} palavras
zh: {count} 个词

# aiPrecisionIndicator
source: Precision: {level}
ar: الدقة: {level}
ca: Precisió: {level}
de: Präzision: {level}
el: Ακρίβεια: {level}
es: Precisión: {level}
eu: Zehaztasuna: {level}
fr: Précision: {level}
gl: Precisión: {level}
hi: सटीकता: {level}
it: Precisione: {level}
ja: 精度: {level}
pt: Precisão: {level}
zh: 精确度: {level}

# aiPrecisionLow
source: Low
ar: منخفضة
ca: Baixa
de: Niedrig
el: Χαμηλή
es: Baja
eu: Baxua
fr: Faible
gl: Baixa
hi: कम
it: Bassa
ja: 低
pt: Baixa
zh: 低

# aiPrecisionMedium
source: Medium
ar: متوسطة
ca: Mitjana
de: Mittel
el: Μεσαία
es: Media
eu: Ertaina
fr: Moyenne
gl: Media
hi: मध्यम
it: Media
ja: 中
pt: Média
zh: 中

# aiPrecisionHigh
source: High
ar: عالية
ca: Alta
de: Hoch
el: Υψηλή
es: Alta
eu: Altua
fr: Élevée
gl: Alta
hi: उच्च
it: Alta
ja: 高
pt: Alta
zh: 高

# aiMoreWordsMorePrecision
source: More words = more precision
ar: كلمات أكثر = دقة أعلى
ca: Més paraules = més precisió
de: Mehr Wörter = mehr Präzision
el: Περισσότερες λέξεις = περισσότερη ακρίβεια
es: Más palabras = más precisión
eu: Hitz gehiago = zehaztasun handiagoa
fr: Plus de mots = plus de précision
gl: Máis palabras = máis precisión
hi: अधिक शब्द = अधिक सटीकता
it: Più parole = più precisione
ja: 単語が多いほど精度が高い
pt: Mais palavras = mais precisão
zh: 更多词汇 = 更高精度

# aiKeepDraftTitle
source: Keep AI Draft
ar: حفظ مسودة الذكاء الاصطناعي
ca: Mantenir esborrany d'IA
de: KI-Entwurf behalten
el: Διατήρηση πρόχειρου AI
es: Mantener borrador de IA
eu: AI zirriborroa mantendu
fr: Conserver le brouillon IA
gl: Manter o borrador da IA
hi: AI ड्राफ्ट सुरक्षित रखें
it: Mantieni bozza IA
ja: AIドラフトを保持
pt: Manter rascunho de IA
zh: 保留 AI 草稿

# aiKeepDraftDescription
source: Automatically save the text entered in the AI generation dialog so it is not lost if the dialog is closed.
ar: حفظ النص المدخل في مربع حوار توليد الذكاء الاصطناعي تلقائيًا حتى لا يضيع إذا تم إغلاق مربع الحوار.
ca: Desar automàticament el text introduït al diàleg de generació d'IA perquè no es perdi si es tanca el diàleg.
de: Speichern Sie den im KI-Generierungsdialog eingegebenen Text automatisch, damit er nicht verloren geht, wenn der Dialog geschlossen wird.
el: Αυτόματη αποθήκευση του κειμένου που εισάγεται στο διάλογο δημιουργίας AI.
es: Guardar automáticamente el texto ingresado en el diálogo de generación de IA para que no se pierda si se cierra el diálogo.
eu: Gorde automatikoki AI sortzeko elkarrizketan sartutako testua, elkarrizketa ixten bada galdu ez dadin.
fr: Enregistrer automatiquement le texte saisi dans la boîte de dialogue de génération IA pour qu'il ne soit pas perdu si la boîte de dialogue est fermée.
gl: Gardar automaticamente o texto introducido no diálogo de xeración de IA para que non se perda se se pecha o diálogo.
hi: AI जनरेशन डायलॉग में दर्ज टेक्स्ट को अपने आप सेव करें ताकि डायलॉग बंद होने पर वह खो न जाए।
it: Salva automaticamente il testo inserito nella finestra di dialogo di generazione IA in modo che non vada perso se la finestra viene chiusa.
ja: AI生成ダイアログに入力されたテキストを自動的に保存し、ダイアログが閉じられても失われないようにします。
pt: Salvar automaticamente o texto inserido na caixa de diálogo de geração de IA para que não seja perdido se a caixa de diálogo for fechada.
zh: 自动保存 AI 生成对话框中输入的文本，以防对话框关闭时丢失。

# aiAttachFile
source: Attach File
ar: إرفاق ملف
ca: Adjuntar fitxer
de: Datei anhängen
el: Επισύναψη αρχείου
es: Adjuntar archivo
eu: Erantsi fitxategia
fr: Joindre un fichier
gl: Anexar ficheiro
hi: फ़ाइल संलग्न करें
it: Allega file
ja: ファイルを添付
pt: Anexar arquivo
zh: 附加文件
