Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# aiRemoveFile
source: Remove file
ar: إزالة ملف
ca: Eliminar fitxer
de: Datei entfernen
el: Αφαίρεση αρχείου
es: Eliminar archivo
eu: Kendu fitxategia
fr: Supprimer le fichier
gl: Eliminar ficheiro
hi: फ़ाइल निकालें
it: Rimuovi file
ja: ファイルを削除
pt: Remover arquivo
zh: 删除文件

# aiFileMode
source: File Mode
ar: وضع الملف
ca: Mode fitxer
de: Dateimodus
el: Λειτουργία αρχείου
es: Modo archivo
eu: Fitxategi modua
fr: Mode fichier
gl: Modo ficheiro
hi: फ़ाइल मोड
it: Modalità file
ja: ファイルモード
pt: Modo de arquivo
zh: 文件模式

# aiFileModeDescription
source: Questions will be generated from the attached file
ar: سيتم توليد الأسئلة من الملف المرفق
ca: Les preguntes es generaran a partir del fitxer adjunt
de: Fragen werden aus der angehängten Datei generiert
el: Οι ερωτήσεις θα δημιουργηθούν από το επισυναπτόμενο αρχείο
es: Las preguntas se generarán a partir del archivo adjunto
eu: Galderak erantsitako fitxategitik sortuko dira
fr: Les questions seront générées à partir du fichier joint
gl: As preguntas xeraranse a partir do ficheiro anexado
hi: संलग्न फ़ाइल से प्रश्न उत्पन्न किए जाएंगे
it: Le domande verranno generate dal file allegato
ja: 添付されたファイルから質問が生成されます
pt: As perguntas serão geradas a partir do arquivo anexo
zh: 将从附件文件中生成问题

# aiCommentsLabel
source: Comments (Optional)
ar: تعليقات (اختياري)
ca: Comentaris (Opcional)
de: Kommentare (Optional)
el: Σχόλια (Προαιρετικό)
es: Comentarios (Opcional)
eu: Iruzkinak (Aukerakoa)
fr: Commentaires (Optionnel)
gl: Comentarios (Opcional)
hi: टिप्पणियाँ (वैकल्पिक)
it: Commenti (Opzionale)
ja: コメント（任意）
pt: Comentários (Opcional)
zh: 评论（可选）

# aiCommentsHint
source: Add instructions or comments about the attached file...
ar: أضف تعليمات أو تعليقات بخصوص الملف المرفق...
ca: Afegiu instruccions o comentaris sobre el fitxer adjunt...
de: Anweisungen oder Kommentare zur angehängten Datei hinzufügen...
el: Προσθέστε οδηγίες ή σχόλια σχετικά με το επισυναπτόμενο αρχείο...
es: Añade instrucciones o comentarios sobre el archivo adjunto...
eu: Gehitu erantsitako fitxategiari buruzko argibideak edo iruzkinak...
fr: Ajouter des instructions ou des commentaires sur le fichier joint...
gl: Engade instrucións ou comentarios sobre o ficheiro anexado...
hi: संलग्न फ़ाइल के बारे में निर्देश या टिप्पणियाँ जोड़ें...
it: Aggiungi istruzioni o commenti sul file allegato...
ja: 添付ファイルに関する指示やコメントを追加...
pt: Adicionar instruções ou comentários sobre o arquivo anexo...
zh: 添加关于附件文件的说明或评论...

# aiCommentsHelperText
source: Optionally add instructions on how to generate questions from the file
ar: يمكنك إضافة تعليمات اختيارية حول كيفية توليد الأسئلة من الملف
ca: Opcionalment, afegiu instruccions sobre com generar preguntes a partir del fitxer
de: Optional Anweisungen hinzufügen, wie Fragen aus der Datei generiert werden sollen
el: Προαιρετικά προσθέστε οδηγίες σχετικά με τον τρόπο δημιουργίας ερωτήσεων από το αρχείο
es: Opcionalmente, añade instrucciones sobre cómo generar preguntas a partir del archivo
eu: Aukeran, gehitu fitxategitik galderak nola sortu jakiteko argibideak
fr: Ajouter éventuellement des instructions sur la façon de générer des questions à partir du fichier
gl: Opcionalmente, engade instrucións sobre como xerar preguntas a partir do ficheiro
hi: वैकल्पिक रूप से फ़ाइल से प्रश्न कैसे उत्पन्न करें, इस पर निर्देश जोड़ें
it: Facoltativamente aggiungi istruzioni su come generare domande dal file
ja: 必要に応じて、ファイルから質問を生成する方法に関する指示を追加してください
pt: Opcionalmente, adicione instruções sobre como gerar perguntas a partir do arquivo
zh: 可选地添加关于如何从文件生成问题的说明

# aiFilePickerError
source: Could not load the selected file
ar: تعذر تحميل الملف المحدد
ca: No s'ha pogut carregar el fitxer seleccionat
de: Die ausgewählte Datei konnte nicht geladen werden
el: Δεν ήταν δυνατή η φόρτωση του επιλεγμένου αρχείου
es: No se pudo cargar el archivo seleccionado
eu: Ezin izan da hautatutako fitxategia kargatu
fr: Impossible de charger le fichier sélectionné
gl: Non se puido cargar o ficheiro seleccionado
hi: चयनित फ़ाइल लोड नहीं की जा सकी
it: Impossibile caricare il file selezionato
ja: 選択したファイルを読み込めませんでした
pt: Não foi possível carregar o arquivo selecionato
zh: 无法加载所选文件

# studyModeLabel
source: Study Mode
ar: وضع الدراسة
ca: Mode estudi
de: Lernmodus
el: Λειτουργία Μελέτης
es: Modo Estudio
eu: Ikasteko Modua
fr: Mode Étude
gl: Modo estudo
hi: अध्ययन मोड
it: Modalità studio
ja: 学習モード
pt: Modo estudo
zh: 学习模式

# studyModeDescription
source: AI assistance available. Instant feedback after each answer with no time limits or penalties.
ar: مساعدة الذكاء الاصطناعي متاحة. تعليقات فورية بعد كل إجابة بدون حدود زمنية أو عقوبات.
ca: Assistència d'IA disponible. Feedback instantani després de cada resposta, sense límits de temps ni penalitzacions.
de: Sofortiges Feedback und kein Timer
el: Διαθέσιμη βοήθεια AI. Άμεση ανατροφοδότηση μετά από κάθε απάντηση, χωρίς χρονικά όρια ή ποινές.
es: Asistencia de IA disponible. Feedback instantáneo tras cada respuesta, sin límites de tiempo ni penalizaciones.
eu: Berehalako feedbacka eta denborarik gabe
fr: Feedback instantané et pas de minuterie
gl: Retroalimentación instantánea e sen tempo
hi: AI सहायता उपलब्ध है। समय सीमा या दंड के बिना प्रत्येक उत्तर के बाद त्वरित प्रतिक्रिया।
it: Feedback immediato e nessun timer
ja: 即時フィードバック、タイマーなし
pt: Feedback instantâneo e sem cronômetro
zh: 提供 AI 辅助。每题回答后提供即时反馈，无时间限制或扣分。

# examModeLabel
source: Exam Mode
ar: وضع الاختبار
ca: Mode examen
de: Prüfungsmodus
el: Λειτουργία Εξέτασης
es: Modo Examen
eu: Azterketa Modua
fr: Mode Examen
gl: Modo exame
hi: परीक्षा मोड
it: Modalità esame
ja: 試験モード
pt: Modo exame
zh: 考试模式

# examModeDescription
source: No AI assistance. Time limits and penalties for incorrect answers may apply.
ar: بدون مساعدة الذكاء الاصطناعي. قد يتم تطبيق حدود زمنية وعقوبات على الإجابات غير الصحيحة.
ca: Sense assistència d'IA. Es poden aplicar límits de temps i penalitzacions per respostes incorrectes.
de: Standard-Timer und Ergebnisse am Ende
el: Χωρίς βοήθεια AI. Ενδέχεται να ισχύουν χρονικά όρια και ποινές για λανθασμένες απαντήσεις.
es: Sin asistencia de IA. Pueden aplicar límites de tiempo y penalizaciones por respuestas incorrectas.
eu: Denbora estandarra eta emaitzak amaieran
fr: Minuterie standard et résultats à la fin
gl: Tempo estándar e resultados ao final
hi: कोई AI सहायता नहीं। समय सीमा और गलत उत्तरों के लिए जुर्माना लागू हो सकता है।
it: Timer standard e risultati alla fine
ja: 標準時間、最後に結果表示
pt: Cronômetro padrão e resultados no final
zh: 无 AI 辅助。可能适用时间限制和答错扣分。

source: Check Answer
ar: تحقق
ca: Comprovar
de: Überprüfen
el: Έλεγχος
es: Comprobar
eu: Egiaztatu
fr: Vérifier
gl: Comprobar
hi: जांचें
it: Controlla
ja: 確認
pt: Verificar
zh: 检查

# quizModeTitle
source: Quiz Mode
ar: وضع الاختبار
ca: Mode qüestionari
de: Quizmodus
el: Λειτουργία Κουίζ
es: Modo Cuestionario
eu: Galdetegi Modua
fr: Mode Quiz
gl: Modo cuestionario
hi: क्विज़ मोड
it: Modalità quiz
ja: クイズモード
pt: Modo quiz
zh: 测验模式

source: Skip
ar: تخطي
ca: Saltar
de: Überspringen
el: Παράλειψη
es: Saltar
eu: Saltatu
fr: Passer
gl: Saltar
hi: छोड़ें
it: Salta
ja: スキップ
pt: Pular
zh: 跳过

source: Ask AI Assistant
ar: اسأل مساعد الذكاء الاصطناعي
ca: Pregunta a l'assistent d'IA
de: KI-Assistenten fragen
el: Ρωτήστε τον Βοηθό AI
es: Preguntar a la IA
eu: Galdetu AI Laguntzaileari
fr: Demander à l'IA
gl: Preguntar ao asistente de IA
hi: AI सहायक से पूछें
it: Chiedi all'assistente AI
ja: AIアシスタントに聞く
pt: Perguntar ao Assistente de IA
zh: 询问 AI 助手

# askAiAboutQuestion
source: Ask AI about this question
ar: اسأل الذكاء الاصطناعي عن هذا السؤال
ca: Pregunta a l'IA sobre aquesta pregunta
el: Ρωτήστε την AI για αυτήν την ερώτηση
es: Preguntar a la IA sobre esta pregunta
eu: Galdetu AIri galdera honi buruz
hi: इस प्रश्न के बारे में AI से पूछें
it: Chiedi all'AI su questa domanda
zh: 向 AI 询问此问题

# aiHelpWithQuestion
source: Help me understand this question
ar: ساعدني في فهم هذا السؤال
ca: Ajuda'm a entendre aquesta pregunta
el: Βοήθησέ με να κατανοήσω αυτήν την ερώτηση
es: Ayúdame a entender esta pregunta
eu: Lagundu galdera hau ulertzen
hi: इस प्रश्न को समझने में मेरी मदद करो
it: Aiutami a capire questa domanda
zh: 帮我理解这道题

source: Edit
ar: تعديل
ca: Editar
de: Bearbeiten
el: Επεξεργασία
es: Editar
eu: Editatu
fr: Modifier
gl: Editar
hi: संपादित करें
it: Modifica
ja: 編集
pt: Editar
zh: 编辑

source: Enable
ar: تفعيل
ca: Activar
de: Aktivieren
el: Ενεργοποίηση
es: Activar
eu: Gaitu
fr: Activer
gl: Activar
hi: सक्षम करें
it: Abilita
ja: 有効化
pt: Ativar
zh: 启用

source: Disable
ar: تعطيل
ca: Desactivar
de: Deaktivieren
el: Απενεργοποίηση
es: Desactivar
eu: Desgaitu
fr: Désactiver
gl: Desactivar
hi: अक्षम करें
it: Disabilita
ja: 無効化
pt: Desativar
zh: 禁用

# reorderQuestionsTooltip
source: Reorder Questions
ar: إعادة ترتيب الأسئلة
ca: Reordenar preguntes
de: Fragen neu ordnen
el: Αναδιάταξη ερωτήσεων
es: Reordenar preguntas
eu: Galderak berrantolatu
fr: Réorganiser les questions
gl: Reordenar preguntas
hi: प्रश्नों को पुनः व्यवस्थित करें
it: Riordina domande
ja: 質問を並べ替える
pt: Reordenar perguntas
zh: 重新排序问题

# quizPreviewTitle
source: Quiz Preview
ar: معاينة الاختبار
ca: Vista prèvia del qüestionari
de: Quiz-Vorschau
el: Προεπισκόπηση Κουίζ
es: Vista Previa del Quiz
eu: Galdetegiaren Aurrebista
fr: Aperçu du Quiz
gl: Vista previa do cuestionario
hi: प्रश्नोत्तरी पूर्वावलोकन
it: Anteprima Quiz
ja: クイズプレビュー
pt: Pré-visualização do Quiz
zh: 测验预览

source: Select
ar: تحديد
ca: Seleccionar
de: Auswählen
el: Επιλογή
es: Seleccionar
eu: Hautatu
fr: Sélectionner
gl: Seleccionar
hi: चुनें
it: Seleziona
ja: 選択
pt: Selecionar
zh: 选择

source: Done
ar: تم
ca: Fet
de: Fertig
el: Τέλος
es: Listo
eu: Eginda
fr: Terminé
gl: Feito
hi: हो गया
it: Fatto
ja: 完了
pt: Concluído
zh: 完成

# importButton
source: Import
ar: استيراد
ca: Importar
de: Importieren
el: Εισαγωγή
es: Importar
eu: Inportatu
fr: Importer
gl: Importar
hi: आयात करें
it: Importa
ja: インポート
pt: Importar
zh: 导入

# reorderButton
source: Reorder
ar: إعادة ترتيب
ca: Reordenar
de: Neu ordnen
el: Αναδιάταξη
es: Reordenar
eu: Berrantolatu
fr: Réorganiser
gl: Reordenar
hi: पुनः क्रमित करें
it: Riordina
ja: 並べ替え
pt: Reordenar
zh: 重新排序

# startQuizButton
source: Start Quiz
ar: بدء الاختبار
ca: Començar qüestionari
de: Quiz starten
el: Έναρξη Κουίζ
es: Comenzar Quiz
eu: Hasi Galdetegia
fr: Commencer le Quiz
gl: Comezar cuestionario
hi: प्रश्नोत्तरी शुरू करें
it: Inizia Quiz
ja: クイズを開始
pt: Iniciar Quiz
zh: 开始测验

# deleteConfirmation
source: Are you sure you want to delete this quiz?
ar: هل أنت متأكد أنك تريد حذف هذا الاختبار؟
ca: Esteu segur que voleu eliminar aquest qüestionari?
de: Sind Sie sicher, dass Sie dieses Quiz löschen möchten?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτό το κουίζ;
es: ¿Seguro que quieres eliminar este quiz?
eu: Ziur zaude galdetegi hau ezabatu nahi duzula?
fr: Êtes-vous sûr de vouloir supprimer ce quiz ?
gl: Estás seguro de que queres eliminar este cuestionario?
hi: क्या आप वाकई इस प्रश्नोत्तरी को हटाना चाहते हैं?
it: Sei sicuro di voler eliminare questo quiz?
ja: このクイズを削除してもよろしいですか？
pt: Tem certeza de que deseja excluir este quiz?
zh: 您确定要删除此测验吗？

# saveSuccess
source: File saved successfully
ar: تم حفظ الملف بنجاح
ca: Fitxer desat correctament
de: Datei erfolgreich gespeichert
el: Το αρχείο αποθηκεύτηκε επιτυχώς
es: Archivo guardado exitosamente
eu: Fitxategia ondo gorde da
fr: Fichier enregistré avec succès
gl: Ficheiro gardado correctamente
hi: फ़ाइल सफलतापूर्वक सहेजी गई
it: File salvato con successo
ja: ファイルが正常に保存されました
pt: Arquivo salvo com sucesso
zh: 文件保存成功

source: Error saving file
ar: خطأ في حفظ الملف
ca: Error en desar el fitxer
de: Fehler beim Speichern der Datei
el: Σφάλμα κατά την αποθήκευση του αρχείου
es: Error al guardar el archivo
eu: Errorea fitxategia gordetzean
fr: Erreur lors de l'enregistrement du fichier
gl: Erro ao gardar o ficheiro
hi: फ़ाइल सहेजने में त्रुटि
it: Errore durante il salvataggio del file
ja: ファイルの保存中にエラーが発生しました
pt: Erro ao salvar o arquivo
zh: 保存文件时出错

# deleteSingleQuestionConfirmation
source: Are you sure you want to delete this question?
ar: هل أنت متأكد أنك تريد حذف هذا السؤال؟
ca: Estàs segur que vols eliminar aquesta pregunta?
de: Sind Sie sicher, dass Sie diese Frage löschen möchten?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την ερώτηση;
es: ¿Estás seguro de que quieres eliminar esta pregunta?
eu: Ziur zaude galdera hau ezabatu nahi duzula?
fr: Êtes-vous sûr de vouloir supprimer cette question ?
gl: Estás seguro de que queres eliminar esta pregunta?
hi: क्या आप वाकई इस प्रश्न को हटाना चाहते हैं?
it: Sei sicuro di voler eliminare questa domanda?
ja: この質問を削除してもよろしいですか？
pt: Tem certeza de que deseja excluir esta pergunta?
zh: 您确定要删除这个问题吗？

# deleteMultipleQuestionsConfirmation
source: Are you sure you want to delete {count} questions?
ar: هل أنت متأكد أنك تريد حذف {count} أسئلة؟
ca: Estàs segur que vols eliminar {count} preguntes?
de: Sind Sie sicher, dass Sie {count} Fragen löschen möchten?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε {count} ερωτήσεις;
es: ¿Estás seguro de que quieres eliminar {count} preguntas?
eu: Ziur zaude {count} galdera ezabatu nahi dituzula?
fr: Êtes-vous sûr de vouloir supprimer {count} questions ?
gl: Estás seguro de que queres eliminar {count} preguntas?
hi: क्या आप वाकई {count} प्रश्नों को हटाना चाहते हैं?
it: Sei sicuro di voler eliminare {count} domande?
ja: {count} 個の質問を削除してもよろしいですか？
pt: Tem certeza de que deseja excluir {count} perguntas?
zh: 您确定要删除 {count} 个问题吗？

source: Missing explanation
ar: شرح مفقود
ca: Manca explicació
de: Erklärung fehlt
el: Λείπει η επεξήγηση
es: Falta explicación
eu: Azalpena falta da
fr: Explication manquante
gl: Falta explicación
hi: स्पष्टीकरण गायब है
it: Spiegazione mancante
ja: 説明がありません
pt: Explicação em falta
zh: 缺少解释

# missingExplanationTooltip
source: This question is missing an explanation
ar: هذا السؤال يفتقد للشرح
ca: Aquesta pregunta no té explicació
de: Dieser Frage fehlt eine Erklärung
el: Αυτή η ερώτηση δεν έχει επεξήγηση
es: Esta pregunta no tiene explicación
eu: Galdera honek ez du azalpenik
fr: Cette question n'a pas d'explication
gl: Esta pregunta non ten explicación
hi: इस प्रश्न का कोई स्पष्टीकरण नहीं है
it: Questa domanda non ha spiegazione
ja: この質問には説明がありません
pt: Esta pergunta não tem explicação
zh: 此问题没有解释

# questionTypeTooltip
source: Question type: {type}
ar: نوع السؤال: {type}
ca: Tipus de pregunta: {type}
de: Fragetyp: {type}
el: Τύπος ερώτησης: {type}
es: Tipos de pregunta: {type}
eu: Galdera mota: {type}
fr: Type de question : {type}
gl: Tipo de pregunta: {type}
hi: प्रश्न का प्रकार: {type}
it: Tipo di domanda: {type}
ja: 質問の種類: {type}
pt: Tipo de pergunta: {type}
zh: 问题类型：{type}

# settingsTitle
source: Settings
ar: الإعدادات
ca: Configuració
de: Einstellungen
el: Ρυθμίσεις
es: Ajustes
eu: Ezarpenak
fr: Paramètres
gl: Axustes
hi: सेटिंग्स
it: Impostazioni
ja: 設定
pt: Configurações
zh: 设置

# questionsOverview
source: Questions Map
ar: خريطة الأسئلة
ca: Mapa de preguntes
el: Χάρτης Ερωτήσεων
es: Ver mapa de preguntas
eu: Galdera mapa
gl: Mapa de preguntas
it: Mappa delle domande
pt: Mapa de questões
zh: 题目概览

# keepPracticing
source: Keep practicing to improve!
ar: استمر في التدريب للتحسن!
ca: Segueix practicant per millorar!
de: Übe weiter, um dich zu verbessern!
el: Συνεχίστε την εξάσκηση για να βελτιωθείτε!
es: ¡Sigue practicando para mejorar!
eu: Jarraitu praktikatzen hobetzeko!
fr: Continuez à vous entraîner pour vous améliorer !
gl: Segue practicando para mellorar!
hi: सुधार के लिए अभ्यास जारी रखें!
it: Continua a fare pratica per migliorare!
ja: 改善のために練習を続けましょう！
pt: Continue praticando para melhorar!
zh: 继续练习以提高！

source: Try Again
ar: إعادة المحاولة
ca: Tornar a intentar
de: Erneut versuchen
el: Δοκιμάστε ξανά
es: Intentar de nuevo
eu: Berriro saiatu
fr: Réessayer
gl: Intentalo de novo
hi: फिर कोशिश करें
it: Riprova
ja: もう一度試す
pt: Tentar novamente
zh: 再试一次

source: Review
ar: مراجعة
ca: Repassar
de: Überprüfen
el: Ανασκόπηση
es: Repasar
eu: Berrikusi
fr: Réviser
gl: Repasar
hi: समीक्षा
it: Ripassa
ja: 復習する
pt: Revisar
zh: 复习

source: Home
ar: الرئيسية
ca: Inici
de: Startseite
el: Αρχική
es: Inicio
eu: Hasiera
fr: Accueil
gl: Inicio
hi: होम
ja: ホーム
pt: Início
zh: 首页

# allLabel
source: All
ar: الكل
ca: Totes
de: Alle
el: Όλες
es: Todas
eu: Guztiak
fr: Toutes
gl: Todas
hi: सभी
it: Tutte
ja: すべて
pt: Todas
zh: 全部

# finishQuizUnansweredQuestions
source: You have {unansweredCount, plural, =1{1 unanswered question} other{{unansweredCount} unanswered questions}}. Are you sure you want to finish?
ar: لديك {unansweredCount,plural, =1{سؤال واحد غير مجاب}other{{unansweredCount} أسئلة غير مجابة}}. هل أنت متأكد أنك تريد إنهاء الاختبار؟
ca: Tens {unansweredCount,plural, =1{1 pregunta sense respondre}other{{unansweredCount} preguntes sense respondre}}. Segur que vols acabar el qüestionari?
de: Du hast {unansweredCount,plural, =1{1 unbeantwortete Frage}other{{unansweredCount} unbeantwortete Fragen}}. Bist du sicher, dass du das Quiz beenden möchtest?
el: Έχετε {unansweredCount,plural, =1{1 αναπάντητη ερώτηση}other{{unansweredCount} αναπάντητες ερωτήσεις}}. Είστε σίγουροι ότι θέλετε να ολοκληρώσετε το κουίζ?
es: Tienes {unansweredCount,plural, =1{1 pregunta sin responder}other{{unansweredCount} preguntas sin responder}}. ¿Estás seguro de que quieres terminar el cuestionario?
eu: {unansweredCount,plural, =1{erantzun gabeko galdera 1}other{{unansweredCount} erantzun gabeko galdera}} dituzu. Ziur galdetegia amaitu nahi duzula?
fr: Vous avez {unansweredCount,plural, =1{1 question sans réponse}other{{unansweredCount} questions sans réponse}}. Êtes-vous sûr de vouloir terminer le quiz ?
gl: Tes {unansweredCount,plural, =1{1 pregunta sen contestar}other{{unansweredCount} preguntas sen contestar}}. Estás seguro de que queres finalizar o cuestionario?
hi: आपके पास {unansweredCount,plural, =1{1 निरुत्तरित प्रश्न है}other{{unansweredCount} निरुत्तरित प्रश्न हैं}}। क्या आप वाकई क्विज़ समाप्त करना चाहते हैं?
it: Hai {unansweredCount,plural, =1{1 domanda senza risposta}other{{unansweredCount} domande senza risposta}}. Sei sicuro di voler terminare il quiz?
ja: {unansweredCount,plural, =1{1 問の未回答があります}other{{unansweredCount} 問の未回答があります}}。クイズを終了してもよろしいですか？
pt: Você tem {unansweredCount,plural, =1{1 pergunta não respondida}other{{unansweredCount} perguntas não respondidas}}. Tem certeza de que deseja finalizar o quiz?
zh: 你还有 {unansweredCount,plural, =1{1 道未回答的问题}other{{unansweredCount} 道未回答的问题}}。你确定要结束测验吗？

# subtractPointsLabel
source: Subtract points for wrong answer
ar: خصم نقاط للإجابة الخاطئة
ca: Restar punts per resposta incorrecta
de: Punkte für falsche Antwort abziehen
el: Αφαίρεση πόντων για λάθος απάντηση
es: Restar puntos por respuesta incorrecta
eu: Kendu puntuak erantzun okerrengatik
fr: Retirer des points pour une mauvaise réponse
gl: Restar puntos por resposta incorrecta
hi: गलत उत्तर के लिए अंक घटाएं
it: Sottrai punti per risposta errata
ja: 不正解でポイントを減点
pt: Subtrair pontos por resposta errada
zh: 答错扣分

# subtractPointsDescription
source: Subtract points for each incorrect answer.
ar: خصم نقاط عن كل إجابة خاطئة.
ca: Resta punts per cada resposta incorrecta.
el: Αφαίρεση πόντων για κάθε λάθος απάντηση.
es: Resta puntos por cada respuesta incorrecta.
hi: प्रत्येक गलत उत्तर के लिए अंक घटाएं।
zh: 每答错一题扣除分数。

# subtractPointsOffDescription
source: Incorrect answers do not deduct points.
ar: الإجابات الخاطئة لا تخصم نقاطا.
ca: Les respostes incorrectes no resten punts.
el: Οι λάθος απαντήσεις δεν αφαιρούν πόντους.
es: Las respuestas incorrectas no restan puntos.
hi: गलत उत्तर अंक नहीं घटाते हैं।
zh: 回答错误不会扣分。

# penaltyAmountLabel
source: Penalty amount
ar: مبلغ الغرامة
ca: Quantitat de penalització
de: Strafbetrag
el: Ποσό ποινής
es: Cantidad de penalización
eu: Penalizazio kopurua
fr: Montant de la pénalité
gl: Cantidade de penalización
hi: दंड राशि
it: Importo penalità
ja: ペナルティ額
pt: Valor da penalidade
zh: 扣分金额

# penaltyPointsLabel
source: -{amount} pts / mistake
ar: -{amount} نقاط / خطأ
ca: -{amount} pts / error
de: -{amount} Pkt. / Fehler
el: -{amount} πόντοι / λάθος
es: -{amount} pts / error
eu: -{amount} puntu / errore
fr: -{amount} pts / erreur
gl: -{amount} pts / erro
hi: -{amount} अंक / गलती
it: -{amount} pt / errore
ja: -{amount} 点 / 誤答
pt: -{amount} pts / erro
zh: -{amount} 分 / 错误

# allQuestionsLabel
source: All Questions
ar: جميع الأسئلة
ca: Totes les preguntes
de: Alle Fragen
el: Όλες οι ερωτήσεις
es: Todas las preguntas
eu: Galdera guztiak
fr: Toutes les questions
gl: Todas as preguntas
hi: सभी प्रश्न
it: Tutte le domande
ja: すべての問題
pt: Todas as perguntas
zh: 所有题目

# startWithSelectedQuestions
source: Start with {count} selected
ar: ابدأ بـ {count} محددة
ca: Iniciar amb {count} seleccionades
de: Mit {count} ausgewählten starten
el: Έναρξη με {count} επιλεγμένες
es: Iniciar con {count} seleccionadas
eu: Hasi {count} hautatuekin
fr: Commencer avec {count} sélectionnées
gl: Iniciar con {count} seleccionadas
hi: {count} चयनित के साथ शुरू करें
it: Inizia con {count} selezionate
ja: {count}問を選択して開始
pt: Iniciar com {count} selecionadas
zh: 开始 {count} 道已选题目

# advancedSettingsTitle
source: Advanced Settings (Debug)
ar: إعدادات متقدمة (تصحيح الأخطاء)
ca: Ajustes Avançats (Debug)
de: Erweiterte Einstellungen (Debug)
el: Σύνθετες Ρυθμίσεις (Debug)
es: Ajustes Avanzados (Debug)
eu: Ezarpen Aurreratuak (Debug)
fr: Paramètres avancés (Debug)
gl: Axustes Avanzados (Debug)
hi: उन्नत सेटिंग्स (डिबग)
it: Impostazioni avanzate (Debug)
ja: 詳細設定 (デバッグ)
pt: Configurações Avançadas (Debug)
zh: 高级设置 (调试)

# appLanguageLabel
source: App Language
ar: لغة التطبيق
ca: Idioma de l'aplicació
de: App-Sprache
el: Γλώσσα εφαρμογής
es: Idioma de la aplicación
eu: Aplikazioaren hizkuntza
fr: Langue de l'application
gl: Idioma da aplicación
hi: ऐप की भाषा
it: Lingua dell'app
ja: アプリの言語
pt: Idioma do aplicativo
zh: 应用语言

# appLanguageDescription
source: Override application language for testing
ar: تجاوز لغة التطبيق للاختبار
ca: Sobreescriure l'idioma de l'aplicació per a proves
de: Anwendungssprache für Tests überschreiben
el: Παράκαμψη γλώσσας εφαρμογής για δοκιμές
es: Sobrescribir el idioma de la aplicación para pruebas
eu: Aplikazioaren hizkuntza gainidatzi probetarako
fr: Remplacer la langue de l'application pour les tests
gl: Sobrescribir o idioma da aplicación para probas
hi: परीक्षण के लिए एप्लिकेशन भाषा को ओवरराइड करें
it: Sovrascrivi la lingua dell'applicazione per i test
ja: テスト用にアプリの言語を上書きする
pt: Substituir o idioma do aplicativo para testes
zh: 覆盖用于测试的应用语言

source: Paste from clipboard
ar: لصق من الحافظة
ca: Enganxar des del porta-retalls
el: Επικόλληση από πρόχειρο
es: Pegar desde portapapeles
eu: Itsatsi arbeletik
fr: Coller depuis le presse-papiers
gl: Pegar dende o portapapeis
hi: क्लिपबोर्ड से पेस्ट करें
it: Incolla dagli appunti
ja: クリップボードから貼り付け
zh: 从剪贴板粘贴

# pasteImage
source: Paste
ar: لصق
ca: Enganxar
el: Επικόλληση
es: Pegar
eu: Itsatsi
fr: Coller
gl: Pegar
hi: पेस्ट
it: Incolla
ja: 貼り付け
zh: 粘贴

# clipboardNoImage
source: No image found in clipboard
ar: لم يتم العثور على صورة في الحافظة
ca: No s'ha trobat cap imatge al porta-retalls
el: Δεν βρέθηκε εικόνα στο πρόχειρο
es: No se encontró imagen en el portapapeles
eu: Ez da irudirik aurkitu arbelean
fr: Aucune image trouvée dans le presse-papiers
gl: Non se atopou imaxe no portapapeis
hi: क्लिपबोर्ड में कोई छवि नहीं मिली
it: Nessuna immagine trovata negli appunti
ja: クリップボードに画像が見つかりません
zh: 剪贴板中未找到图片

# maxIncorrectAnswersLabel
source: Limit incorrect answers
ar: تقييد الإجابات الخاطئة
ca: Límit d'errors
el: Περιορισμός λανθασμένων απαντήσεων
es: Limitar respuestas incorrectas
eu: Errore muga
gl: Límite de erros
hi: गलत उत्तरों को सीमित करें
it: Limita risposte errate
ja: 不正解数を制限する
pt: Limitar respostas incorretas
zh: 限制错误答案
