Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# questionTypeSingleChoice
source: Single Choice
ar: اختيار واحد
ca: Elecció única
de: Einfachauswahl
el: Μονής Επιλογής
es: Opción única
eu: Aukera Bakarra
fr: Choix unique
gl: Elección única
hi: एकल विकल्प
it: Scelta singola
ja: 単一選択
pt: Escolha única
zh: 单选题

# questionTypeTrueFalse
source: True/False
ar: صح/خطأ
ca: Cert/Fals
de: Wahr/Falsch
el: Σωστό/Λάθος
es: Verdadero/Falso
eu: Egia/Gezurra
fr: Vrai/Faux
gl: Certo/Falso
hi: सही/गलत
it: Vero/Falso
ja: 真偽
pt: Verdadeiro/Falso
zh: 判断题

# questionTypeEssay
source: Essay
ar: مقالي
ca: Desenvolupament
de: Aufsatz
el: Ανάπτυξης
es: Desarrollo
eu: Galdera irekia
fr: Question à développement
gl: Desenvolvemento
hi: निबंध
it: Risposta aperta
ja: 記述式
pt: Dissertativa
zh: 论述题

# questionTypeRandom
source: All
ar: مختلط
ca: Tots
de: Alle
el: Μεικτό
es: Todos
eu: Guztiak
fr: Tous
gl: Todos
hi: मिश्रित
it: Tutti
ja: すべて
pt: Todos
zh: 全部

# questionTypeUnknown
source: Unknown
ar: غير معروف
ca: Desconegut
de: Unbekannt
el: Άγνωστο
es: Desconocido
eu: Ezezaguna
fr: Inconnu
gl: Descoñecido
hi: अज्ञात
it: Sconosciuto
ja: 不明
pt: Desconhecido
zh: 未知

# optionsCount
source: {count, plural, =1{1 option} other{{count} options}}
ar: {count, plural, =1{خيار واحد} other{{count} خيارات}}
ca: {count, plural, =1{1 opció} other{{count} opcions}}
de: {count, plural, =1{1 Option} other{{count} Optionen}}
el: {count, plural, =1{1 επιλογή} other{{count} επιλογές}}
es: {count, plural, =1{1 opción} other{{count} opciones}}
eu: {count, plural, =1{aukera 1} other{{count} aukera}}
gl: {count, plural, =1{1 opción} other{{count} opcións}}
hi: {count, plural, =1{1 विकल्प} other{{count} विकल्प}}
it: {count, plural, =1{1 opzione} other{{count} opzioni}}
ja: {count, plural, =1{1つの選択肢} other{{count}つの選択肢}}
pt: {count, plural, =1{1 opção} other{{count} opções}}
zh: {count, plural, =1{1个选项} other{{count}个选项}}

# optionsTooltip
source: Number of answer options for this question
ar: عدد خيارات الإجابة لهذا السؤال
ca: Nombre d'opcions de resposta per aquesta pregunta
de: Anzahl der Antwortoptionen für diese Frage
el: Αριθμός επιλογών απάντησης για αυτή την ερώτηση
es: Número de opciones de respuesta para esta pregunta
eu: Galdera honetarako erantzun aukera kopurua
fr: Nombre d'options de réponse pour cette question
gl: Número de opcións de resposta para esta pregunta
hi: इस प्रश्न के लिए उत्तर विकल्पों की संख्या
it: Numero di opzioni di risposta per questa domanda
ja: この問題の回答選択肢の数
pt: Número de opções de resposta para esta pergunta
zh: 此问题的答案选项数量

# imageTooltip
source: This question has an associated image
ar: هذا السؤال له صورة مرتبطة
ca: Aquesta pregunta té una imatge associada
de: Diese Frage hat ein zugehöriges Bild
el: Αυτή η ερώτηση έχει συσχετισμένη εικόνα
es: Esta pregunta tiene una imagen asociada
eu: Galdera honek lotutako irudia du
fr: Cette question a une image associée
gl: Esta pregunta ten unha imaxe asociada
hi: इस प्रश्न के साथ चित्र जुड़ा है
it: Questa domanda ha un'immagine associata
ja: この問題には関連する画像があります
pt: Esta pergunta tem uma imagem associada
zh: 此问题有关联的图片

# explanationTooltip
source: This question has an explanation
ar: هذا السؤال له شرح
ca: Aquesta pregunta té una explicació
de: Diese Frage hat eine Erklärung
el: Αυτή η ερώτηση έχει εξήγηση
es: Esta pregunta tiene una explicación
eu: Galdera honek azalpena du
fr: Cette question a une explication
gl: Esta pregunta ten unha explicación
hi: इस प्रश्न का स्पष्टीकरण है
it: Questa domanda ha una spiegazione
ja: この問題には解説があります
pt: Esta pergunta tem uma explicação
zh: 此问题有解释

# aiPrompt
source: Focus on the student's question, not on directly answering the original exam question. Explain with a pedagogical approach. For practical exercises or math problems, provide step-by-step instructions. For theoretical questions, provide a concise explanation without structuring the response in sections. Respond in the same language you are asked in.
ar: ركز على سؤال الطالب، وليس على الإجابة مباشرة على سؤال الامتحان الأصلي. اشرح بمنهج تربوي. بالنسبة للتمارين العملية أو المسائل الرياضية، قدم تعليمات خطوة بخطوة. بالنسبة للأسئلة النظرية، قدم شرحًا موجزًا دون تنظيم الإجابة في أقسام. أجب بنفس اللغة التي سُئلت بها.
ca: Centreu-vos en la pregunta de l'estudiant, no en respondre directament la pregunta original de l'examen. Expliqueu amb un enfocament pedagògic. Per a exercicis pràctics o problemes matemàtics, proporcioneu instruccions pas a pas. Per a preguntes teòriques, proporcioneu una explicació concisa sense estructurar la resposta en seccions. Responeu en la mateixa llengua en què se us pregunta.
de: Konzentrieren Sie sich auf die Frage des Studenten, nicht auf die direkte Beantwortung der ursprünglichen Prüfungsfrage. Erklären Sie mit einem pädagogischen Ansatz und liefern Sie klare Argumente ohne abzuschweifen oder vom Thema abzukommen. Strukturieren Sie die Antwort nicht in Abschnitte. Beziehen Sie sich nicht auf sich selbst. Antworten Sie in derselben Sprache, in der Sie gefragt werden.
el: Εστιάστε στην ερώτηση του μαθητή, όχι στο να απαντήσετε απευθείας την αρχική ερώτηση εξέτασης. Εξηγήστε με παιδαγωγική προσέγγιση. Για πρακτικές ασκήσεις ή μαθηματικά προβλήματα, παρέχετε οδηγίες βήμα προς βήμα. Για θεωρητικές ερωτήσεις, παρέχετε μια συνοπτική εξήγηση χωρίς να δομείτε την απάντηση σε ενότητες. Απαντάτε στην ίδια γλώσσα που σας ρωτούν.
es: Enfócate en la pregunta del estudiante, no en responder directamente la pregunta original del examen. Explica con un enfoque pedagógico. Para ejercicios prácticos o problemas matemáticos, proporciona instrucciones paso a paso. Para preguntas teóricas, proporciona una explicación concisa sin estructurar la respuesta en secciones. Responde en el mismo idioma en que te pregunten.
eu: Zentratu ikaslearen galderan, ez jatorrizko azterketa galderari zuzenean erantzutean. Azaldu ikuspegi pedagogiko batekin. Ariketa praktikoetarako edo arazo matematikoetarako, eman urratsez urratseko argibideak. Galdera teorikoetarako, eman azalpen zehatza erantzuna ataletan egituratu gabe. Erantzun beti galdetu zaizun hizkuntza berean.
fr: Concentrez-vous sur la question de l'étudiant, pas sur la réponse directe à la question d'examen originale. Expliquez avec une approche pédagogique. Pour les exercices pratiques ou les problèmes mathématiques, fournissez des instructions étape par étape. Pour les questions théoriques, fournissez une explication concise sans structurer la réponse en sections. Répondez dans la même langue que celle dans laquelle on vous a posé la question.
gl: Céntrate na pregunta do estudante, non en responder directamente á pregunta orixinal do exame. Explica cun enfoque pedagóxico. Para exercicios prácticos ou problemas matemáticos, proporciona instrucións paso a paso. Para preguntas teóricas, proporciona unha explicación concisa sen estruturar a resposta en seccións. Responde na mesma lingua na que se che pregunta.
hi: छात्र के प्रश्न पर ध्यान दें, मूल परीक्षा प्रश्न का सीधे उत्तर देने पर नहीं। एक शैक्षणिक दृष्टिकोण के साथ समझाएं। व्यावहारिक अभ्यासों या गणित की समस्याओं के लिए, चरण-दर-चरण निर्देश प्रदान करें। सैद्धांतिक प्रश्नों के लिए, उत्तर को अनुभागों में व्यवस्थित किए बिना एक संक्षिप्त स्पष्टीकरण प्रदान करें। उसी भाषा में उत्तर दें जिसमें आपसे पूछा गया है।
it: Concentrati sulla domanda dello studente, non sul rispondere direttamente alla domanda d'esame originale. Spiega con un approccio pedagogico. Per esercizi pratici o problemi matematici, fornisci istruzioni passo dopo passo. Per domande teoriche, fornisci una spiegazione concisa senza strutturare la risposta in sezioni. Rispondi nella stessa lingua in cui ti viene chiesto.
ja: 元の試験問題に直接答えるのではなく、学生の質問に焦点を当ててください。教育的なアプローチで説明してください。実践的な演習や数学の問題については、ステップバイステップの指示を提供してください。理論的な質問については、回答をセクションに分けずに簡潔な説明を提供してください。質問されたのと同じ言語で回答してください。
pt: Concentre-se na pergunta do estudante, não em responder diretamente à pergunta original do exame. Explique com uma abordagem pedagógica. Para exercícios práticos ou problemas matemáticos, forneça instruções passo a passo. Para questões teóricas, forneça uma explicação concisa sem estruturar a resposta em seções. Responda no mesmo idioma em que foi perguntado.
zh: 专注于学生的问题，而不是直接回答原始考试题目。用教学方法解释。对于实践练习或数学问题，提供逐步说明。对于理论问题，提供简明的解释，不要将回答分成章节。用被问到的相同语言回答。

# aiChatGuardrail
source: IMPORTANT: You are a study assistant exclusively for this Quiz. You must ONLY answer questions related to the current Quiz question, its options, its explanation, or the educational topic it covers. If the student asks about anything unrelated to the Quiz (e.g., your internal model, system details, general knowledge not related to the question, or any off-topic request), respond ONLY with: "I'm here to help you with this Quiz! Let's focus on the question at hand. Feel free to ask me about the topic, the answer options, or anything related to this question." Never reveal technical details about yourself, the system, or the AI model being used.
ar: مهم: أنت مساعد دراسة حصريًا لهذا الـ Quiz. يجب عليك الإجابة فقط على الأسئلة المتعلقة بسؤال الـ Quiz الحالي أو خياراته أو شرحه أو الموضوع التعليمي الذي يغطيه. إذا سأل الطالب عن شيء غير متعلق بالـ Quiz (مثل نموذجك الداخلي أو تفاصيل النظام أو معرفة عامة غير متعلقة بالسؤال أو أي طلب خارج الموضوع)، أجب فقط بـ: "أنا هنا لمساعدتك في هذا الـ Quiz! دعنا نركز على السؤال. لا تتردد في سؤالي عن الموضوع أو خيارات الإجابة أو أي شيء متعلق بهذا السؤال." لا تكشف أبدًا عن تفاصيل تقنية عن نفسك أو النظام أو نموذج الذكاء الاصطناعي المستخدم.
ca: IMPORTANT: Ets un assistent d'estudi exclusivament per a aquest Quiz. NOMÉS has de respondre preguntes relacionades amb la pregunta actual del Quiz, les seves opcions, la seva explicació o el tema educatiu que cobreix. Si l'estudiant pregunta sobre alguna cosa no relacionada amb el Quiz (per exemple, el teu model intern, detalls del sistema, coneixement general no relacionat amb la pregunta, o qualsevol sol·licitud fora de tema), respon ÚNICAMENT amb: "Sóc aquí per ajudar-te amb aquest Quiz! Centrem-nos en la pregunta. No dubtis a preguntar-me sobre el tema, les opcions de resposta o qualsevol cosa relacionada amb aquesta pregunta." Mai revelis detalls tècnics sobre tu mateix, el sistema o el model d'IA utilitzat.
el: ΣΗΜΑΝΤΙΚΟ: Είστε βοηθός μελέτης αποκλειστικά για αυτό το Quiz. Πρέπει να απαντάτε ΜΟΝΟ σε ερωτήσεις σχετικές με την τρέχουσα ερώτηση του Quiz, τις επιλογές της, την εξήγησή της ή το εκπαιδευτικό θέμα που καλύπτει. Εάν ο μαθητής ρωτήσει κάτι άσχετο με το Quiz (π.χ. το εσωτερικό σας μοντέλο, λεπτομέρειες του συστήματος, γενικές γνώσεις μη σχετικές με την ερώτηση, ή οποιοδήποτε αίτημα εκτός θέματος), απαντήστε ΜΟΝΟ με: "Είμαι εδώ για να σας βοηθήσω με αυτό το Quiz! Ας εστιάσουμε στην ερώτηση. Μη διστάσετε να με ρωτήσετε για το θέμα, τις επιλογές απάντησης ή οτιδήποτε σχετικό με αυτή την ερώτηση." Μην αποκαλύπτετε ποτέ τεχνικές λεπτομέρειες για τον εαυτό σας, το σύστημα ή το μοντέλο AI που χρησιμοποιείται.
es: IMPORTANTE: Eres un asistente de estudio exclusivamente para este Quiz. SOLO debes responder preguntas relacionadas con la pregunta actual del Quiz, sus opciones, su explicación o el tema educativo que cubre. Si el estudiante pregunta sobre algo no relacionado con el Quiz (por ejemplo, tu modelo interno, detalles del sistema, conocimiento general no relacionado con la pregunta, o cualquier solicitud fuera de tema), responde ÚNICAMENTE con: "¡Estoy aquí para ayudarte con este Quiz! Centrémonos en la pregunta. No dudes en preguntarme sobre el tema, las opciones de respuesta o cualquier cosa relacionada con esta pregunta." Nunca reveles detalles técnicos sobre ti mismo, el sistema o el modelo de IA utilizado.
eu: GARRANTZITSUA: Quiz honetarako soilik ikasketa laguntzailea zara. Quiz galdera arruntari, bere aukerei, azalpenari edo lantzen duen gai hezitzaileari lotutako galderei SOILIK erantzun behar diezu. Ikasleak Quiz-arekin zerikusirik ez duen zerbait galdetzen badu (adibidez, zure barne eredua, sistemaren xehetasunak, galderarekin loturarik gabeko ezagutza orokorra, edo gaiari buruz ez den eskaeraren bat), erantzun SOILIK honekin: "Hemen nago Quiz honekin laguntzeko! Galderan zentratu gaitezen. Lasai galdetu gaiari, erantzun aukerei edo galdera honekin lotutako edozertari buruz." Ez ezazu inoiz zure buruari, sistemari edo erabilitako AI ereduari buruzko xehetasun teknikorik agerian utzi.
hi: महत्वपूर्ण: आप विशेष रूप से इस Quiz के लिए एक अध्ययन सहायक हैं। आपको केवल वर्तमान Quiz प्रश्न, उसके विकल्पों, उसकी व्याख्या या उसके शैक्षिक विषय से संबंधित प्रश्नों का उत्तर देना चाहिए। यदि छात्र Quiz से असंबंधित कुछ पूछता है (जैसे, आपका आंतरिक मॉडल, सिस्टम विवरण, प्रश्न से असंबंधित सामान्य ज्ञान, या कोई भी विषय-बाह्य अनुरोध), तो केवल इसके साथ उत्तर दें: "मैं इस Quiz में आपकी मदद के लिए यहाँ हूँ! चलिए प्रश्न पर ध्यान केंद्रित करें। विषय, उत्तर विकल्पों या इस प्रश्न से संबंधित किसी भी चीज़ के बारे में मुझसे पूछने में संकोच न करें।" अपने बारे में, सिस्टम या उपयोग किए जा रहे AI मॉडल के बारे में कभी भी तकनीकी विवरण प्रकट न करें।
it: IMPORTANTE: Sei un assistente allo studio esclusivamente per questo Quiz. Devi rispondere SOLO a domande relative alla domanda attuale del Quiz, alle sue opzioni, alla sua spiegazione o all'argomento educativo trattato. Se lo studente chiede qualcosa non correlato al Quiz (ad esempio, il tuo modello interno, dettagli del sistema, conoscenze generali non correlate alla domanda, o qualsiasi richiesta fuori tema), rispondi SOLO con: "Sono qui per aiutarti con questo Quiz! Concentriamoci sulla domanda. Non esitare a chiedermi dell'argomento, delle opzioni di risposta o di qualsiasi cosa relativa a questa domanda." Non rivelare mai dettagli tecnici su te stesso, il sistema o il modello di IA utilizzato.
ja: 重要：あなたはこのQuiz専用の学習アシスタントです。現在のQuizの質問、その選択肢、説明、またはカバーしている教育的トピックに関連する質問にのみ回答してください。学生がQuizに関係のないことを質問した場合（例：あなたの内部モデル、システムの詳細、質問に関係のない一般知識、またはトピック外のリクエスト）、次のメッセージのみで回答してください：「このQuizのお手伝いをするためにここにいます！質問に集中しましょう。トピック、回答の選択肢、またはこの質問に関連することについて、お気軽にお聞きください。」自分自身、システム、または使用されているAIモデルに関する技術的な詳細は決して明かさないでください。
zh: 重要：你是专门为本Quiz服务的学习助手。你只能回答与当前Quiz问题、其选项、解释或所涉及的教育主题相关的问题。如果学生询问与Quiz无关的内容（例如你的内部模型、系统详情、与问题无关的一般知识或任何离题请求），请仅回复："我在这里帮助你完成这个Quiz！让我们专注于当前的问题。请随时向我询问关于主题、答案选项或与这个问题相关的任何内容。"绝不要透露关于你自己、系统或所使用的AI模型的技术细节。

# questionLabel
source: Question
ar: السؤال
ca: Pregunta
de: Frage
el: Ερώτηση
es: Pregunta
eu: Galdera
gl: Pregunta
hi: प्रश्न
it: Domanda
ja: 問題
pt: Pergunta
zh: 问题

source: Student comment
ar: تعليق الطالب
ca: Comentari de l'estudiant
de: Kommentar des Studenten
el: Σχόλιο μαθητή
es: Comentario del estudiante
eu: Ikaslearen iruzkinak
fr: Commentaire de l'étudiant
gl: Comentario do estudante
hi: छात्र की टिप्पणी
it: Commento studente
ja: 学生のコメント
pt: Comentário do estudante
zh: 学生评论

# aiAssistantTitle
source: AI Study Assistant
ar: مساعد الدراسة الذكي
ca: Assistent d'estudi IA
de: KI-Lernassistent
el: Βοηθός Μελέτης AI
es: Asistente de estudio IA
eu: Ikasketa AI Laguntzailea
fr: Assistant d'étude IA
gl: Asistente de estudo IA
hi: AI अध्ययन सहायक
it: Assistente di studio IA
ja: AI学習アシスタント
pt: Assistente de estudo IA
zh: AI学习助手

source: Question Context
ar: سياق السؤال
ca: Context de la pregunta
de: Fragenkontext
el: Πλαίσιο Ερώτησης
es: Contexto de la pregunta
eu: Galderaren Testuingurua
fr: Contexte de la question
gl: Contexto da pregunta
hi: प्रश्न संदर्भ
it: Contesto domanda
ja: 問題の背景
pt: Contexto da pergunta
zh: 问题背景

source: AI Assistant
ar: المساعد الذكي
ca: Assistent IA
de: KI-Assistent
el: Βοηθός AI
es: Asistente IA
eu: AI Laguntzailea
fr: Assistant IA
gl: Asistente IA
hi: AI सहायक
it: Assistente IA
ja: AIアシスタント
pt: Assistente IA
zh: AI助手

# aiThinking
source: AI is thinking...
ar: الذكاء الاصطناعي يفكر...
ca: La IA està pensant...
de: KI denkt nach...
el: Η AI σκέφτεται...
es: La IA está pensando...
eu: AI-a pentsatzen ari da...
fr: L'IA réfléchit...
gl: A IA está pensando...
hi: AI सोच रहा है...
it: L'IA sta pensando...
ja: AIが考えています...
pt: IA está pensando...
zh: AI正在思考...

# askAIHint
source: Ask your question about this topic...
ar: اطرح سؤالك حول هذا الموضوع...
ca: Feu la vostra pregunta sobre aquest tema...
de: Stellen Sie Ihre Frage zu diesem Thema...
el: Κάντε την ερώτησή σα γι' αυτό το θέμα...
es: Haz tu pregunta sobre este tema...
eu: Egin zure galdera gai honi buruz...
fr: Posez votre question sur ce sujet...
gl: Fai a túa pregunta sobre este tema...
hi: इस विषय के बारे में अपना प्रश्न पूछें...
it: Fai la tua domanda su questo argomento...
ja: このトピックについて質問してください...
pt: Faça sua pergunta sobre este tópico...
zh: 询问关于这个主题的问题...

# aiPlaceholderResponse
source: This is a placeholder response. In a real implementation, this would connect to an AI service to provide helpful explanations about the question.
ar: هذه استجابة مؤقتة. في التطبيق الحقيقي، سيتصل هذا بخدمة الذكاء الاصطناعي لتقديم شروحات مفيدة حول السؤال.
ca: Aquesta és una resposta de marcador de posició. En una implementació real, això es connectaria a un servei IA per proporcionar explicacions útils sobre la pregunta.
de: Dies ist eine Platzhalter-Antwort. In einer echten Implementierung würde dies sich mit einem KI-Service verbinden, um hilfreiche Erklärungen zur Frage zu liefern.
el: Αυτή είναι μια ενδεικτική απάντηση. Σε πραγματική υλοποίηση, αυτό θα συνδεόταν με μια υπηρεσία AI για να παρέχει χρήσιμες εξηγήσεις σχετικά με την ερώτηση.
es: Esta es una respuesta de ejemplo. En una implementación real, esto se conectaría a un servicio de IA para proporcionar explicaciones útiles sobre la pregunta.
eu: Hau leku-markatzaile erantzuna da. Benetako inplementazio batean, honek AI zerbitzu batekin konektatuko litzateke galderari buruzko azalpen baliagarriak eskaintzeko.
fr: Ceci est une réponse d'espace réservé. Dans une implémentation réelle, cela se connecterait à un service IA pour fournir des explications utiles sur la question.
gl: Esta é unha resposta de marcador de posición. Nunha implementación real, isto conectaríase a un servizo IA para proporcionar explicacións útiles sobre a pregunta.
hi: यह एक प्लेसहोल्डर प्रतिक्रिया है। वास्तविक कार्यान्वयन में, यह प्रश्न के बारे में सहायक स्पष्टीकरण प्रदान करने के लिए AI सेवा से जुड़ेगा।
it: Questa è una risposta segnaposto. In un'implementazione reale, questo si connetterebbe a un servizio IA per fornire spiegazioni utili sulla domanda.
ja: これはプレースホルダー応答です。実際の実装では、問題について有用な説明を提供するAIサービスに接続されます。
pt: Esta é uma resposta placeholder. Em uma implementação real, isso se conectaria a um serviço IA para fornecer explicações úteis sobre a pergunta.
zh: 这是一个占位符响应。在实际实现中，这将连接到AI服务，提供有关问题的有用解释。

# aiErrorResponse
source: Sorry, there was an error processing your question. Please try again.
ar: عذراً، حدث خطأ في معالجة سؤالك. يرجى المحاولة مرة أخرى.
ca: Ho sento, hi ha hagut un error en processar la vostra pregunta. Torneu-ho a provar.
de: Entschuldigung, bei der Verarbeitung Ihrer Frage ist ein Fehler aufgetreten. Bitte versuchen Sie es erneut.
el: Λυπούμαστε, υπήρξε σφάλμα κατά την επεξεργασία της ερώτησής σας. Παρακαλώ δοκιμάστε ξανά.
es: Lo siento, hubo un error al procesar tu pregunta. Por favor, inténtalo de nuevo.
eu: Barkatu, errore bat izan da zure galdera prozesatzean. Saiatu berriro.
fr: Désolé, il y a eu une erreur lors du traitement de votre question. Veuillez réessayer.
gl: Síntoo, houbo un erro procesando a túa pregunta. Téntao de novo.
hi: क्षमा करें, आपके प्रश्न को प्रोसेस करने में त्रुटि हुई। कृपया पुनः प्रयास करें।
it: Scusa, si è verificato un errore nell'elaborazione della tua domanda. Riprova.
ja: 申し訳ございませんが、質問の処理中にエラーが発生しました。もう一度お試しください。
pt: Desculpe, houve um erro ao processar sua pergunta. Tente novamente.
zh: 抱歉，处理您的问题时出现错误。请重试。

# configureApiKeyMessage
source: Please configure your AI API Key in Settings.
ar: يرجى تكوين مفتاح API للذكاء الاصطناعي في الإعدادات.
ca: Si us plau, configureu la vostra Clau API IA a la Configuració.
de: Bitte konfigurieren Sie Ihren KI-API-Schlüssel in den Einstellungen.
el: Παρακαλώ ρυθμίστε το κλειδί API AI στις Ρυθμίσεις.
es: Por favor, configura tu clave API de IA en Ajustes.
eu: Mesedez, konfigura ezazu zure AI API Gakoa Ezarpenetan.
fr: Veuillez configurer votre clé API IA dans les Paramètres.
gl: Por favor, configura a túa Clave API IA na Configuración.
hi: कृपया सेटिंग्स में अपनी AI API Key कॉन्फ़िगर करें।
it: Configura la tua chiave API IA nelle Impostazioni.
ja: 設定でAI APIキーを設定してください。
pt: Por favor, configure sua Chave API IA nas Configurações.
zh: 请在设置中配置您的AI API密钥。

# errorLabel
source: Error:
ar: خطأ:
de: Fehler:
el: Σφάλμα:
eu: Errorea:
fr: Erreur :
gl: Erro:
hi: त्रुटि:
it: Errore:
ja: エラー：
pt: Erro:
zh: 错误：

source: No response received
ar: لم يتم استلام رد
ca: Cap resposta rebuda
de: Keine Antwort erhalten
el: Δεν ελήφθη απάντηση
es: No se recibió respuesta
eu: Ez da erantzunik jaso
fr: Aucune réponse reçue
gl: Non se recibiu resposta
hi: कोई प्रतिक्रिया प्राप्त नहीं हुई
it: Nessuna risposta ricevuta
ja: 応答を受信しませんでした
pt: Nenhuma resposta recebida
zh: 未收到响应

# invalidApiKeyError
source: Invalid API Key. Please check your OpenAI API Key in settings.
ar: مفتاح API غير صالح. يرجى التحقق من مفتاح OpenAI API في الإعدادات.
ca: Clau API no vàlida. Comproveu la vostra Clau API OpenAI a la configuració.
de: Ungültiger API-Schlüssel. Bitte überprüfen Sie Ihren OpenAI-API-Schlüssel in den Einstellungen.
el: Μη έγκυρο κλειδί API. Παρακαλώ ελέγξτε το κλειδί API OpenAI στις ρυθμίσεις.
es: Clave API inválida. Por favor, verifica tu clave API de OpenAI en ajustes.
eu: API gako baliogabea. Egiaztatu zure OpenAI API Gakoa ezarpenetan.
fr: Clé API invalide. Veuillez vérifier votre clé API OpenAI dans les paramètres.
gl: Clave API non válida. Comproba a túa Clave API OpenAI na configuración.
hi: अमान्य API Key। कृपया सेटिंग्स में अपनी OpenAI API Key जांचें।
it: Chiave API non valida. Controlla la tua chiave API OpenAI nelle impostazioni.
ja: 無効なAPIキーです。設定でOpenAI APIキーを確認してください。
pt: Chave API inválida. Verifique sua Chave API OpenAI nas configurações.
zh: 无效的API密钥。请在设置中检查您的OpenAI API密钥。

# rateLimitError
source: Quota exceeded or model not available in your tier. Check your plan.
ar: تم تجاوز الحصة أو أن النموذج غير متوفر في خطتك. تحقق من خطتك.
ca: Quota excedida o model no disponible en el teu pla.
de: Rate-Limit überschritten. Bitte versuchen Sie es später erneut.
el: Το όριο χρήσης ξεπεράστηκε ή το μοντέλο δεν είναι διαθέσιμο στο πρόγραμμά σας. Ελέγξτε το πρόγραμμά σας.
es: Cuota excedida o modelo no disponible en tu plan.
eu: Kuota gainditua edo eredua ez dago erabilgarri zure mailan. Egiaztatu zure plana.
fr: Quota dépassé ou modèle non disponible dans votre niveau. Vérifiez votre forfait.
gl: Cota excedida ou modelo non dispoñible no teu plan.
hi: कोटा पार हो गया है या मॉडल आपकी योजना में उपलब्ध नहीं है। अपनी योजना की जाँच करें।
it: Quota superata o modello non disponibile nel tuo piano. Controlla il tuo piano.
ja: クォータを超過したか、プランでモデルが利用できません。プランを確認してください。
pt: Cota excedida ou modelo não disponível no seu plano. Verifique seu plano.
zh: 配额已用完或该模型在您的套餐中不可用。请检查您的计划。

# modelNotFoundError
source: Model not found. Please check your API access.
ar: النموذج غير موجود. يرجى التحقق من إمكانية الوصول إلى API.
ca: Model no trobat. Comproveu el vostre accés a l'API.
de: Modell nicht gefunden. Bitte überprüfen Sie Ihren API-Zugang.
el: Το μοντέλο δεν βρέθηκε. Παρακαλώ ελέγξτε την πρόσβασή σας στο API.
es: Modelo no encontrado. Por favor, verifica tu acceso a la API.
eu: Modeloa ez da aurkitu. Egiaztatu zure API sarbidea.
fr: Modèle non trouvé. Veuillez vérifier votre accès API.
gl: Modelo non atopado. Comproba o teu acceso á API.
hi: मॉडल नहीं मिला। कृपया अपनी API पहुंच जांचें।
it: Modello non trovato. Controlla il tuo accesso API.
ja: モデルが見つかりません。APIアクセスを確認してください。
pt: Modelo não encontrado. Verifique seu acesso à API.
zh: 未找到模型。请检查您的API访问权限。

source: Unknown error
ar: خطأ غير معروف
ca: Error desconegut
de: Unbekannter Fehler
el: Άγνωστο σφάλμα
es: Error desconocido
eu: Errore ezezaguna
fr: Erreur inconnue
gl: Erro descoñecido
hi: अज्ञात त्रुटि
it: Errore sconosciuto
ja: 不明なエラー
pt: Erro desconhecido
zh: 未知错误
