Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# networkErrorOpenAI
source: Network error: Unable to connect to OpenAI. Please check your internet connection.
ar: خطأ في الشبكة: تعذر الاتصال بـ OpenAI. يرجى التحقق من اتصالك بالإنترنت.
ca: Error de xarxa: No s'ha pogut connectar amb OpenAI. Comproveu la vostra connexió a Internet.
de: Netzwerkfehler: Verbindung zu OpenAI konnte nicht hergestellt werden. Bitte überprüfen Sie Ihre Internetverbindung.
el: Σφάλμα δικτύου: Αδυναμία σύνδεσης με το OpenAI. Ελέγξτε τη σύνδεσή σας στο διαδίκτυο.
es: Error de red: No se puede conectar a OpenAI. Por favor, verifica tu conexión a internet.
eu: Sare errorea: Ezin da OpenAI-ra konektatu. Egiaztatu zure internet konexioa.
fr: Erreur réseau : Impossible de se connecter à OpenAI. Veuillez vérifier votre connexion internet.
gl: Erro de rede: Non se pode conectar a OpenAI. Comproba a túa conexión a internet.
hi: नेटवर्क त्रुटि: OpenAI से कनेक्ट नहीं हो सका। कृपया अपना इंटरनेट कनेक्शन जांचें।
it: Errore di rete: Impossibile connettersi a OpenAI. Controlla la tua connessione internet.
ja: ネットワークエラー：OpenAIに接続できません。インターネット接続を確認してください。
pt: Erro de rede: Não foi possível conectar ao OpenAI. Verifique sua conexão com a internet.
zh: 网络错误：无法连接到OpenAI。请检查您的网络连接。

# networkErrorGemini
source: Network error: Unable to connect to Google Gemini. Please check your internet connection.
ar: خطأ في الشبكة: تعذر الاتصال بـ Gemini. يرجى التحقق من اتصالك بالإنترنت.
ca: Error de xarxa: No s'ha pogut connectar amb Gemini. Comproveu la vostra connexió a Internet.
de: Netzwerkfehler: Verbindung zu Gemini konnte nicht hergestellt werden. Bitte überprüfen Sie Ihre Internetverbindung.
el: Σφάλμα δικτύου: Αδυναμία σύνδεσης με το Gemini. Ελέγξτε τη σύνδεσή σας στο διαδίκτυο.
es: Error de red: No se puede conectar a Google Gemini. Por favor, verifica tu conexión a internet.
eu: Sare errorea: Ezin da Gemini-ra konektatu. Egiaztatu zure internet konexioa.
fr: Erreur réseau : Impossible de se connecter à Gemini. Veuillez vérifier votre connexion internet.
gl: Erro de rede: Non se pode conectar a Gemini. Comproba a túa conexión a internet.
hi: नेटवर्क त्रुटि: Gemini से कनेक्ट नहीं हो सका। कृपया अपना इंटरनेट कनेक्शन जांचें।
it: Errore di rete: Impossibile connettersi a Gemini. Controlla la tua connessione internet.
ja: ネットワークエラー：Geminiに接続できません。インターネット接続を確認してください。
pt: Erro de rede: Não foi possível conectar ao Gemini. Verifique sua conexão com a internet.
zh: 网络错误：无法连接到Gemini。请检查您的网络连接。

source: OpenAI API Key not configured
ar: مفتاح OpenAI API غير مُكوَّن
ca: Clau API OpenAI no configurada
de: OpenAI-API-Schlüssel nicht konfiguriert
el: Το κλειδί API OpenAI δεν έχει ρυθμιστεί
es: Clave API de OpenAI no configurada
eu: OpenAI API Gakoa ez dago konfiguratuta
fr: Clé API OpenAI non configurée
gl: Clave API OpenAI non configurada
hi: OpenAI API Key कॉन्फ़िगर नहीं की गई
it: Chiave API OpenAI non configurata
ja: OpenAI APIキーが設定されていません
pt: Chave API OpenAI não configurada
zh: OpenAI API密钥未配置

source: Gemini API Key not configured
ar: مفتاح Gemini API غير مُكوَّن
ca: Clau API Gemini no configurada
de: Gemini-API-Schlüssel nicht konfiguriert
el: Το κλειδί API Gemini δεν έχει ρυθμιστεί
es: Clave API de Gemini no configurada
eu: Gemini API Gakoa ez dago konfiguratuta
fr: Clé API Gemini non configurée
gl: Clave API Gemini non configurada
hi: Gemini API Key कॉन्फ़िगर नहीं की गई
it: Chiave API Gemini non configurata
ja: Gemini APIキーが設定されていません
pt: Chave API Gemini não configurada
zh: Gemini API密钥未配置

# geminiApiKeyLabel
source: Gemini API Key
ar: مفتاح Gemini API
ca: Clau API Gemini
de: Gemini API-Schlüssel
el: Κλειδί API Gemini
es: Clave API de Gemini
eu: Gemini API Gakoa
fr: Clé API Gemini
gl: Clave API Gemini
it: Chiave API Gemini
ja: Gemini APIキー
pt: Chave API Gemini
zh: Gemini API密钥

# geminiApiKeyHint
source: Enter your Gemini API Key
ar: أدخل مفتاح Gemini API الخاص بك
ca: Introduïu la vostra Clau API Gemini
de: Geben Sie Ihren Gemini-API-Schlüssel ein
el: Εισάγετε το κλειδί API Gemini
es: Ingresa tu clave API de Gemini
eu: Sartu zure Gemini API Gakoa
fr: Entrez votre clé API Gemini
gl: Introduce a túa Clave API Gemini
hi: अपनी Gemini API Key दर्ज करें
it: Inserisci la tua chiave API Gemini
ja: Gemini APIキーを入力してください
pt: Digite sua Chave API Gemini
zh: 输入您的Gemini API密钥

# geminiApiKeyDescription
source: Required for Gemini AI functionality. Your key is stored securely.
ar: مطلوب لوظائف Gemini AI. يتم تخزين مفتاحك بأمان.
ca: Requerit per la funcionalitat IA Gemini. La vostra clau s'emmagatzema de forma segura.
de: Erforderlich für Gemini-KI-Funktionalität. Ihr Schlüssel wird sicher gespeichert.
el: Απαιτείται για τη λειτουργικότητα Gemini AI. Το κλειδί σας αποθηκεύεται με ασφάλεια.
es: Requerida para la funcionalidad de IA Gemini. Tu clave se guarda de forma segura.
eu: Gemini AI funtzionalitaterako beharrezkoa. Zure gakoa modu seguruan gordetzen da.
fr: Requis pour la fonctionnalité IA Gemini. Votre clé est stockée en sécurité.
gl: Requirido para a funcionalidade IA Gemini. A túa clave gárdase de forma segura.
hi: Gemini AI कार्यक्षमता के लिए आवश्यक। आपकी key सुरक्षित रूप से संग्रहीत की जाती है।
it: Richiesta per la funzionalità IA Gemini. La tua chiave è memorizzata in sicurezza.
ja: Gemini AI機能に必要です。キーは安全に保存されます。
pt: Necessário para funcionalidade IA Gemini. Sua chave é armazenada com segurança.
zh: Gemini AI功能所需。您的密钥会安全存储。

# getGeminiApiKeyTooltip
source: Get API Key from Google AI Studio
ar: احصل على مفتاح API من Google AI Studio
ca: Obtenir Clau API de Google AI Studio
de: API-Schlüssel von Google AI Studio erhalten
el: Λήψη κλειδιού API από Google AI Studio
es: Obtener clave API de Google AI Studio
eu: Google AI Studio-tik API Gakoa lortu
fr: Obtenir la clé API depuis Google AI Studio
gl: Obter Clave API de Google AI Studio
hi: Google AI Studio से API Key प्राप्त करें
it: Ottieni la chiave API da Google AI Studio
ja: Google AI StudioからAPIキーを取得
pt: Obter Chave API do Google AI Studio
zh: 从Google AI Studio获取API密钥

# aiRequiresAtLeastOneApiKeyError
source: AI Study Assistant requires at least one API Key (Gemini or OpenAI). Please enter an API key or disable the AI Assistant.
ar: يتطلب مساعد الدراسة الذكي مفتاح API واحدًا على الأقل (Gemini أو OpenAI). يرجى إدخال مفتاح API أو تعطيل المساعد الذكي.
ca: L'Assistent d'Estudi IA requereix almenys una clau API (Gemini o OpenAI). Si us plau, introduïu una clau API o desactiveu l'Assistent d'IA.
de: Der KI-Lernassistent benötigt mindestens einen API-Schlüssel (Gemini oder OpenAI). Bitte geben Sie einen API-Schlüssel ein oder deaktivieren Sie den KI-Assistenten.
el: Ο Βοηθός Μελέτης AI απαιτεί τουλάχιστον ένα κλειδί API (Gemini ή OpenAI). Παρακαλώ εισάγετε ένα κλειδί API ή απενεργοποιήστε τον Βοηθό AI.
es: El Asistente de estudio IA requiere al menos una clave API (Gemini u OpenAI). Por favor, ingresa una clave API o deshabilita el Asistente de IA.
eu: AI Ikasketa Laguntzaileak gutxienez API gako bat behar du (Gemini edo OpenAI). Mesedez, sartu API gako bat edo desgaitu AI Laguntzailea.
fr: L'Assistant d'Étude IA nécessite au moins une clé API (Gemini ou OpenAI). Veuillez saisir une clé API ou désactiver l'Assistant IA.
gl: O Asistente de Estudo IA require polo menos unha clave API (Gemini ou OpenAI). Por favor, introduce unha clave API ou desactiva o Asistente de IA.
hi: AI अध्ययन सहायक को कम से कम एक API कुंजी (Gemini या OpenAI) की आवश्यकता है। कृपया एक API कुंजी दर्ज करें या AI सहायक को अक्षम करें।
it: L'Assistente di Studio AI richiede almeno una chiave API (Gemini o OpenAI). Inserisci una chiave API o disabilita l'Assistente IA.
ja: AI学習アシスタントには、少なくとも1つのAPIキー（GeminiまたはOpenAI）が必要です。APIキーを入力するか、AIアシスタントを無効にしてください。
pt: O Assistente de Estudo IA requer pelo menos uma Chave API (Gemini ou OpenAI). Por favor, insira uma chave API ou desative o Assistente de IA.
zh: AI学习助手至少需要一个API密钥（Gemini或OpenAI）。请输入API密钥或禁用AI助手。

# minutesAbbreviation
source: min
ar: د
el: λεπ
hi: मिन
ja: 分
zh: 分钟

# aiButtonTooltip
source: AI Study Assistant
ar: مساعد الدراسة الذكي
ca: Assistent d'Estudi IA
de: KI-Lernassistent
el: Βοηθός Μελέτης AI
es: Asistente de estudio IA
eu: Ikasketa AI Laguntzailea
fr: Assistant d'Étude IA
gl: Asistente de Estudo IA
hi: AI अध्ययन सहायक
it: Assistente di Studio IA
ja: AI学習アシスタント
pt: Assistente de Estudo IA
zh: AI学习助手

# aiAssistantSettingsTitle
source: AI Study Assistant (Preview)
ar: مساعد الدراسة الذكي (معاينة)
ca: Assistent d'Estudi IA (Vista prèvia)
de: KI-Lernassistent (Vorschau)
el: Βοηθός Μελέτης AI (Προεπισκόπηση)
es: Asistente de estudio IA (Preview)
eu: Ikasketa AI Laguntzailea (Aurrebista)
fr: Assistant d'Étude IA (Aperçu)
gl: Asistente de Estudo IA (Vista previa)
hi: AI अध्ययन सहायक (पूर्वावलोकन)
it: Assistente di Studio IA (Anteprima)
ja: AI学習アシスタント（プレビュー）
pt: Assistente de Estudo IA (Prévia)
zh: AI学习助手（预览）

# aiAssistantSettingsDescription
source: Enable or disable the AI study assistant for questions
ar: تفعيل أو تعطيل مساعد الدراسة الذكي للأسئلة
ca: Activar o desactivar l'assistent d'estudi IA per les preguntes
de: KI-Lernassistenten für Fragen aktivieren oder deaktivieren
el: Ενεργοποίηση ή απενεργοποίηση του βοηθού μελέτης AI για ερωτήσεις
es: Habilitar o deshabilitar el asistente de IA para las preguntas
eu: Gaitu edo desaktibatu galderetarako ikasketa ai laguntzailea
fr: Activer ou désactiver l'assistant d'étude IA pour les questions
gl: Activar ou desactivar o asistente de estudo IA para as preguntas
hi: प्रश्नों के लिए AI अध्ययन सहायक को सक्षम या अक्षम करें
it: Abilita o disabilita l'assistente di studio IA per le domande
ja: 問題のAI学習アシスタントを有効または無効にする
pt: Habilitar ou desabilitar o assistente de estudo IA para perguntas
zh: 启用或禁用问题的AI学习助手

# aiDefaultModelTitle
source: Default AI Model
ar: نموذج الذكاء الاصطناعي الافتراضي
ca: Model IA per defecte
de: Standard-KI-Modell
el: Προεπιλεγμένο Μοντέλο AI
es: Modelo de IA por defecto
eu: AI Modelo Lehenetsia
fr: Modèle IA par défaut
gl: Modelo IA por defecto
hi: डिफ़ॉल्ट AI मॉडल
it: Modello IA predefinito
ja: デフォルトAIモデル
pt: Modelo IA padrão
zh: 默认AI模型

# aiDefaultModelDescription
source: Select the default AI service and model for question generation
ar: حدد خدمة ونموذج الذكاء الاصطناعي الافتراضي لتوليد الأسئلة
ca: Selecciona el servei i model IA per defecte per la generació de preguntes
de: Wählen Sie den Standard-KI-Service und das Modell für die Fragengenerierung
el: Επιλέξτε την προεπιλεγμένη υπηρεσία και μοντέλο AI για δημιουργία ερωτήσεων
es: Selecciona el servicio y modelo de IA por defecto para la generación de preguntas
eu: Hautatu AI zerbitzu eta modelo lehenetsia galderen sorrerarako
fr: Sélectionnez le service et modèle IA par défaut pour la génération de questions
gl: Selecciona o servizo e modelo IA por defecto para a xeración de preguntas
hi: प्रश्न निर्माण के लिए डिफ़ॉल्ट AI सेवा और मॉडल चुनें
it: Seleziona il servizio e modello IA predefinito per la generazione di domande
ja: 質問生成のデフォルトAIサービスとモデルを選択
pt: Selecione o serviço e modelo IA padrão para a geração de perguntas
zh: 选择用于生成问题的默认AI服务和模型

# openaiApiKeyLabel
source: OpenAI API Key
ar: مفتاح OpenAI API
ca: Clau API OpenAI
de: OpenAI-API-Schlüssel
el: Κλειδί API OpenAI
es: Clave API de OpenAI
eu: OpenAI API Gakoa
fr: Clé API OpenAI
gl: Clave API OpenAI
it: Chiave API OpenAI
ja: OpenAI APIキー
pt: Chave API OpenAI
zh: OpenAI API密钥

# openaiApiKeyHint
source: Enter your OpenAI API Key (sk-...)
ar: أدخل مفتاح OpenAI API الخاص بك (sk-...)
ca: Introduïu la vostra Clau API OpenAI (sk-...)
de: Geben Sie Ihren OpenAI-API-Schlüssel ein (sk-...)
el: Εισάγετε το κλειδί API OpenAI (sk-...)
es: Ingresa tu clave API de OpenAI (sk-...)
eu: Sartu zure OpenAI API Gakoa (sk-...)
fr: Entrez votre clé API OpenAI (sk-...)
gl: Introduce a túa Clave API OpenAI (sk-...)
hi: अपनी OpenAI API Key दर्ज करें (sk-...)
it: Inserisci la tua chiave API OpenAI (sk-...)
ja: OpenAI APIキーを入力してください（sk-...）
pt: Digite sua Chave API OpenAI (sk-...)
zh: 输入您的OpenAI API密钥（sk-...）

# openaiApiKeyDescription
source: Required for integration with OpenAI. Your OpenAI key is stored securely.
ar: مطلوب للتكامل مع OpenAI. يتم تخزين مفتاح OpenAI الخاص بك بأمان.
ca: Requerit per a la integració amb OpenAI. La vostra clau OpenAI s'emmagatzema de forma segura.
de: Erforderlich für die Integration mit OpenAI. Ihr OpenAI-Schlüssel wird sicher gespeichert.
el: Απαιτείται για ενσωμάτωση με OpenAI. Το κλειδί OpenAI αποθηκεύεται με ασφάλεια.
es: Requerido para la integración con OpenAI. Tu clave de OpenAI se almacena de forma segura.
eu: Beharrezkoa da OpenAI integratzeko. Zure OpenAI gakoa modu seguruan gordetzen da.
fr: Requis pour l'intégration avec OpenAI. Votre clé OpenAI est stockée en sécurité.
gl: Requirido para a integración con OpenAI. A túa clave de OpenAI gárdase de forma segura.
hi: OpenAI एकीकरण के लिए आवश्यक। आपकी OpenAI key सुरक्षित रूप से संग्रहीत की जाती है।
it: Richiesta per l'integrazione con OpenAI. La tua chiave OpenAI è memorizzata in sicurezza.
ja: OpenAI連携に必要です。OpenAIキーは安全に保存されます。
pt: Necessário para integração com OpenAI. Sua chave OpenAI é armazenada com segurança.
zh: 用于与OpenAI集成。您的OpenAI密钥会安全存储。

# aiAssistantRequiresApiKeyError
source: AI Study Assistant requires an OpenAI API Key. Please enter your API key or disable the AI Assistant.
ar: مساعد الدراسة الذكي يتطلب مفتاح OpenAI API. يرجى إدخال مفتاح API أو تعطيل المساعد الذكي.
ca: L'Assistent d'Estudi IA requereix una Clau API OpenAI. Introduïu la vostra clau API o desactiveu l'Assistent IA.
de: KI-Lernassistent benötigt einen OpenAI-API-Schlüssel. Bitte geben Sie Ihren API-Schlüssel ein oder deaktivieren Sie den KI-Assistenten.
el: Ο Βοηθός Μελέτης AI απαιτεί κλειδί API OpenAI. Παρακαλώ εισάγετε το κλειδί API σας ή απενεργοποιήστε τον Βοηθό AI.
es: El Asistente de estudio IA requiere una clave API de OpenAI. Por favor, ingresa tu clave API o desactiva el Asistente de IA.
eu: Ikasketa AI Laguntzaileak OpenAI API Gako bat behar du. Sartu zure API gakoa edo desaktibatu AI Laguntzailea.
fr: L'Assistant d'Étude IA nécessite une clé API OpenAI. Veuillez entrer votre clé API ou désactiver l'Assistant IA.
gl: O Asistente de Estudo IA require unha Clave API OpenAI. Introduce a túa clave API ou desactiva o Asistente IA.
hi: AI अध्ययन सहायक के लिए OpenAI API Key की आवश्यकता है। कृपया अपनी API key दर्ज करें या AI सहायक को अक्षम करें।
it: L'Assistente di Studio IA richiede una chiave API OpenAI. Inserisci la tua chiave API o disabilita l'Assistente IA.
ja: AI学習アシスタントにはOpenAI APIキーが必要です。APIキーを入力するか、AIアシスタントを無効にしてください。
pt: Assistente de Estudo IA requer uma Chave API OpenAI. Digite sua chave API ou desabilite o Assistente IA.
zh: AI学习助手需要OpenAI API密钥。请输入您的API密钥或禁用AI助手。

# getApiKeyTooltip
source: Get API Key from OpenAI
ar: احصل على مفتاح API من OpenAI
ca: Obtenir Clau API d'OpenAI
de: API-Schlüssel von OpenAI erhalten
el: Λήψη κλειδιού API από OpenAI
es: Obtener clave API de OpenAI
eu: OpenAI-tik API Gakoa lortu
fr: Obtenir la clé API depuis OpenAI
gl: Obter Clave API de OpenAI
hi: OpenAI से API Key प्राप्त करें
it: Ottieni la chiave API da OpenAI
ja: OpenAIからAPIキーを取得
pt: Obter Chave API do OpenAI
zh: 从OpenAI获取API密钥

# deleteAction
source: Delete
ar: حذف
ca: Eliminar
de: Löschen
el: Διαγραφή
es: Eliminar
eu: Ezabatu
fr: Supprimer
gl: Eliminar
hi: हटाएं
it: Elimina
ja: 削除
pt: Excluir
zh: 删除

# explanationLabel
source: Explanation (optional)
ar: الشرح (اختياري)
ca: Explicació (opcional)
de: Erklärung (optional)
el: Εξήγηση (προαιρετικό)
es: Explicación (opcional)
eu: Azalpena (aukerakoa)
fr: Explication (optionnelle)
gl: Explicación (opcional)
hi: स्पष्टीकरण (वैकल्पिक)
it: Spiegazione (opzionale)
ja: 解説（任意）
pt: Explicação (opcional)
zh: 解释（可选）

# explanationHint
source: Enter an explanation for the correct answer(s)
ar: أدخل شرحاً للإجابة/الإجابات الصحيحة
ca: Introduïu una explicació per la/les resposta/es correcta/es
de: Geben Sie eine Erklärung für die richtige(n) Antwort(en) ein
el: Εισάγετε μια εξήγηση για τη/τις σωστή/ές απάντηση/εις
es: Ingresa una explicación para la(s) respuesta(s) correcta(s)
eu: Sartu erantzun zuzen(ar)entzako azalpena
fr: Entrez une explication pour la ou les réponses correctes
gl: Introduce unha explicación para a/as resposta/as correcta/as
hi: सही उत्तर(रों) के लिए स्पष्टीकरण दर्ज करें
it: Inserisci una spiegazione per la/e risposta/e corretta/e
ja: 正解の解説を入力してください
pt: Digite uma explicação para a(s) resposta(s) correta(s)
zh: 输入正确答案的解释

# explanationTitle
source: Explanation
ar: الشرح
ca: Explicació
de: Erklärung
el: Εξήγηση
es: Explicación
eu: Azalpena
fr: Explication
gl: Explicación
hi: स्पष्टीकरण
it: Spiegazione
ja: 解説
pt: Explicação
zh: 解释

# imageLabel
source: Image
ar: الصورة
ca: Imatge
de: Bild
el: Εικόνα
es: Imagen
eu: Irudia
gl: Imaxe
hi: चित्र
it: Immagine
ja: 画像
pt: Imagem
zh: 图片

source: Change image
ar: تغيير الصورة
ca: Canviar imatge
de: Bild ändern
el: Αλλαγή εικόνας
es: Cambiar imagen
eu: Irudia aldatu
fr: Changer l'image
gl: Cambiar imaxe
hi: चित्र बदलें
it: Cambia immagine
ja: 画像を変更
pt: Alterar imagem
zh: 更换图片

source: Remove image
ar: إزالة الصورة
ca: Eliminar imatge
de: Bild entfernen
el: Αφαίρεση εικόνας
es: Quitar imagen
eu: Irudia kendu
fr: Supprimer l'image
gl: Eliminar imaxe
hi: चित्र हटाएं
it: Rimuovi immagine
ja: 画像を削除
pt: Remover imagem
zh: 移除图片

# addImageTap
source: Tap to add image
ar: انقر لإضافة صورة
ca: Toqueu per afegir imatge
de: Tippen Sie, um ein Bild hinzuzufügen
el: Πατήστε για προσθήκη εικόνας
es: Toca para agregar imagen
eu: Ukitu irudia gehitzeko
fr: Appuyez pour ajouter une image
gl: Toca para engadir imaxe
hi: चित्र जोड़ने के लिए टैप करें
it: Tocca per aggiungere immagine
ja: タップして画像を追加
pt: Toque para adicionar imagem
zh: 点击添加图片

# imageFormats
source: Formats: JPG, PNG, GIF
ar: التنسيقات: JPG، PNG، GIF
de: Formate: JPG, PNG, GIF
el: Μορφές: JPG, PNG, GIF
es: Formatos: JPG, PNG, GIF
eu: Formatuak: JPG, PNG, GIF
gl: Formatos: JPG, PNG, GIF
hi: प्रारूप: JPG, PNG, GIF
it: Formati: JPG, PNG, GIF
ja: 形式：JPG、PNG、GIF
pt: Formatos: JPG, PNG, GIF
zh: 格式：JPG、PNG、GIF

# imageLoadError
source: Error loading image
ar: خطأ في تحميل الصورة
ca: Error en carregar la imatge
de: Fehler beim Laden des Bildes
el: Σφάλμα φόρτωσης εικόνας
es: Error al cargar la imagen
eu: Errorea irudia kargatzean
fr: Erreur de chargement de l'image
gl: Erro cargando a imaxe
hi: चित्र लोड करने में त्रुटि
it: Errore nel caricamento dell'immagine
ja: 画像読み込みエラー
pt: Erro ao carregar imagem
zh: 图片加载错误

# imagePickError
source: Error loading image: {error}
ar: خطأ في تحميل الصورة: {error}
ca: Error en carregar la imatge: {error}
de: Fehler beim Laden des Bildes: {error}
el: Σφάλμα φόρτωσης εικόνας: {error}
es: Error al cargar la imagen: {error}
eu: Errorea irudia kargatzean: {error}
fr: Erreur de chargement de l'image : {error}
gl: Erro cargando a imaxe: {error}
hi: चित्र लोड करने में त्रुटि: {error}
it: Errore nel caricamento dell'immagine: {error}
ja: 画像読み込みエラー：{error}
pt: Erro ao carregar imagem: {error}
zh: 图片加载错误：{error}

source: Tap to zoom
ar: انقر للتكبير
ca: Toqueu per ampliar
de: Tippen zum Zoomen
el: Πατήστε για εστίαση
es: Toca para ampliar
eu: Ukitu handitzeko
fr: Appuyez pour zoomer
gl: Toca para ampliar
hi: ज़ूम करने के लिए टैप करें
it: Tocca per ingrandire
ja: タップして拡大
pt: Toque para ampliar
zh: 点击放大

# trueLabel
source: True
ar: صحيح
ca: Cert
de: Wahr
el: Σωστό
es: Verdadero
eu: Egia
fr: Vrai
gl: Certo
hi: सही
it: Vero
ja: 真
pt: Verdadeiro
zh: 正确

# falseLabel
source: False
ar: خطأ
ca: Fals
de: Falsch
el: Λάθος
es: Falso
eu: Gezurra
fr: Faux
gl: Falso
hi: गलत
it: Falso
ja: 偽
pt: Falso
zh: 错误

source: Add Question
ar: إضافة سؤال
ca: Afegir pregunta
de: Frage hinzufügen
el: Προσθήκη Ερώτησης
es: Agregar pregunta
eu: Galdera Gehitu
fr: Ajouter une question
gl: Engadir pregunta
hi: प्रश्न जोड़ें
it: Aggiungi domanda
ja: 問題を追加
pt: Adicionar pergunta
zh: 添加问题

source: Edit Question
ar: تحرير السؤال
ca: Editar pregunta
de: Frage bearbeiten
el: Επεξεργασία Ερώτησης
es: Editar pregunta
eu: Galdera Editatu
fr: Modifier la question
gl: Editar pregunta
hi: प्रश्न संपादित करें
it: Modifica domanda
ja: 問題を編集
pt: Editar pergunta
zh: 编辑问题

source: Question Text
ar: نص السؤال
ca: Text de la pregunta
de: Fragentext
el: Κείμενο Ερώτησης
es: Texto de la pregunta
eu: Galderaren Testua
fr: Texte de la question
gl: Texto da pregunta
hi: प्रश्न पाठ
it: Testo domanda
ja: 問題文
pt: Texto da pergunta
zh: 问题文本

source: Question Type
ar: نوع السؤال
ca: Tipus de pregunta
de: Fragentyp
el: Τύπος Ερώτησης
es: Tipo de pregunta
eu: Galdera Mota
fr: Type de question
gl: Tipo de pregunta
hi: प्रश्न प्रकार
it: Tipo domanda
ja: 問題の種類
pt: Tipo de pergunta
zh: 问题类型

source: Add Option
ar: إضافة خيار
ca: Afegir opció
de: Option hinzufügen
el: Προσθήκη Επιλογής
es: Agregar opción
eu: Aukera Gehitu
fr: Ajouter une option
gl: Engadir opción
hi: विकल्प जोड़ें
it: Aggiungi opzione
ja: 選択肢を追加
pt: Adicionar opção
zh: 添加选项

# optionsLabel
source: Options
ar: الخيارات
ca: Opcions
de: Optionen
el: Επιλογές
es: Opciones
eu: Aukerak
gl: Opcións
hi: विकल्प
it: Opzioni
ja: 選択肢
pt: Opções
zh: 选项

# optionLabel
source: Option
ar: الخيار
ca: Opció
el: Επιλογή
es: Opción
eu: Aukera
gl: Opción
hi: विकल्प
it: Opzione
ja: 選択肢
pt: Opção
zh: 选项

# questionTextRequired
source: Question text is required
ar: نص السؤال مطلوب
ca: El text de la pregunta és obligatori
de: Fragentext ist erforderlich
el: Το κείμενο ερώτησης είναι υποχρεωτικό
es: El texto de la pregunta es obligatorio
eu: Galdera testua beharrezkoa da
fr: Le texte de la question est requis
gl: O texto da pregunta é obrigatorio
hi: प्रश्न पाठ आवश्यक है
it: Il testo della domanda è obbligatorio
ja: 問題文は必須です
pt: Texto da pergunta é obrigatório
zh: 问题文本是必需的

# atLeastOneOptionRequired
source: At least one option must have text
ar: يجب أن يحتوي خيار واحد على الأقل على نص
ca: Almenys una opció ha de tenir text
de: Mindestens eine Option muss Text haben
el: Τουλάχιστον μία επιλογή πρέπει να έχει κείμενο
es: Al menos una opción debe tener texto
eu: Gutxienez aukera batek testua izan behar du
fr: Au moins une option doit avoir du texte
gl: Polo menos unha opción debe ter texto
hi: कम से कम एक विकल्प में पाठ होना चाहिए
it: Almeno un'opzione deve avere del testo
ja: 少なくとも1つの選択肢にテキストが必要です
pt: Pelo menos uma opção deve ter texto
zh: 至少一个选项必须有文本

# atLeastOneCorrectAnswerRequired
source: At least one correct answer must be selected
ar: يجب اختيار إجابة صحيحة واحدة على الأقل
ca: Almenys una resposta correcta ha de ser seleccionada
de: Mindestens eine richtige Antwort muss ausgewählt werden
el: Πρέπει να επιλεγεί τουλάχιστον μία σωστή απάντηση
es: Debe seleccionar al menos una respuesta correcta
eu: Gutxienez erantzun zuzen bat hautatu behar da
fr: Au moins une réponse correcte doit être sélectionnée
gl: Polo menos unha resposta correcta debe ser seleccionada
hi: कम से कम एक सही उत्तर चुना जाना चाहिए
it: Almeno una risposta corretta deve essere selezionata
ja: 少なくとも1つの正解を選択する必要があります
pt: Pelo menos uma resposta correta deve ser selecionada
zh: 至少必须选择一个正确答案

# onlyOneCorrectAnswerAllowed
source: Only one correct answer is allowed for this question type
ar: إجابة صحيحة واحدة فقط مسموحة لهذا النوع من الأسئلة
ca: Només es permet una resposta correcta per aquest tipus de pregunta
de: Nur eine richtige Antwort ist für diesen Fragentyp erlaubt
el: Επιτρέπεται μόνο μία σωστή απάντηση για αυτόν τον τύπο ερώτησης
es: Solo se permite una respuesta correcta para este tipo de pregunta
eu: Galdera mota honetarako erantzun zuzen bakarra onartzen da
fr: Une seule réponse correcte est autorisée pour ce type de question
gl: Só se permite unha resposta correcta para este tipo de pregunta
hi: इस प्रश्न प्रकार के लिए केवल एक सही उत्तर की अनुमति है
it: È consentita solo una risposta corretta per questo tipo di domanda
ja: この問題の種類では正解は1つのみ許可されています
pt: Apenas uma resposta correta é permitida para este tipo de pergunta
zh: 此问题类型只允许一个正确答案
