Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# abortQuizTitle
source: Abort Quiz?
ar: إلغاء Quiz؟
ca: Avortar Quiz?
el: Ακύρωση Quiz;
es: ¿Abortar Quiz?
eu: Quiz-a abortatu?
hi: क्विज़ रद्द करें?
it: Interrompere il Quiz?
ja: クイズを中止しますか？
zh: 中止Quiz？

# abortQuizMessage
source: Opening a new file will stop the current quiz.
ar: سيؤدي فتح ملف جديد إلى إيقاف الاختبار الحالي.
ca: Obrir un fitxer nou aturarà el qüestionari actual.
el: Το άνοιγμα ενός νέου αρχείου θα διακόψει το τρέχον κουίζ.
es: Abrir un nuevo archivo detendrá el cuestionario actual.
eu: Fitxategi berri bat irekitzeak uneko galdetegia geldituko du.
hi: नई फ़ाइल खोलने से वर्तमान क्विज़ रुक जाएगा।
it: L'apertura di un nuovo file interromperà il quiz corrente.
ja: 新しいファイルを開くと、現在のクイズが停止します。
zh: 打开新文件将停止当前测验。

# stopAndOpenButton
source: Stop & Open
ar: إيقاف وفتح
ca: Aturar i Obri
el: Διακοπή & Άνοιγμα
es: Detener y Abrir
eu: Gelditu eta Ireki
hi: रोकें और खोलें
it: Ferma e Apri
ja: 停止して開く
zh: 停止并打开

# titleAppBar
source: Quiz - Exam Simulator
ar: اختبار - محاكي الامتحان
ca: Quiz - Simulador d'Exàmens
de: Quiz - Prüfungssimulator
el: Κουίζ - Προσομοιωτής Εξετάσεων
es: Quiz - Simulador de exámenes
eu: Quiz - Azterketa Simuladorea
fr: Quiz - Simulateur d'Examens
gl: Quiz - Simulador de Exames
hi: क्विज़ - परीक्षा सिमुलेटर
it: Quiz - Simulatore d'Esame
ja: クイズ - 試験シミュレーター
pt: Quiz - Simulador de Exames
zh: 测验 - 考试模拟器

source: Create
ar: إنشاء
ca: Crear
de: Erstellen
el: Δημιουργία
es: Crear
eu: Sortu
fr: Créer
gl: Crear
hi: बनाएं
it: Crea
ja: 作成
pt: Criar
zh: 创建

source: Preview
ar: معاينة
ca: Previsualització
de: Vorschau
el: Προεπισκόπηση
es: Vista previa
eu: Aurrebista
fr: Aperçu
gl: Previsualizacion
hi: पूर्वावलोकन
it: Anteprima
ja: プレビュー
pt: Visualização
zh: 预览

# previewLabel
source: Preview:
ar: معاينة:
ca: Previsualització:
de: Vorschau:
el: Προεπισκόπηση:
es: Vista previa:
eu: Aurrebista:
fr: Aperçu :
gl: Vista previa:
hi: पूर्वावलोकन:
it: Anteprima:
ja: プレビュー:
pt: Pré-visualização:
zh: 预览：

# emptyPlaceholder
source: (empty)
ar: (فارغ)
ca: (buit)
de: (leer)
el: (κενό)
es: (vacío)
eu: (hutsik)
fr: (vide)
gl: (baldeiro)
hi: (खाली)
it: (vuoto)
ja: (空)
pt: (vazio)
zh: (空)

# latexSyntaxTitle
source: LaTeX Syntax:
ar: بناء جملة LaTeX:
ca: Sintaxi LaTeX:
el: Σύνταξη LaTeX:
es: Sintaxis LaTeX:
eu: LaTeX sintaxia:
fr: Syntaxe LaTeX :
gl: Sintaxe LaTeX:
hi: LaTeX सिंटैक्स:
it: Sintassi LaTeX:
ja: LaTeX 構文:
pt: Sintaxe LaTeX:
zh: LaTeX 语法：

# latexSyntaxHelp
source: Inline math: Use $...$ for LaTeX expressions Example: $x^2 + y^2 = z^2$
ar: الرياضيات المضمنة: استخدم $...$ لتعبيرات LaTeX مثال: $x^2 + y^2 = z^2$
ca: Matemàtiques en línia: Utilitzeu $...$ per a expressions LaTeX Exemple: $x^2 + y^2 = z^2$
de: Inline-Mathematik: Verwenden Sie $...$ für LaTeX-Ausdrücke Beispiel: $x^2 + y^2 = z^2$
el: Ενσωματωμένα μαθηματικά: Χρησιμοποιήστε $...$ για εκφράσεις LaTeX Παράδειγμα: $x^2 + y^2 = z^2$
es: Matemáticas en línea: Usa $...$ para expresiones LaTeX Ejemplo: $x^2 + y^2 = z^2$
eu: Lineako matematika: Erabili $...$ LaTeX adierazpenetarako Adibidea: $x^2 + y^2 = z^2$
fr: Maths en ligne : Utilisez $...$ pour les expressions LaTeX Exemple : $x^2 + y^2 = z^2$
gl: Matemáticas en liña: Use $...$ para expresións LaTeX Exemplo: $x^2 + y^2 = z^2$
hi: इनलाइन गणित: LaTeX अभिव्यक्तियों के लिए $...$ का उपयोग करें उदाहरण: $x^2 + y^2 = z^2$
it: Matematica in linea: Usa $...$ per le espressioni LaTeX Esempio: $x^2 + y^2 = z^2$
ja: インライン数式: LaTeX 式には $...$ を使用します 例: $x^2 + y^2 = z^2$
pt: Matemática inline: Use $...$ para expressões LaTeX Exemplo: $x^2 + y^2 = z^2$
zh: 行内数学公式：使用 $...$ 包裹 LaTeX 表达式 示例：$x^2 + y^2 = z^2$

# previewLatexTooltip
source: Preview LaTeX rendering
ar: معاينة عرض LaTeX
ca: Previsualització del renderitzat LaTeX
de: LaTeX-Rendering-Vorschau
el: Προεπισκόπηση απόδοσης LaTeX
es: Vista previa del renderizado LaTeX
eu: Ikusi LaTeX errendatzea
fr: Aperçu du rendu LaTeX
gl: Vista previa do renderizado LaTeX
hi: LaTeX रेंडरिंग का पूर्वावलोकन करें
it: Anteprima rendering LaTeX
ja: LaTeX レンダリングのプレビュー
pt: Pré-visualizar renderização LaTeX
zh: 预览 LaTeX 渲染

# okButton
source: OK
ar: موافق
ca: D'acord
el: ΟΚ
es: Aceptar
eu: Ados
gl: Aceptar
hi: ठीक है
zh: 确定

# aiEnterContentTitle
source: Enter Content
ar: إدخال المحتوى
ca: Introduir contingut
de: Inhalt eingeben
el: Εισαγωγή περιεχομένου
es: Introducir contenido
eu: Sartu edukia
fr: Saisir le contenu
gl: Introducir contido
hi: सामग्री दर्ज करें
it: Inserisci contenuto
ja: コンテンツを入力
pt: Inserir Conteúdo
zh: 输入内容

# aiEnterContentDescription
source: Enter the topic or paste content to generate questions from
ar: أدخل الموضوع أو الصق المحتوى لتوليد الأسئلة منه
ca: Introduïu el tema o enganxeu el contingut per generar preguntes
de: Geben Sie das Thema ein oder fügen Sie Inhalte ein, um Fragen zu generieren
el: Εισάγετε το θέμα ή επικολλήστε περιεχόμενο για τη δημιουργία ερωτήσεων
es: Introduce el tema o pega el contenido para generar preguntas
eu: Sartu gaia edo itsatsi edukia galderak sortzeko
fr: Entrez le sujet ou collez le contenu pour générer des questions
gl: Introduza o tema ou pegue o contido para xerar preguntas
hi: प्रश्न उत्पन्न करने के लिए विषय दर्ज करें या सामग्री पेस्ट करें
it: Inserisci l'argomento o incolla il contenuto da cui generare le domande
ja: 質問を作成するトピックを入力するか、コンテンツを貼り付けてください
pt: Insira o tópico ou cole o conteúdo para gerar perguntas
zh: 输入主题或粘贴内容以生成问题

# aiContentFieldHint
source: Enter a topic like "World War II history" or paste text content here...
ar: أدخل موضوعاً مثل "تاريخ الحرب العالمية الثانية" أو الصق محتوى نصي هنا...
ca: Introduïu un tema com "Història de la Segona Guerra Mundial" o enganxeu contingut de text aquí...
de: Geben Sie ein Thema wie "Geschichte des Zweiten Weltkriegs" ein oder fügen Sie hier Textinhalt ein...
el: Εισάγετε ένα θέμα όπως "Ιστορία του Β' Παγκόσμιου Πολέμου" ή επικολλήστε κείμενο εδώ...
es: Introduce un tema como "Historia de la Segunda Guerra Mundial" o pega el contenido de texto aquí...
eu: Sartu gai bat, adibidez "Bigarren Mundu Gerrako historia" edo itsatsi testua hemen...
fr: Entrez un sujet comme « Histoire de la Seconde Guerre mondiale » ou collez du texte ici...
gl: Introduza un tema como "Historia da Segunda Guerra Mundial" ou pegue texto aquí...
hi: "द्वितीय विश्व युद्ध का इतिहास" जैसा कोई विषय दर्ज करें या यहां पाठ पेस्ट करें...
it: Inserisci un argomento come "Storia della Seconda Guerra Mondiale" o incolla il testo qui...
ja: 「第二次世界大戦の歴史」のようなトピックを入力するか、ここにテキストを貼り付けてください...
pt: Insira um tópico como "História da Segunda Guerra Mundial" ou cole o texto aqui...
zh: 输入主题如“二战史”或在此粘贴文本...

# aiAttachFileHint
source: Attach a file (PDF, TXT, MP3, MP4,...)
ar: إرفاق ملف (PDF، TXT، MP3، MP4،...)
ca: Adjunteu un fitxer (PDF, TXT, MP3, MP4,...)
de: Datei anhängen (PDF, TXT, MP3, MP4,...)
el: Επισύναψη αρχείου (PDF, TXT, MP3, MP4,...)
es: Adjunta un archivo (PDF, TXT, MP3, MP4,...)
eu: Erantsi fitxategia (PDF, TXT, MP3, MP4,...)
fr: Joindre un fichier (PDF, TXT, MP3, MP4,...)
gl: Anexar ficheiro (PDF, TXT, MP3, MP4,...)
hi: फ़ाइल संलग्न करें (PDF, TXT, MP3, MP4,...)
it: Allega file (PDF, TXT, MP3, MP4,...)
ja: ファイルを添付 (PDF, TXT, MP3, MP4,...)
pt: Anexar arquivo (PDF, TXT, MP3, MP4,...)
zh: 附加文件 (PDF, TXT, MP3, MP4,...)

# dropAttachmentHere
source: Drop file here
ar: أفلت الملف هنا
ca: Deixeu anar el fitxer aquí
de: Datei hier ablegen
el: Αφήστε το αρχείο εδώ
es: Suelta el archivo aquí
eu: Askatu fitxategia hemen
fr: Déposez le fichier ici
gl: Solte o ficheiro aquí
hi: फ़ाइल यहाँ छोड़ें
it: Rilascia il file qui
ja: ファイルをここにドロップ
pt: Solte o arquivo aqui
zh: 在此处放置文件

source: Drop image here
ar: أفلت الصورة هنا
ca: Deixeu anar la imatge aquí
de: Bild hier ablegen
el: Αφήστε την εικόνα εδώ
es: Suelta la imagen aquí
eu: Askatu irudia hemen
fr: Déposez l'image ici
gl: Solte a imaxe aquí
hi: छवि यहाँ छोड़ें
it: Rilascia l'immagine qui
ja: 画像をここにドロップ
pt: Solte a imagem aqui
zh: 在此处放置图片

# aiNumberQuestionsLabel
source: Number of Questions
ar: عدد الأسئلة
ca: Nombre de preguntes
de: Anzahl der Fragen
el: Αριθμός ερωτήσεων
es: Número de preguntas
eu: Galdera kopurua
fr: Nombre de questions
gl: Número de preguntas
hi: प्रश्नों की संख्या
it: Numero di domande
ja: 質問数
pt: Número de perguntas
zh: 问题数量

# backButton
source: Back
ar: رجوع
ca: Enrere
de: Zurück
el: Πίσω
es: Volver
eu: Itzuli
fr: Retour
gl: Atrás
hi: वापस
it: Indietro
ja: 戻る
pt: Voltar
zh: 返回

# generateButton
source: Generate
ar: توليد
ca: Generar
de: Generieren
el: Δημιουργία
es: Generar
eu: Sortu
fr: Générer
gl: Xerar
hi: उत्पन्न करें
it: Genera
ja: 生成
pt: Gerar
zh: 生成

# aiTopicModeCount
source: Topic Mode ({count} words)
ar: وضع الموضوع ({count} كلمات)
ca: Mode Tema ({count} paraules)
de: Themenmodus ({count} Wörter)
el: Λειτουργία θέματος ({count} λέξεις)
es: Modo Tema ({count} palabras)
eu: Gai modua ({count} hitz)
fr: Mode Sujet ({count} mots)
gl: Modo Tema ({count} palabras)
hi: विषय मोड ({count} शब्द)
it: Modalità Argomento ({count} parole)
ja: トピックモード ({count} 語)
pt: Modo Tópico ({count} palavras)
zh: 主题模式 ({count} 字)

# aiTextModeCount
source: Text Mode ({count} words)
ar: وضع النص ({count} كلمات)
ca: Mode Text ({count} paraules)
de: Textmodus ({count} Wörter)
el: Λειτουργία κειμένου ({count} λέξεις)
es: Modo Texto ({count} palabras)
eu: Testu modua ({count} hitz)
fr: Mode Texte ({count} mots)
gl: Modo Texto ({count} palabras)
hi: पाठ मोड ({count} शब्द)
it: Modalità Testo ({count} parole)
ja: テキストモード ({count} 語)
pt: Modo Texto ({count} palavras)
zh: 文本模式 ({count} 字)

# aiGenerationCategoryLabel
source: Content Mode
ar: وضع المحتوى
ca: Modo de Contingut
de: Inhaltsmodus
el: Λειτουργία Περιεχομένου
es: Modo de Contenido
eu: Eduki Modua
fr: Mode de Contenu
gl: Modo de Contido
hi: सामग्री मोड
it: Modalità Contenuto
ja: コンテンツモード
pt: Modo de Conteúdo
zh: 内容模式

# aiGenerationCategoryTheory
source: Theory
ar: نظرية
ca: Teoria
de: Theorie
el: Θεωρία
es: Teoría
eu: Teoria
fr: Théorie
gl: Teoría
hi: सिद्धांत
it: Teoria
ja: 理論
pt: Teoria
zh: 理论

# aiGenerationCategoryExercises
source: Exercises
ar: تمارين
ca: Exercicis
de: Übungen
el: Ασκήσεις
es: Ejercicios
eu: Ariketak
fr: Exercices
gl: Exercicios
hi: अभ्यास
it: Esercizi
ja: 演習
pt: Exercícios
zh: 练习

# aiGenerationCategoryBoth
source: Mixed
ar: مختلط
ca: Mixt
de: Gemischt
el: Μικτό
es: Mixto
eu: Nahasia
fr: Mixte
gl: Mixto
hi: मिश्रित
it: Misto
ja: 混合
pt: Misto
zh: 混合

source: Load
ar: تحميل
ca: Carregar
de: Laden
el: Φόρτωση
es: Cargar
eu: Kargatu
fr: Charger
gl: Cargar
hi: लोड करें
it: Carica
ja: 読み込み
pt: Carregar
zh: 加载

# fileLoaded
source: File loaded: {filePath}
ar: تم تحميل الملف: {filePath}
ca: Fitxer carregat: {filePath}
de: Datei geladen: {filePath}
el: Το αρχείο φορτώθηκε: {filePath}
es: Archivo cargado: {filePath}
eu: Fitxategia kargatuta: {filePath}
fr: Fichier chargé : {filePath}
gl: Ficheiro cargado: {filePath}
hi: फ़ाइल लोड हुई: {filePath}
it: File caricato: {filePath}
ja: ファイルを読み込みました：{filePath}
pt: Arquivo carregado: {filePath}
zh: 文件已加载：{filePath}

# fileSaved
source: File saved: {filePath}
ar: تم حفظ الملف: {filePath}
ca: Fitxer desat: {filePath}
de: Datei gespeichert: {filePath}
el: Το αρχείο αποθηκεύτηκε: {filePath}
es: Archivo guardado: {filePath}
eu: Fitxategia gordeta: {filePath}
fr: Fichier sauvegardé : {filePath}
gl: Ficheiro gardado: {filePath}
hi: फ़ाइल सेव हुई: {filePath}
it: File salvato: {filePath}
ja: ファイルを保存しました：{filePath}
pt: Arquivo salvo: {filePath}
zh: 文件已保存：{filePath}

# dropFileHere
source: Click logo or drag a .quiz file to the screen
ar: انقر فوق الشعار أو اسحب ملف .quiz إلى الشاشة
ca: Feu clic al logotip o arrossegueu un fitxer .quiz a la pantalla
de: Hier klicken oder eine .quiz-Datei auf den Bildschirm ziehen
el: Κάντε κλικ στο λογότυπο ή σύρετε ένα αρχείο .quiz στην οθόνη
es: Haz clic en el logo o arrastra un archivo .quiz a la pantalla
eu: Egin klik logoan edo arrastatu .quiz fitxategi bat pantailara
fr: Cliquez ici ou faites glisser un fichier .quiz vers l'écran
gl: Preme aquí ou arrastra un ficheiro .quiz á pantalla
hi: लोगो पर क्लिक करें या किसी .quiz फ़ाइल को स्क्रीन पर खींचें
it: Fai clic sul logo o trascina un file .quiz sulla schermata
ja: ここをクリックするか、.quizファイルを画面にドラッグしてください
pt: Clique no logotipo ou arraste um arquivo .quiz para a tela
zh: 点击徽标或将 .quiz 文件拖到屏幕上

source: Error opening file
ar: خطأ في فتح الملف
ca: Error en obrir el fitxer
el: Σφάλμα κατά το άνοιγμα του αρχείου
es: Error al abrir el archivo
eu: Errorea fitxategia irekitzean
hi: फ़ाइल खोलने में त्रुटि
it: Errore durante l'apertura del file
ja: ファイルを開く際にエラーが発生しました
zh: 打开文件时出错

# replaceFileTitle
source: Load new Quiz
ar: تحميل اختبار Quiz جديد
ca: Carregar nou Quiz
el: Φόρτωση νέου Quiz
es: Cargar nuevo Quiz
eu: Quiz berria kargatu
hi: नया क्विज़ (Quiz) लोड करें
it: Carica nuovo Quiz
ja: 新しいQuizを読み込む
zh: 加载新 Quiz

# replaceFileMessage
source: A Quiz is already loaded. Do you want to replace it with the new file?
ar: هناك اختبار Quiz محمل بالفعل. هل تريد استبداله بالملف الجديد؟
ca: Ja hi ha un Quiz carregat. Vols substituir-lo pel nou fitxer?
el: Ένα Quiz είναι ήδη φορτωμένο. Θέλετε να το αντικαταστήσετε με το νέο αρχείο;
es: Ya hay un Quiz cargado. ¿Deseas reemplazarlo con el nuevo archivo?
eu: Dagoeneko Quiz bat kargatuta dago. Fitxategi berriarekin ordezkatu nahi duzu?
hi: एक क्विज़ (Quiz) पहले से लोड है। क्या आप इसे नई फ़ाइल से बदलना चाहते हैं?
it: Un Quiz è già caricato. Vuoi sostituirlo con il nuovo file?
ja: Quizはすでに読み込まれています。新しいファイルに置き換えますか？
zh: 已加载一个 Quiz。您要用新文件替换它吗？

# replaceButton
source: Load
ar: تحميل
ca: Carregar
el: Φόρτωση
es: Cargar
eu: Kargatu
hi: लोड करें
it: Carica
ja: 読み込む
zh: 加载

# clickOrDragFile
source: Click to load or drag a .quiz file to the screen
ar: انقر للتحميل أو اسحب ملف .quiz إلى الشاشة
ca: Feu clic per carregar o arrossegueu un fitxer .quiz a la pantalla
de: Klicken zum Laden oder .quiz-Datei auf den Bildschirm ziehen
el: Κάντε κλικ για φόρτωση ή σύρετε ένα αρχείο .quiz στην οθόνη
es: Haz clic para cargar o arrastra un archivo .quiz a la pantalla
eu: Egin klik kargatzeko edo arrastatu .quiz fitxategi bat pantailara
fr: Cliquez pour charger ou faites glisser un fichier .quiz vers l'écran
gl: Preme para cargar ou arrastra un ficheiro .quiz á pantalla
hi: Load karne ke liye click karen ya screen par .quiz file drag karen
it: Clicca per caricare o trascina un file .quiz sullo schermo
ja: クリックしてロードするか、.quizファイルを画面にドラッグしてください
pt: Clique para carregar ou arraste um arquiro .quiz para a tela
zh: 点击加载或将 .quiz 文件拖动到屏幕上

# errorInvalidFile
source: Error: Invalid file. Must be a .quiz file.
ar: خطأ: ملف غير صالح. يجب أن يكون ملف .quiz.
ca: Error: Fitxer no vàlid. Ha de ser un fitxer .quiz.
de: Fehler: Ungültige Datei. Muss eine .quiz-Datei sein.
el: Σφάλμα: Μη έγκυρο αρχείο. Πρέπει να είναι αρχείο .quiz.
es: Error: archivo no válido. Debe ser un archivo .quiz.
eu: Errorea: Fitxategi baliogabea. .quiz fitxategia izan behar da.
fr: Erreur : Fichier invalide. Doit être un fichier .quiz.
gl: Erro: Ficheiro non válido. Debe ser un ficheiro .quiz.
hi: त्रुटि: अमान्य फ़ाइल। .quiz फ़ाइल होनी चाहिए।
it: Errore: File non valido. Deve essere un file .quiz.
ja: エラー：無効なファイルです。.quizファイルである必要があります。
pt: Erro: Arquivo inválido. Deve ser um arquivo .quiz.
zh: 错误：无效文件。必须是.quiz文件。

# errorLoadingFile
source: Error loading the Quiz file: {error}
ar: خطأ في تحميل ملف الاختبار: {error}
ca: Error en carregar el fitxer Quiz: {error}
de: Fehler beim Laden der Quiz-Datei: {error}
el: Σφάλμα κατά τη φόρτωση του αρχείου Quiz: {error}
es: Error al cargar el archivo: {error}
eu: Errorea Quiz fitxategia kargatzean: {error}
fr: Erreur lors du chargement du fichier Quiz : {error}
gl: Erro cargando o ficheiro Quiz: {error}
hi: क्विज़ फ़ाइल लोड करने में त्रुटि: {error}
it: Errore nel caricamento del file Quiz: {error}
ja: クイズファイルの読み込みエラー：{error}
pt: Erro ao carregar o arquivo Quiz: {error}
zh: 加载测验文件时出错：{error}

# errorExportingFile
source: Error exporting the file: {error}
ar: خطأ في تصدير الملف: {error}
ca: Error en exportar el fitxer: {error}
de: Fehler beim Exportieren der Datei: {error}
el: Σφάλμα κατά την εξαγωγή του αρχείου: {error}
es: Error al exportar el archivo: {error}
eu: Errorea fitxategia esportatzen: {error}
fr: Erreur lors de l'exportation du fichier : {error}
gl: Erro exportando o ficheiro: {error}
hi: फ़ाइल एक्सपोर्ट करने में त्रुटि: {error}
it: Errore nell'esportazione del file: {error}
ja: ファイルのエクスポートエラー：{error}
pt: Erro ao exportar o arquivo: {error}
zh: 导出文件时出错：{error}

# cancelButton
source: Cancel
ar: إلغاء
ca: Cancel·lar
de: Abbrechen
el: Ακύρωση
es: Cancelar
eu: Utzi
fr: Annuler
gl: Cancelar
hi: रद्द करें
it: Annulla
ja: キャンセル
pt: Cancelar
zh: 取消

# saveButton
source: Save
ar: حفظ
ca: Desar
de: Speichern
el: Αποθήκευση
es: Guardar
eu: Gorde
fr: Sauvegarder
gl: Gardar
hi: सेव करें
it: Salva
ja: 保存
pt: Salvar
zh: 保存

# confirmDeleteTitle
source: Confirm Deletion
ar: تأكيد الحذف
ca: Confirmar eliminació
de: Löschung bestätigen
el: Επιβεβαίωση Διαγραφής
es: Confirmar eliminación
eu: Ezabaketa Berretsi
fr: Confirmer la suppression
gl: Confirmar eliminación
hi: हटाने की पुष्टि करें
it: Conferma eliminazione
ja: 削除の確認
pt: Confirmar exclusão
zh: 确认删除

# confirmDeleteMessage
source: Are you sure you want to delete `{processName}` process?
ar: هل أنت متأكد من أنك تريد حذف العملية `{processName}`؟
ca: Esteu segur que voleu eliminar el procés `{processName}`?
de: Sind Sie sicher, dass Sie den Prozess `{processName}` löschen möchten?
el: Είστε σίγουροι ότι θέλετε να διαγράψετε τη διαδικασία `{processName}`;
es: ¿Estás seguro de que quieres eliminar `{processName}`?
eu: Ziur zaude `{processName}` prozesua ezabatu nahi duzula?
fr: Êtes-vous sûr de vouloir supprimer le processus `{processName}` ?
gl: Estás seguro de que queres eliminar o proceso `{processName}`?
hi: क्या आप वाकई `{processName}` प्रक्रिया को हटाना चाहते हैं?
it: Sei sicuro di voler eliminare il processo `{processName}`?
ja: 本当に`{processName}`プロセスを削除しますか？
pt: Tem certeza de que deseja excluir o processo `{processName}`?
zh: 您确定要删除"{processName}"过程吗？

# deleteButton
source: Delete
ar: حذف
ca: Eliminar
de: Löschen
el: Διαγραφή
es: Eliminar
eu: Ezabatu
fr: Supprimer
gl: Eliminar
hi: हटाएं
it: Elimina
ja: 削除
pt: Excluir
zh: 删除

# confirmExitTitle
source: Confirm Exit
ar: تأكيد الخروج
ca: Confirmar sortida
de: Beenden bestätigen
el: Επιβεβαίωση Εξόδου
es: Confirmar salida
eu: Irteera Berretsi
fr: Confirmer la sortie
gl: Confirmar saída
hi: बाहर निकलने की पुष्टि करें
it: Conferma uscita
ja: 終了の確認
pt: Confirmar saída
zh: 确认退出

# confirmExitMessage
source: There are unsaved changes. Do you want to leave and discard changes?
ar: هناك تغييرات غير محفوظة. هل تريد الخروج وتجاهل التغييرات؟
ca: Hi ha canvis sense desar. Voleu sortir descartant els canvis?
de: Sind Sie sicher, dass Sie ohne Speichern beenden möchten?
el: Υπάρχουν μη αποθηκευμένες αλλαγές. Θέλετε να φύγετε απορρίπτοντας τις αλλαγές;
es: Existen cambios sin guardar. ¿Quieres salir descartando los cambios?
eu: Gorde gabeko aldaketak daude. Aldaketak baztertuz irten nahi duzu?
fr: Êtes-vous sûr de vouloir quitter sans sauvegarder ?
gl: Estás seguro de que queres saír sen gardar?
hi: बिना सहेजे गए बदलाव मौजूद हैं। क्या आप बदलावों को रद्द करके बाहर निकलना चाहते हैं?
it: Ci sono modifiche non salvate. Vuoi uscire scartando le modifiche?
ja: 保存されていない変更があります。変更を破棄して終了しますか？
pt: Tem certeza de que deseja sair sem salvar?
zh: 有未保存的更改。您要放弃更改并离开吗？

# exitButton
source: Exit without saving
ar: خروج بدون حفظ
ca: Sortir sense desar
de: Beenden
el: Έξοδος χωρίς αποθήκευση
es: Salir sin guardar
eu: Irten gorde gabe
fr: Quitter
gl: Saír
hi: बिना सहेजे बाहर निकलें
it: Esci senza salvare
ja: 保存せずに終了
pt: Sair
zh: 退出不保存

# saveDialogTitle
source: Please select an output file:
ar: يرجى اختيار ملف الإخراج:
ca: Seleccioneu un fitxer de sortida:
de: Bitte wählen Sie eine Ausgabedatei:
el: Παρακαλώ επιλέξτε αρχείο εξόδου:
es: Por favor selecciona un archivo de salida:
eu: Hautatu irteera fitxategia:
fr: Veuillez sélectionner un fichier de sortie :
gl: Selecciona un ficheiro de saída:
hi: कृपया आउटपुट फ़ाइल चुनें:
it: Seleziona un file di output:
ja: 出力ファイルを選択してください：
pt: Selecione um arquivo de saída:
zh: 请选择输出文件：

# createQuizFileTitle
source: Create Quiz File
ar: إنشاء ملف اختبار
ca: Crear fitxer Quiz
de: Quiz-Datei erstellen
el: Δημιουργία Αρχείου Quiz
es: Crear archivo Quiz
eu: Quiz Fitxategia Sortu
fr: Créer un fichier Quiz
gl: Crear ficheiro Quiz
hi: क्विज़ फ़ाइल बनाएं
it: Crea file Quiz
ja: クイズファイルを作成
pt: Criar arquivo Quiz
zh: 创建测验文件

# editQuizFileTitle
source: Edit Quiz File
ar: تعديل ملف الاختبار
ca: Editar fitxer Quiz
de: Quizdatei bearbeiten
el: Επεξεργασία Αρχείου Κουίζ
es: Editar archivo de cuestionario
eu: Quiz Fitxategia Editatu
fr: Modifier le fichier quiz
gl: Editar ficheiro Quiz
hi: क्विज़ फ़ाइल संपादित करें
it: Modifica file Quiz
ja: クイズファイルを編集
pt: Editar arquivo Quiz
zh: 编辑测验文件

# fileNameLabel
source: File Name
ar: اسم الملف
ca: Nom del fitxer
de: Dateiname
el: Όνομα Αρχείου
es: Nombre del archivo
eu: Fitxategiaren Izena
fr: Nom du fichier
gl: Nome do ficheiro
hi: फ़ाइल का नाम
it: Nome file
ja: ファイル名
pt: Nome do arquivo
zh: 文件名

# fileDescriptionLabel
source: File Description
ar: وصف الملف
ca: Descripció del fitxer
de: Dateibeschreibung
el: Περιγραφή Αρχείου
es: Descripción del archivo
eu: Fitxategiaren Deskribapena
fr: Description du fichier
gl: Descrición do ficheiro
hi: फ़ाइल का विवरण
it: Descrizione file
ja: ファイルの説明
pt: Descrição do arquivo
zh: 文件描述

# createButton
source: Create
ar: إنشاء
ca: Crear
de: Erstellen
el: Δημιουργία
es: Crear
eu: Sortu
fr: Créer
gl: Crear
hi: बनाएं
it: Crea
ja: 作成
pt: Criar
zh: 创建

# fileNameRequiredError
source: The file name is required.
ar: اسم الملف مطلوب.
ca: El nom del fitxer és obligatori.
de: Der Dateiname ist erforderlich.
el: Το όνομα αρχείου είναι υποχρεωτικό.
es: El nombre del archivo es requerido.
eu: Fitxategiaren izena beharrezkoa da.
fr: Le nom du fichier est requis.
gl: O nome do ficheiro é obrigatorio.
hi: फ़ाइल का नाम आवश्यक है।
it: Il nome del file è obbligatorio.
ja: ファイル名は必須です。
pt: O nome do arquivo é obrigatório.
zh: 文件名是必需的。

# fileDescriptionRequiredError
source: The file description is required.
ar: وصف الملف مطلوب.
ca: La descripció del fitxer és obligatòria.
de: Die Dateibeschreibung ist erforderlich.
el: Η περιγραφή αρχείου είναι υποχρεωτική.
es: La descripción del archivo es requerida.
eu: Fitxategiaren deskribapena beharrezkoa da.
fr: La description du fichier est requise.
gl: A descrición do ficheiro é obrigatoria.
hi: फ़ाइल का विवरण आवश्यक है।
it: La descrizione del file è obbligatoria.
ja: ファイルの説明は必須です。
pt: A descrição do arquivo é obrigatória.
zh: 文件描述是必需的。

# versionLabel
source: Version
ar: الإصدار
ca: Versió
el: Έκδοση
es: Versión
eu: Bertsioa
gl: Versión
hi: संस्करण
it: Versione
ja: バージョン
pt: Versão
zh: 版本

# authorLabel
source: Author
ar: المؤلف
ca: Autor
de: Autor
el: Συγγραφέας
es: Autor
eu: Egilea
fr: Auteur
gl: Autor
hi: लेखक
it: Autore
ja: 作成者
pt: Autor
zh: 作者

# authorRequiredError
source: The author is required.
ar: المؤلف مطلوب.
ca: L'autor és obligatori.
de: Der Autor ist erforderlich.
el: Ο συγγραφέας είναι υποχρεωτικός.
es: El autor es requerido.
eu: Egilea beharrezkoa da.
fr: L'auteur est requis.
gl: O autor é obrigatorio.
hi: लेखक का नाम आवश्यक है।
it: L'autore è obbligatorio.
ja: 作成者は必須です。
pt: O autor é obrigatório.
zh: 作者是必需的。

# requiredFieldsError
source: All required fields must be completed.
ar: يجب ملء جميع الحقول المطلوبة.
ca: Tots els camps obligatoris han de ser completats.
de: Alle erforderlichen Felder müssen ausgefüllt werden.
el: Όλα τα υποχρεωτικά πεδία πρέπει να συμπληρωθούν.
es: Todos los campos requeridos deben ser completados.
eu: Beharrezko eremu guztiak bete behar dira.
fr: Tous les champs requis doivent être complétés.
gl: Todos os campos obrigatorios deben ser completados.
hi: सभी आवश्यक फ़ील्ड भरे जाने चाहिए।
it: Tutti i campi obbligatori devono essere completati.
ja: すべての必須フィールドを入力してください。
pt: Todos os campos obrigatórios devem ser preenchidos.
zh: 所有必填字段都必须填写。
