Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# requestFileNameTitle
source: Enter the Quiz file name
ar: أدخل اسم ملف الاختبار
ca: Introduïu el nom del fitxer Quiz
de: Geben Sie den Quiz-Dateinamen ein
el: Εισάγετε το όνομα του αρχείου Quiz
es: Ingresa el nombre del archivo Quiz
eu: Sartu Quiz fitxategiaren izena
fr: Entrez le nom du fichier Quiz
gl: Introduce o nome do ficheiro Quiz
hi: क्विज़ फ़ाइल का नाम दर्ज करें
it: Inserisci il nome del file Quiz
ja: クイズファイル名を入力
pt: Digite o nome do arquivo Quiz
zh: 输入测验文件名

# fileNameHint
source: File name
ar: اسم الملف
ca: Nom del fitxer
de: Dateiname
el: Όνομα αρχείου
es: Nombre del archivo (opcional)
eu: Fitxategiaren izena
fr: Nom du fichier
gl: Nome do ficheiro
hi: फ़ाइल का नाम
it: Nome file
ja: ファイル名
pt: Nome do arquivo
zh: 文件名

# emptyFileNameMessage
source: The file name cannot be empty.
ar: اسم الملف لا يمكن أن يكون فارغاً.
ca: El nom del fitxer no pot estar buit.
de: Der Dateiname darf nicht leer sein.
el: Το όνομα αρχείου δεν μπορεί να είναι κενό.
es: Por favor, ingresa un nombre de archivo
eu: Fitxategiaren izena ezin da hutsik egon.
fr: Le nom du fichier ne peut pas être vide.
gl: O nome do ficheiro non pode estar baleiro.
hi: फ़ाइल का नाम खाली नहीं हो सकता।
it: Il nome del file non può essere vuoto.
ja: ファイル名を空にすることはできません。
pt: O nome do arquivo não pode estar vazio.
zh: 文件名不能为空。

# acceptButton
source: Accept
ar: قبول
ca: Acceptar
de: Akzeptieren
el: Αποδοχή
es: Aceptar
eu: Onartu
fr: Accepter
gl: Aceptar
hi: स्वीकार करें
it: Accetta
ja: 承認
pt: Aceitar
zh: 接受

# saveTooltip
source: Save the file
ar: حفظ الملف
ca: Desar el fitxer
de: Datei speichern
el: Αποθήκευση αρχείου
es: Guardar el archivo
eu: Fitxategia gorde
fr: Sauvegarder le fichier
gl: Gardar o ficheiro
hi: फ़ाइल सेव करें
it: Salva il file
ja: ファイルを保存
pt: Salvar o arquivo
zh: 保存文件

# saveDisabledTooltip
source: No changes to save
ar: لا توجد تغييرات للحفظ
ca: Cap canvi per desar
de: Keine Änderungen zu speichern
el: Δεν υπάρχουν αλλαγές για αποθήκευση
es: No hay cambios que guardar
eu: Ez da aldaketarik gorde behar
fr: Aucun changement à sauvegarder
gl: Non hai cambios que gardar
hi: सेव करने के लिए कोई बदलाव नहीं
it: Nessuna modifica da salvare
ja: 保存する変更がありません
pt: Nenhuma alteração para salvar
zh: 没有需要保存的更改

# executeTooltip
source: Execute the exam
ar: تنفيذ الامتحان
ca: Executar l'examen
de: Prüfung ausführen
el: Εκτέλεση εξέτασης
es: Ejecutar el examen
eu: Azterketa exekutatu
fr: Exécuter l'examen
gl: Executar o exame
hi: परीक्षा शुरू करें
it: Esegui l'esame
ja: 試験を実行
pt: Executar o exame
zh: 执行考试

# addTooltip
source: Add a new question
ar: إضافة سؤال جديد
ca: Afegir una nova pregunta
de: Neue Frage hinzufügen
el: Προσθήκη νέας ερώτησης
es: Agregar una nueva pregunta
eu: Galdera berria gehitu
fr: Ajouter une nouvelle question
gl: Engadir unha nova pregunta
hi: नया प्रश्न जोड़ें
it: Aggiungi una nuova domanda
ja: 新しい問題を追加
pt: Adicionar uma nova pergunta
zh: 添加新问题

# backSemanticLabel
source: Back button
ar: زر الرجوع
ca: Botó tornar
de: Zurück-Schaltfläche
el: Κουμπί επιστροφής
es: Botón volver
eu: Itzuli botoia
fr: Bouton retour
gl: Botón volver
hi: वापस जाएं बटन
it: Pulsante indietro
ja: 戻るボタン
pt: Botão voltar
zh: 返回按钮

# createFileTooltip
source: Create a new Quiz file
ar: إنشاء ملف اختبار جديد
ca: Crear un nou fitxer Quiz
de: Neue Quiz-Datei erstellen
el: Δημιουργία νέου αρχείου Quiz
es: Crear un nuevo archivo Quiz
eu: Quiz fitxategi berria sortu
fr: Créer un nouveau fichier Quiz
gl: Crear un novo ficheiro Quiz
hi: नई क्विज़ फ़ाइल बनाएं
it: Crea un nuovo file Quiz
ja: 新しいクイズファイルを作成
pt: Criar um novo arquivo Quiz
zh: 创建新的测验文件

# loadFileTooltip
source: Load an existing Quiz file
ar: تحميل ملف اختبار موجود
ca: Carregar un fitxer Quiz existent
de: Vorhandene Quiz-Datei laden
el: Φόρτωση υπάρχοντος αρχείου Quiz
es: Cargar un archivo Quiz existente
eu: Dagoen Quiz fitxategia kargatu
fr: Charger un fichier Quiz existant
gl: Cargar un ficheiro Quiz existente
hi: मौजूदा क्विज़ फ़ाइल लोड करें
it: Carica un file Quiz esistente
ja: 既存のクイズファイルを読み込み
pt: Carregar um arquivo Quiz existente
zh: 加载现有的测验文件

source: Question {number}
ar: السؤال {number}
ca: Pregunta {number}
de: Frage {number}
el: Ερώτηση {number}
es: Pregunta {number}
eu: Galdera {number}
gl: Pregunta {number}
hi: प्रश्न {number}
it: Domanda {number}
ja: 問題 {number}
pt: Pergunta {number}
zh: 问题 {number}

# questionOfTotal
source: Question {current} of {total}
ar: السؤال {current} من {total}
ca: Pregunta {current} de {total}
de: Frage {current} von {total}
el: Ερώτηση {current} από {total}
es: Pregunta {current} de {total}
eu: {current}. galdera {total}(e)tik
fr: Question {current} sur {total}
gl: Pregunta {current} de {total}
hi: प्रश्न {current} / {total}
it: Domanda {current} di {total}
ja: {total} 問中 {current} 問目
pt: Pergunta {current} de {total}
zh: 第 {current} 题，共 {total} 题

source: Previous
ar: السابق
ca: Anterior
de: Zurück
el: Προηγούμενο
es: Anterior
eu: Aurrekoa
fr: Précédent
gl: Anterior
hi: पिछला
it: Precedente
ja: 前へ
pt: Anterior
zh: 上一个

source: Next
ar: التالي
ca: Següent
de: Weiter
el: Επόμενο
es: Siguiente
eu: Hurrengoa
fr: Suivant
gl: Seguinte
hi: अगला
it: Successivo
ja: 次へ
pt: Próximo
zh: 下一个

source: Finish
ar: إنهاء
ca: Acabar
de: Beenden
el: Τέλος
es: Finalizar
eu: Amaitu
fr: Terminer
gl: Rematar
hi: समाप्त करें
it: Termina
ja: 完了
pt: Finalizar
zh: 完成

source: Finish Quiz
ar: إنهاء الاختبار
ca: Acabar quiz
de: Quiz beenden
el: Ολοκλήρωση Κουίζ
es: Finalizar Quiz
eu: Quiz Amaitu
fr: Terminer le quiz
gl: Rematar quiz
hi: क्विज़ समाप्त करें
it: Termina quiz
ja: クイズを完了
pt: Finalizar quiz
zh: 完成测验

# finishQuizConfirmation
source: Are you sure you want to finish the quiz? You won't be able to change your answers afterwards.
ar: هل أنت متأكد من أنك تريد إنهاء الاختبار؟ لن تتمكن من تغيير إجاباتك بعد ذلك.
ca: Esteu segur que voleu acabar el quiz? No podreu canviar les vostres respostes després.
de: Sind Sie sicher, dass Sie das Quiz beenden möchten? Sie können Ihre Antworten danach nicht mehr ändern.
el: Είστε σίγουροι ότι θέλετε να ολοκληρώσετε το κουίζ; Δεν θα μπορείτε να αλλάξετε τις απαντήσεις σας μετά.
es: ¿Estás seguro de que quieres finalizar el quiz? No podrás cambiar tus respuestas después.
eu: Ziur zaude quiz-a amaitu nahi duzula? Ezingo dituzu zure erantzunak aldatu gero.
fr: Êtes-vous sûr de vouloir terminer le quiz ? Vous ne pourrez plus modifier vos réponses après.
gl: Estás seguro de que queres rematar o quiz? Non poderás cambiar as túas respostas despois.
hi: क्या आप वाकई क्विज़ समाप्त करना चाहते हैं? इसके बाद आप अपने उत्तर नहीं बदल सकेंगे।
it: Sei sicuro di voler terminare il quiz? Non potrai più modificare le tue risposte dopo.
ja: 本当にクイズを完了しますか？その後、回答を変更することはできません。
pt: Tem certeza de que deseja finalizar o quiz? Você não poderá mais alterar suas respostas depois.
zh: 您确定要完成测验吗？之后您将无法更改答案。

# resolveUnansweredQuestions
source: Resolve questions
ar: حل الأسئلة
ca: Resoldre preguntes
de: Fragen lösen
el: Επίλυση ερωτήσεων
es: Resolver preguntas
eu: Galderak ebatzi
fr: Résoudre les questions
gl: Resolver preguntas
hi: प्रश्न हल करें
it: Risolvi domande
ja: 未回答の問題を解く
pt: Resolver perguntas
zh: 解决未回答的问题

source: Abandon Quiz
ar: التخلي عن الاختبار
ca: Abandonar quiz
de: Quiz aufgeben
el: Εγκατάλειψη Κουίζ
es: Abandonar Quiz
eu: Quiz Utzi
fr: Abandonner le quiz
gl: Abandonar quiz
hi: क्विज़ छोड़ें
it: Abbandona quiz
ja: クイズを放棄
pt: Abandone o questionário
zh: 放弃测验

# abandonQuizConfirmation
source: Are you sure you want to abandon the quiz? All progress will be lost.
ar: هل أنت متأكد من أنك تريد التخلي عن الاختبار؟ سيتم فقدان جميع التقدم.
ca: Esteu segur que voleu abandonar el quiz? Tot el progrés es perdrà.
de: Sind Sie sicher, dass Sie das Quiz aufgeben möchten? Der gesamte Fortschritt geht verloren.
el: Είστε σίγουροι ότι θέλετε να εγκαταλείψετε το κουίζ; Όλη η πρόοδος θα χαθεί.
es: ¿Estás seguro de que quieres abandonar el quiz? Se perderá todo el progreso.
eu: Ziur zaude quiz-a utzi nahi duzula? Aurrerapen guztia galduko da.
fr: Êtes-vous sûr de vouloir abandonner le quiz ? Tous les progrès seront perdus.
gl: Estás seguro de que queres abandonar o quiz? Todo o progreso perderase.
hi: क्या आप वाकई क्विज़ छोड़ना चाहते हैं? सभी प्रगति खो जाएगी।
it: Sei sicuro di voler abbandonare il quiz? Tutti i progressi andranno persi.
ja: 本当にクイズを放棄しますか？すべての進捗が失われます。
pt: Tem certeza de que deseja abandonar o quiz? Todo o progresso será perdido.
zh: 您确定要放弃测验吗？所有进度都将丢失。

source: Abandon
ar: التخلي
ca: Abandonar
de: Aufgeben
el: Εγκατάλειψη
es: Abandonar
eu: Utzi
fr: Abandonner
gl: Abandonar
hi: छोड़ें
it: Abbandona
ja: 放棄
pt: Abandonar
zh: 放弃

source: Quiz Completed!
ar: تم إكمال الاختبار!
ca: Quiz Completat!
de: Quiz abgeschlossen!
el: Το Κουίζ Ολοκληρώθηκε!
es: ¡Quiz completado!
eu: Quiz Osatuta!
fr: Quiz Terminé !
gl: Quiz Completado!
hi: क्विज़ पूरी हुई!
it: Quiz Completato!
ja: クイズ完了！
pt: Quiz Concluído!
zh: 测验完成！

# score
source: Score: {score}%
ar: النتيجة: {score}%
ca: Puntuació: {score}%
de: Punktzahl: {score}%
el: Βαθμολογία: {score}%
es: Puntuación
eu: Puntuazioa: {score}%
gl: Puntuación: {score}%
hi: स्कोर: {score}%
it: Punteggio: {score}%
ja: スコア：{score}%
pt: Pontuação: {score}%
zh: 得分：{score}%

# correctAnswers
source: {correct} of {total} correct answers
ar: {correct} من {total} إجابات صحيحة
ca: {correct} de {total} respostes correctes
de: {correct} von {total} richtige Antworten
el: {correct} από {total} σωστές απαντήσεις
es: {correct} de {total} respuestas correctas
eu: {correct} / {total} erantzun zuzen
fr: {correct} de {total} réponses correctes
gl: {correct} de {total} respostas correctas
hi: {total} में से {correct} सही उत्तर
it: {correct} di {total} risposte corrette
ja: {total}問中{correct}問正解
pt: {correct} de {total} respostas corretas
zh: {total}个问题中答对{correct}个

# retry
source: Repeat
ar: إعادة المحاولة
ca: Repetir
de: Wiederholen
el: Επανάληψη
es: Repetir
eu: Berriro saiatu
fr: Répéter
gl: Reintentar
hi: दोहराएं
it: Ripeti
ja: 再試行
pt: Repetir
zh: 重试

# goBack
source: Finish
ar: إنهاء
ca: Acabar
de: Beenden
el: Τέλος
es: Finalizar
eu: Amaitu
fr: Terminer
gl: Rematar
hi: समाप्त करें
it: Termina
ja: 完了
pt: Finalizar
zh: 完成

# retryFailedQuestions
source: Retry Failed
ar: إعادة الأسئلة الخاطئة
ca: Repetir fallades
de: Fehlgeschlagene wiederholen
el: Επανάληψη Λάθος
es: Reintentar errores
eu: Huts egindakoak Berriro
fr: Reprendre échecs
gl: Reintentar falladas
hi: गलत प्रश्न दोहराएं
it: Riprova sbagliate
ja: 不正解を再試行
pt: Repetir Falhadas
zh: 重做错题

# question
source: Question: {question}
ar: السؤال: {question}
ca: Pregunta: {question}
de: Frage: {question}
el: Ερώτηση: {question}
es: Pregunta: {question}
eu: Galdera: {question}
gl: Pregunta: {question}
hi: प्रश्न: {question}
it: Domanda: {question}
ja: 問題：{question}
pt: Pergunta: {question}
zh: 问题：{question}

# selectQuestionCountTitle
source: Select Number of Questions
ar: اختر عدد الأسئلة
ca: Seleccionar nombre de preguntes
de: Anzahl der Fragen auswählen
el: Επιλογή Αριθμού Ερωτήσεων
es: Seleccionar número de preguntas
eu: Galdera Kopurua Hautatu
fr: Sélectionner le nombre de questions
gl: Seleccionar número de preguntas
hi: प्रश्नों की संख्या चुनें
it: Seleziona numero di domande
ja: 問題数を選択
pt: Selecionar número de perguntas
zh: 选择问题数量

# selectQuestionCountMessage
source: How many questions would you like to answer in this quiz?
ar: كم عدد الأسئلة التي تريد الإجابة عليها في هذا الاختبار؟
ca: A quantes preguntes us agradaria respondre en aquest quiz?
de: Wie viele Fragen möchten Sie in diesem Quiz beantworten?
el: Πόσες ερωτήσεις θα θέλατε να απαντήσετε σε αυτό το κουίζ;
es: ¿Cuántas preguntas te gustaría responder en este quiz?
eu: Zenbat galderari erantzun nahi diezu quiz honetan?
fr: Combien de questions aimeriez-vous répondre dans ce quiz ?
gl: A cantas preguntas te gustaría responder neste quiz?
hi: इस क्विज़ में आप कितने प्रश्नों का उत्तर देना चाहते हैं?
it: A quante domande vorresti rispondere in questo quiz?
ja: このクイズで何問に回答しますか？
pt: Quantas perguntas você gostaria de responder neste quiz?
zh: 您想在这个测验中回答多少个问题？

# allQuestions
source: All questions ({count})
ar: جميع الأسئلة ({count})
ca: Totes les preguntes ({count})
de: Alle Fragen ({count})
el: Όλες οι ερωτήσεις ({count})
es: Todas las preguntas ({count})
eu: Galdera guztiak ({count})
fr: Toutes les questions ({count})
gl: Todas as preguntas ({count})
hi: सभी प्रश्न ({count})
it: Tutte le domande ({count})
ja: すべての問題（{count}問）
pt: Todas as perguntas ({count})
zh: 所有问题（{count}个）

source: Start Quiz
ar: بدء الاختبار
ca: Començar quiz
de: Quiz starten
el: Έναρξη Κουίζ
es: Iniciar Quiz
eu: Quiz Hasi
fr: Commencer le quiz
gl: Comezar quiz
hi: क्विज़ शुरू करें
it: Inizia quiz
ja: クイズ開始
pt: Iniciar Quiz
zh: 开始测验

# errorInvalidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صالح
ca: Si us plau, introduïu un número vàlid
de: Bitte geben Sie eine gültige Zahl ein
el: Παρακαλώ εισάγετε έγκυρο αριθμό
es: Por favor ingresa un número válido
eu: Mesedez, sartu zenbaki baliozkoa
fr: Veuillez entrer un nombre valide
gl: Por favor, introduce un número válido
hi: कृपया वैध संख्या दर्ज करें
it: Inserisci un numero valido
ja: 有効な数字を入力してください
pt: Por favor, digite um número válido
zh: 请输入有效数字

# errorNumberMustBePositive
source: Number must be greater than 0
ar: يجب أن يكون الرقم أكبر من 0
ca: El número ha de ser més gran que 0
de: Die Zahl muss größer als 0 sein
el: Ο αριθμός πρέπει να είναι μεγαλύτερος από 0
es: El número debe ser mayor que 0
eu: Zenbakia 0 baino handiagoa izan behar da
fr: Le nombre doit être supérieur à 0
gl: O número debe ser maior que 0
hi: संख्या 0 से अधिक होनी चाहिए
it: Il numero deve essere maggiore di 0
ja: 数字は0より大きい必要があります
pt: O número deve ser maior que 0
zh: 数字必须大于0

# customNumberLabel
source: Or enter a custom number:
ar: أو أدخل رقماً مخصصاً:
ca: O introduïu un número personalitzat:
de: Oder geben Sie eine benutzerdefinierte Zahl ein:
el: Ή εισάγετε προσαρμοσμένο αριθμό:
es: O introduce un número personalizado:
eu: Edo sartu zenbaki pertsonalizatua:
fr: Ou entrez un nombre personnalisé :
gl: Ou introduce un número personalizado:
hi: या कस्टम संख्या दर्ज करें:
it: O inserisci un numbero personalizzato:
ja: またはカスタム数を入力：
pt: Ou digite um número personalizado:
zh: 或输入自定义数量：

# numberInputLabel
source: Number of questions
ar: عدد الأسئلة
ca: Nombre de preguntes
de: Anzahl der Fragen
el: Αριθμός ερωτήσεων
es: Número de preguntas
eu: Galdera kopurua
fr: Nombre de questions
gl: Número de preguntas
hi: प्रश्नों की संख्या
it: Numero di domande
ja: 問題数
pt: Número de perguntas
zh: 问题数量

# questionOrderConfigTitle
source: Question Order Configuration
ar: إعداد ترتيب الأسئلة
ca: Configuració de l'ordre de les preguntes
de: Fragenreihenfolge-Konfiguration
el: Διαμόρφωση Σειράς Ερωτήσεων
es: Configuración del Orden de Preguntas
eu: Galdera Ordenaren Konfigurazioa
fr: Configuration de l'ordre des questions
gl: Configuración da orde das preguntas
hi: प्रश्न क्रम कॉन्फ़िगरेशन
it: Configurazione ordine domande
ja: 問題順序の設定
pt: Configuração da ordem das perguntas
zh: 问题顺序配置

# questionOrderConfigDescription
source: Select the order in which you want questions to appear during the exam:
ar: اختر الترتيب الذي تريد أن تظهر به الأسئلة أثناء الامتحان:
ca: Seleccioneu l'ordre en què voleu que apareguin les preguntes durant l'examen:
de: Wählen Sie die Reihenfolge, in der die Fragen während der Prüfung erscheinen sollen:
el: Επιλέξτε τη σειρά εμφάνισης των ερωτήσεων κατά την εξέταση:
es: Selecciona el orden en que deseas que aparezcan las preguntas durante el examen:
eu: Hautatu galderak azterketaren zehar nola agertu nahi dituzun:
fr: Sélectionnez l'ordre dans lequel vous voulez que les questions apparaissent pendant l'examen :
gl: Selecciona a orde na que queres que aparezan as preguntas durante o exame:
hi: परीक्षा के दौरान प्रश्न किस क्रम में दिखाए जाएं, यह चुनें:
it: Seleziona l'ordine in cui vuoi che le domande appaiano durante l'esame:
ja: 試験中に問題を表示する順序を選択してください：
pt: Selecione a ordem na qual deseja que as perguntas apareçam durante o exame:
zh: 选择考试期间问题的显示顺序：

# questionOrderAscending
source: Ascending Order
ar: الترتيب التصاعدي
ca: Ordre ascendent
de: Aufsteigende Reihenfolge
el: Αύξουσα Σειρά
es: Orden ascendente
eu: Orden Gorakorra
fr: Ordre croissant
gl: Orde ascendente
hi: आरोही क्रम
it: Ordine crescente
ja: 昇順
pt: Ordem crescente
zh: 升序

# questionOrderAscendingDesc
source: Questions will appear in order from 1 to the end
ar: ستظهر الأسئلة بترتيب من 1 إلى النهاية
ca: Les preguntes apareixeran en ordre de 1 al final
de: Fragen erscheinen in der Reihenfolge von 1 bis zum Ende
el: Οι ερωτήσεις θα εμφανίζονται με σειρά από 1 έως το τέλος
es: Las preguntas aparecerán en orden del 1 al final
eu: Galderak 1etik azkenera ordenean agertuko dira
fr: Les questions apparaîtront dans l'ordre de 1 à la fin
gl: As preguntas aparecerán en orde de 1 ao final
hi: प्रश्न 1 से अंत तक क्रम में दिखेंगे
it: Le domande appariranno in ordine da 1 alla fine
ja: 問題は1から最後まで順番に表示されます
pt: As perguntas aparecerão em ordem de 1 ao final
zh: 问题将按从1到结尾的顺序显示

# questionOrderDescending
source: Descending Order
ar: الترتيب التنازلي
ca: Ordre descendent
de: Absteigende Reihenfolge
el: Φθίνουσα Σειρά
es: Orden descendente
eu: Orden Beherakorra
fr: Ordre décroissant
gl: Orde descendent
hi: अवरोही क्रम
it: Ordine decrescente
ja: 降順
pt: Ordem decrescente
zh: 降序

# questionOrderDescendingDesc
source: Questions will appear from the end to 1
ar: ستظهر الأسئلة من النهاية إلى 1
ca: Les preguntes apareixeran del final a 1
de: Fragen erscheinen vom Ende bis 1
el: Οι ερωτήσεις θα εμφανίζονται από το τέλος προς το 1
es: Las preguntas aparecerán del final al 1
eu: Galderak azkenatik 1era ordenean agertuko dira
fr: Les questions apparaîtront de la fin à 1
gl: As preguntas aparecerán do final a 1
hi: प्रश्न अंत से 1 तक दिखेंगे
it: Le domande appariranno dalla fine a 1
ja: 問題は最後から1まで表示されます
pt: As perguntas aparecerão do final a 1
zh: 问题将从结尾到1显示

# questionOrderRandom
source: Randomize Questions Order
ar: ترتيب عشوائي للأسئلة
ca: Aleatoritzar l'ordre de les preguntes
de: Zufällig
el: Τυχαία σειρά ερωτήσεων
es: Aleatorizar el orden de las preguntas
eu: Galderen ordena ausazkotu
fr: Aléatoire
gl: Aleatorio
hi: प्रश्नों का क्रम यादृच्छिक करें
it: Casuale
ja: ランダム
pt: Aleatório
zh: 随机化问题顺序

# questionOrderRandomDesc
source: Questions will appear in random order
ar: ستظهر الأسئلة بترتيب عشوائي
ca: Les preguntes apareixeran en ordre aleatori
de: Fragen erscheinen in zufälliger Reihenfolge
el: Οι ερωτήσεις θα εμφανίζονται με τυχαία σειρά
es: Las preguntas aparecerán en orden aleatorio
eu: Galderak orden ausazkoan agertuko dira
fr: Les questions apparaîtront dans un ordre aléatoire
gl: As preguntas aparecerán en orde aleatorio
hi: प्रश्न यादृच्छिक क्रम में दिखेंगे
it: Le domande appariranno in ordine casuale
ja: 問題はランダム順で表示されます
pt: As perguntas aparecerão em ordem aleatória
zh: 问题将随机显示

# questionOrderConfigTooltip
source: Question order configuration
ar: إعداد ترتيب الأسئلة
ca: Configuració de l'ordre de les preguntes
de: Fragenreihenfolge-Konfiguration
el: Διαμόρφωση σειράς ερωτήσεων
es: Configuración del orden de preguntas
eu: Galdera ordenaren konfigurazioa
fr: Configuration de l'ordre des questions
gl: Configuración da orde das preguntas
hi: प्रश्न क्रम कॉन्फ़िगरेशन
it: Configurazione ordine domande
ja: 問題順序の設定
pt: Configuração da ordem das perguntas
zh: 问题顺序配置

source: Save
ar: حفظ
ca: Desar
de: Speichern
el: Αποθήκευση
es: Guardar
eu: Gorde
fr: Sauvegarder
gl: Gardar
hi: सेव करें
it: Salva
ja: 保存
pt: Salvar
zh: 保存

# examTimeLimitTitle
source: Exam Time Limit
ar: حد وقت الامتحان
ca: Límit de temps de l'examen
de: Prüfungszeit-Limit
el: Χρονικό Όριο Εξέτασης
es: Límite de tiempo del examen
eu: Azterketaren Denbora Muga
fr: Limite de temps d'examen
gl: Límite de tempo do exame
hi: परीक्षा समय सीमा
it: Limite di tempo esame
ja: 試験時間制限
pt: Limite de tempo do exame
zh: 考试时间限制

# examTimeLimitDescription
source: Set a time limit for the exam. A countdown timer will be displayed during the quiz.
ar: قم بتعيين حد زمني للاختبار. سيتم عرض مؤقت تنازلي أثناء الاختبار.
ca: Estableix un límit de temps per a l'examen. Es mostrarà un cronòmetre durant el quiz.
de: Setzen Sie ein Zeitlimit für die Prüfung. Wenn aktiviert, wird während des Quiz ein Countdown-Timer angezeigt.
el: Ορίστε χρονικό όριο για την εξέταση. Θα εμφανίζεται χρονόμετρο κατά τη διάρκεια του κουίζ.
es: Establece un límite de tiempo para el examen. Se mostrará un cronómetro durante el quiz.
eu: Ezarri azterketarentzako denbora muga. Aktibatutakoan, denbora atzera-kontaketa erakutsiko da quiz-ean zehar.
fr: Définir une limite de temps pour l'examen. Lorsqu'elle est activée, un minuteur de compte à rebours sera affiché pendant le quiz.
gl: Estabelece un límite de tempo para o exame. Cando se active, mostrarásee un temporizador de conta atrás durante o quiz.
hi: परीक्षा के लिए समय सीमा निर्धारित करें। क्विज़ के दौरान काउंटडाउन टाइमर दिखेगा।
it: Imposta un limite di tempo per l'esame. Quando abilitato, verrà visualizzato un timer di conto alla rovescia durante il quiz.
ja: 試験の時間制限を設定します。有効にすると、クイズ中にカウントダウンタイマーが表示されます。
pt: Defina um limite de tempo para o exame. Quando habilitado, um cronômetro regressivo será exibido durante o quiz.
zh: 为考试设置时间限制。测验期间将显示倒计时器。

# examTimeLimitOffDescription
source: There is no time limit for this exam.
ar: لا يوجد حد زمني لهذا الاختبار.
ca: No hi ha límit de temps per a aquest examen.
el: Δεν υπάρχει χρονικό όριο για αυτήν την εξέταση.
es: No hay límite de tiempo para este examen.
hi: इस परीक्षा के लिए कोई समय सीमा नहीं है।
zh: 本次考试没有时间限制。

source: Enable time limit
ar: تفعيل الحد الزمني
ca: Activar límit de temps
de: Zeitlimit aktivieren
el: Ενεργοποίηση χρονικού ορίου
es: Habilitar límite de tiempo
eu: Denbora muga gaitu
fr: Activer la limite de temps
gl: Activar límite de tempo
hi: समय सीमा सक्षम करें
it: Abilita limite di tempo
ja: 時間制限を有効にする
pt: Habilitar limite de tempo
zh: 启用时间限制

source: Time limit (minutes)
ar: الحد الزمني (دقائق)
ca: Límit de temps (minuts)
de: Zeitlimit (Minuten)
el: Χρονικό όριο (λεπτά)
es: Límite de tiempo (minutos)
eu: Denbora muga (minutuak)
fr: Limite de temps (minutes)
gl: Límite de tempo (minutos)
hi: समय सीमा (मिनट)
it: Limite di tempo (minuti)
ja: 時間制限（分）
pt: Limite de tempo (minutos)
zh: 时间限制（分钟）

# examTimeExpiredTitle
source: Time's Up!
ar: انتهى الوقت!
ca: Temps esgotat!
de: Zeit abgelaufen!
el: Τέλος Χρόνου!
es: ¡Se acabó el tiempo!
eu: Denbora Amaitu da!
fr: Temps écoulé !
gl: Tempo esgotado!
hi: समय समाप्त!
it: Tempo scaduto!
ja: 時間切れ！
pt: Tempo esgotado!
zh: 时间到！

# examTimeExpiredMessage
source: The exam time has expired. Your answers have been automatically submitted.
ar: انتهى وقت الامتحان. تم تقديم إجاباتك تلقائياً.
ca: El temps de l'examen ha expirat. Les vostres respostes s'han enviat automàticament.
de: Die Prüfungszeit ist abgelaufen. Ihre Antworten wurden automatisch übermittelt.
el: Ο χρόνος εξέτασης έληξε. Οι απαντήσεις σας υποβλήθηκαν αυτόματα.
es: El tiempo del examen ha expirado. Tus respuestas han sido enviadas automáticamente.
eu: Azterketaren denbora amaitu da. Zure erantzunak automatikoki bidali dira.
fr: Le temps d'examen a expiré. Vos réponses ont été automatiquement soumises.
gl: O tempo do exame expirou. As túas respostas enviáronse automaticamente.
hi: परीक्षा का समय समाप्त हो गया है। आपके उत्तर स्वचालित रूप से जमा कर दिए गए हैं।
it: Il tempo dell'esame è scaduto. Le tue risposte sono state automaticamente inviate.
ja: 試験時間が終了しました。回答が自動的に提出されました。
pt: O tempo do exame expirou. Suas respostas foram automaticamente enviadas.
zh: 考试时间已到。您的答案已自动提交。

# questionTypeMultipleChoice
source: Multiple Choice
ar: اختيار متعدد
ca: Elecció múltiple
de: Mehrfachauswahl
el: Πολλαπλής Επιλογής
es: Opción múltiple
eu: Aukera Anitza
fr: Choix multiple
gl: Elección múltiple
hi: बहुविकल्पीय
it: Scelta multipla
ja: 複数選択
pt: Múltipla escolha
zh: 多选题
