Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

source: Remove option
ar: إزالة الخيار
ca: Eliminar opció
de: Option entfernen
el: Αφαίρεση επιλογής
es: Eliminar opción
eu: Aukera kendu
fr: Supprimer l'option
gl: Eliminar opción
hi: विकल्प हटाएं
it: Rimuovi opzione
ja: 選択肢を削除
pt: Remover opção
zh: 移除选项

source: Select correct answer
ar: اختر الإجابة الصحيحة
ca: Seleccionar resposta correcta
de: Richtige Antwort auswählen
el: Επιλογή σωστής απάντησης
es: Seleccionar respuesta correcta
eu: Erantzun zuzena hautatu
fr: Sélectionner la réponse correcte
gl: Seleccionar resposta correcta
hi: सही उत्तर चुनें
it: Seleziona risposta corretta
ja: 正解を選択
pt: Selecionar resposta correta
zh: 选择正确答案

source: Select correct answers
ar: اختر الإجابات الصحيحة
ca: Seleccionar respostes correctes
de: Richtige Antworten auswählen
el: Επιλογή σωστών απαντήσεων
es: Seleccionar respuestas correctas
eu: Erantzun zuzenak hautatu
fr: Sélectionner les réponses correctes
gl: Seleccionar respostas correctas
hi: सही उत्तर चुनें
it: Seleziona risposte corrette
ja: 正解を選択
pt: Selecionar respostas corretas
zh: 选择正确答案

# emptyOptionsError
source: Options {optionNumbers} are empty. Please add text to them or remove them.
ar: الخيارات {optionNumbers} فارغة. يرجى إضافة نص إليها أو إزالتها.
ca: Les opcions {optionNumbers} estan buides. Afegiu-hi text o elimineu-les.
de: Optionen {optionNumbers} sind leer. Bitte fügen Sie Text hinzu oder entfernen Sie sie.
el: Οι επιλογές {optionNumbers} είναι κενές. Παρακαλώ προσθέστε κείμενο ή αφαιρέστε τις.
es: Las opciones {optionNumbers} están vacías. Por favor añade texto o elimínalas.
eu: {optionNumbers} aukerak hutsik daude. Gehitu testua edo kendu itzazu.
fr: Les options {optionNumbers} sont vides. Veuillez leur ajouter du texte ou les supprimer.
gl: As opcións {optionNumbers} están baleiras. Engádelles texto ou elimínaas.
hi: विकल्प {optionNumbers} खाली हैं। कृपया उनमें पाठ जोड़ें या उन्हें हटा दें।
it: Le opzioni {optionNumbers} sono vuote. Aggiungi del testo o rimuovile.
ja: 選択肢{optionNumbers}が空です。テキストを追加するか削除してください。
pt: Opções {optionNumbers} estão vazias. Adicione texto a elas ou remova-as.
zh: 选项{optionNumbers}为空。请为它们添加文本或删除它们。

# emptyOptionError
source: Option {optionNumber} is empty. Please add text to it or remove it.
ar: الخيار {optionNumber} فارغ. يرجى إضافة نص إليه أو إزالته.
ca: L'opció {optionNumber} està buida. Afegiu-hi text o elimineu-la.
de: Option {optionNumber} ist leer. Bitte fügen Sie Text hinzu oder entfernen Sie sie.
el: Η επιλογή {optionNumber} είναι κενή. Παρακαλώ προσθέστε κείμενο ή αφαιρέστε την.
es: La opción {optionNumber} está vacía. Por favor añade texto o elimínala.
eu: {optionNumber} aukera hutsik dago. Gehitu testua edo kendu ezazu.
fr: L'option {optionNumber} est vide. Veuillez lui ajouter du texte ou la supprimer.
gl: A opción {optionNumber} está baleira. Engádelle texto ou elimínaa.
hi: विकल्प {optionNumber} खाली है। कृपया इसमें पाठ जोड़ें या इसे हटा दें।
it: L'opzione {optionNumber} è vuota. Aggiungi del testo o rimuovila.
ja: 選択肢{optionNumber}が空です。テキストを追加するか削除してください。
pt: Opção {optionNumber} está vazia. Adicione texto a ela ou remova-a.
zh: 选项{optionNumber}为空。请为其添加文本或删除它。

# optionEmptyError
source: This option cannot be empty
ar: هذا الخيار لا يمكن أن يكون فارغاً
ca: Aquesta opció no pot estar buida
de: Diese Option darf nicht leer sein
el: Αυτή η επιλογή δεν μπορεί να είναι κενή
es: Esta opción no puede estar vacía
eu: Aukera hau ezin da hutsik egon
fr: Cette option ne peut pas être vide
gl: Esta opción non pode estar baleira
hi: यह विकल्प खाली नहीं हो सकता
it: Questa opzione non può essere vuota
ja: この選択肢を空にすることはできません
pt: Esta opção não pode estar vazia
zh: 此选项不能为空

# hasImage
source: Image
ar: صورة
ca: Imatge
de: Bild
el: Εικόνα
es: Imagen
eu: Irudia
gl: Imaxe
hi: चित्र
it: Immagine
ja: 画像
pt: Imagem
zh: 图片

# hasExplanation
source: Explanation
ar: شرح
ca: Explicació
de: Erklärung
el: Εξήγηση
es: Explicación
eu: Azalpena
fr: Explication
gl: Explicación
hi: स्पष्टीकरण
it: Spiegazione
ja: 解説
pt: Explicação
zh: 解释

# errorLoadingSettings
source: Error loading settings: {error}
ar: خطأ في تحميل الإعدادات: {error}
ca: Error en carregar la configuració: {error}
de: Fehler beim Laden der Einstellungen: {error}
el: Σφάλμα φόρτωσης ρυθμίσεων: {error}
es: Error al cargar configuraciones: {error}
eu: Errorea ezarpenak kargatzean: {error}
fr: Erreur de chargement des paramètres : {error}
gl: Erro cargando a configuración: {error}
hi: सेटिंग्स लोड करने में त्रुटि: {error}
it: Errore nel caricamento delle impostazioni: {error}
ja: 設定の読み込みエラー：{error}
pt: Erro ao carregar configurações: {error}
zh: 加载设置时出错：{error}

source: Could not open {url}
ar: لا يمكن فتح {url}
ca: No s'ha pogut obrir {url}
de: Konnte {url} nicht öffnen
el: Αδυναμία ανοίγματος {url}
es: No se pudo abrir {url}
eu: Ezin izan da {url} ireki
fr: Impossible d'ouvrir {url}
gl: Non se puido abrir {url}
hi: {url} खोला नहीं जा सका
it: Impossibile aprire {url}
ja: {url}を開けませんでした
pt: Não foi possível abrir {url}
zh: 无法打开{url}

source: Loading AI services...
ar: جاري تحميل خدمات الذكاء الاصطناعي...
ca: Carregant serveis IA...
de: KI-Services werden geladen...
el: Φόρτωση υπηρεσιών AI...
es: Cargando servicios de IA...
eu: AI zerbitzuak kargatzen...
fr: Chargement des services IA...
gl: Cargando servizos IA...
hi: AI सेवाएं लोड हो रही हैं...
it: Caricamento servizi IA...
ja: AIサービスを読み込み中...
pt: Carregando serviços IA...
zh: 正在加载AI服务...

# usingAiService
source: Using: {serviceName}
ar: الاستخدام: {serviceName}
ca: Usant: {serviceName}
de: Verwende: {serviceName}
el: Χρήση: {serviceName}
es: Usando: {serviceName}
eu: Erabiltzen: {serviceName}
fr: Utilisation : {serviceName}
gl: Usando: {serviceName}
hi: उपयोग में: {serviceName}
it: Usando: {serviceName}
ja: 使用中：{serviceName}
pt: Usando: {serviceName}
zh: 使用：{serviceName}

# aiServiceLabel
source: AI Service:
ar: خدمة الذكاء الاصطناعي:
ca: Servei IA:
de: KI-Service:
el: Υπηρεσία AI:
es: Servicio de IA:
eu: AI Zerbitzua:
fr: Service IA :
gl: Servizo IA:
hi: AI सेवा:
it: Servizio IA:
ja: AIサービス：
pt: Serviço IA:
zh: AI服务：

# aiModelLabel
source: Model:
ar: النموذج:
de: Modell:
el: Μοντέλο:
es: Modelo:
eu: Modeloa:
fr: Modèle :
gl: Modelo:
hi: मॉडल:
it: Modello:
ja: モデル：
pt: Modelo:
zh: 模型：

# importQuestionsTitle
source: Import Questions
ar: استيراد الأسئلة
ca: Importar preguntes
de: Fragen importieren
el: Εισαγωγή Ερωτήσεων
es: Importar Preguntas
eu: Galderak Inportatu
fr: Importer des Questions
gl: Importar preguntas
hi: प्रश्न आयात करें
it: Importa domande
ja: 問題をインポート
pt: Importar perguntas
zh: 导入问题

# importQuestionsMessage
source: Found {count} questions in "{fileName}". Where would you like to import them?
ar: وجدت {count} أسئلة في "{fileName}". أين تريد استيرادها؟
ca: Trobades {count} preguntes a "{fileName}". On voleu importar-les?
de: {count} Fragen in "{fileName}" gefunden. Wo möchten Sie sie importieren?
el: Βρέθηκαν {count} ερωτήσεις στο "{fileName}". Πού θέλετε να τις εισάγετε;
es: Se encontraron {count} preguntas en "{fileName}". ¿Dónde te gustaría importarlas?
eu: {count} galdera aurkitu dira "{fileName}"-n. Non inportatu nahi dituzu?
fr: Trouvé {count} questions dans "{fileName}". Où souhaitez-vous les importer ?
gl: Atopadas {count} preguntas en "{fileName}". Onde queres importalas?
hi: "{fileName}" में {count} प्रश्न मिले। आप इन्हें कहाँ आयात करना चाहते हैं?
it: Trovate {count} domande in "{fileName}". Dove vuoi importarle?
ja: "{fileName}"に{count}個の問題が見つかりました。どこにインポートしますか？
pt: Encontradas {count} perguntas em "{fileName}". Onde você gostaria de importá-las?
zh: 在"{fileName}"中找到{count}个问题。您想将它们导入到哪里？

# importQuestionsPositionQuestion
source: Where would you like to add these questions?
ar: أين تريد إضافة هذه الأسئلة؟
ca: On voleu afegir aquestes preguntes?
de: Wo möchten Sie diese Fragen hinzufügen?
el: Πού θα θέλατε να προσθέσετε αυτές τις ερωτήσεις;
es: ¿Dónde te gustaría añadir estas preguntas?
eu: Non gehitu nahi dituzu galdera hauek?
fr: Où souhaitez-vous ajouter ces questions ?
gl: Onde queres engadir estas preguntas?
hi: आप इन प्रश्नों को कहाँ जोड़ना चाहते हैं?
it: Dove vuoi aggiungere queste domande?
ja: これらの問題をどこに追加しますか？
pt: Onde você gostaria de adicionar essas perguntas?
zh: 您想将这些问题添加到哪里？

# importAtBeginning
source: At Beginning
ar: في البداية
ca: Al principi
de: Am Anfang
el: Στην Αρχή
es: Al inicio
eu: Hasieran
fr: Au Début
gl: Ao principio
hi: शुरुआत में
it: All'inizio
ja: 最初
pt: No início
zh: 开头

# importAtEnd
source: At End
ar: في النهاية
ca: Al final
de: Am Ende
el: Στο Τέλος
es: Al final
eu: Amaieran
fr: À la Fin
gl: Ao final
hi: अंत में
it: Alla fine
ja: 最後
pt: No final
zh: 结尾

# questionsImportedSuccess
source: Successfully imported {count} questions
ar: تم استيراد {count} أسئلة بنجاح
ca: Importades amb èxit {count} preguntes
de: Erfolgreich {count} Fragen importiert
el: Εισήχθησαν επιτυχώς {count} ερωτήσεις
es: Se importaron exitosamente {count} preguntas
eu: {count} galdera arrakastaz inportatuta
fr: Importation réussie de {count} questions
gl: Importadas con éxito {count} preguntas
hi: सफलतापूर्वक {count} प्रश्न आयात किए गए
it: Importate con successo {count} domande
ja: {count}個の問題を正常にインポートしました
pt: Importadas com sucesso {count} perguntas
zh: 成功导入{count}个问题

# importQuestionsTooltip
source: Import questions from another quiz file
ar: استيراد أسئلة من ملف اختبار آخر
ca: Importar preguntes d'un altre fitxer quiz
de: Fragen aus einer anderen Quiz-Datei importieren
el: Εισαγωγή ερωτήσεων από άλλο αρχείο quiz
es: Importar preguntas desde otro archivo de quiz
eu: Beste quiz fitxategi batetik galderak inportatu
fr: Importer des questions depuis un autre fichier quiz
gl: Importar preguntas doutro ficheiro quiz
hi: दूसरी क्विज़ फ़ाइल से प्रश्न आयात करें
it: Importa domande da un altro file quiz
ja: 別のクイズファイルから問題をインポート
pt: Importar perguntas de outro arquivo quiz
zh: 从另一个测验文件导入问题

# dragDropHintText
source: You can also drag and drop .quiz files here to import questions
ar: يمكنك أيضاً سحب وإفلات ملفات .quiz هنا لاستيراد الأسئلة
ca: També podeu arrossegar i deixar anar fitxers .quiz aquí per importar preguntes
de: Sie können auch .quiz-Dateien hierher ziehen und ablegen, um Fragen zu importieren
el: Μπορείτε επίσης να σύρετε και να αποθέσετε αρχεία .quiz εδώ για εισαγωγή ερωτήσεων
es: También puedes arrastrar y soltar archivos .quiz aquí para importar preguntas
eu: Galderak inportatzeko .quiz fitxategiak hona arrastatu eta utz ditzakezu ere
fr: Vous pouvez aussi faire glisser et déposer des fichiers .quiz ici pour importer des questions
gl: Tamén podes arrastrar e soltar ficheiros .quiz aquí para importar preguntas
hi: प्रश्न आयात करने के लिए आप .quiz फ़ाइलों को यहाँ ड्रैग और ड्रॉप भी कर सकते हैं
it: Puoi anche trascinare e rilasciare file .quiz qui per importare domande
ja: 問題をインポートするために.quizファイルをここにドラッグ&ドロップすることもできます
pt: Você também pode arrastar e soltar arquivos .quiz aqui para importar perguntas
zh: 您也可以将.quiz文件拖拽到这里导入问题

# randomizeQuestionsTitle
source: Randomize Questions
ar: عشوائية الأسئلة
ca: Aleatoritzar preguntes
el: Τυχαία Σειρά Ερωτήσεων
es: Aleatorizar preguntas
eu: Galderak Ausazkotu
hi: प्रश्नों को मिलाएं
it: Randomizza domande
zh: 随机问题

# randomizeQuestionsDescription
source: Shuffle the order of questions during quiz execution
ar: خلط ترتيب الأسئلة أثناء تنفيذ الاختبار
ca: Barrejar l'ordre de les preguntes durant l'execució del quiz
el: Ανακάτεμα της σειράς των ερωτήσεων κατά την εκτέλεση του κουίζ
es: Mezclar el orden de las preguntas durante la ejecución del quiz
eu: Quiz exekuzioan galderen ordena nahastu
hi: क्विज़ निष्पादन के दौरान प्रश्नों का क्रम बदलें
it: Mescola l'ordine delle domande durante l'esecuzione del quiz
zh: 在测验执行期间打乱问题顺序

# randomizeQuestionsOffDescription
source: Questions will appear in their original order
ar: ستظهر الأسئلة بترتيبها الأصلي
ca: Les preguntes apareixeran en el seu ordre original
el: Οι ερωτήσεις θα εμφανίζονται στην αρχική τους σειρά
es: Las preguntas aparecerán en su orden original
eu: Galderak jatorrizko ordenan agertuko dira
hi: प्रश्न अपने मूल क्रम में दिखाई देंगे
it: Le domande appariranno nel loro ordine originale
zh: 问题将按其原始顺序出现

# randomizeAnswersTitle
source: Randomize Answers Order
ar: ترتيب عشوائي للإجابات
ca: Aleatoritzar l'ordre de les respostes
de: Antwortoptionen randomisieren
el: Τυχαία σειρά απαντήσεων
es: Aleatorizar el orden de las respuestas
eu: Erantzunen ordena ausazkotu
fr: Randomiser les Options de Réponse
gl: Aleatorizar opcións de resposta
hi: उत्तरों का क्रम यादृच्छिक करें
it: Randomizza opzioni di risposta
ja: 回答選択肢をランダム化
pt: Aleatorizar opções de resposta
zh: 随机化答案顺序

# randomizeAnswersDescription
source: Shuffle the order of answer options during quiz execution
ar: خلط ترتيب خيارات الإجابة أثناء تنفيذ الاختبار
ca: Barrejar l'ordre de les opcions de resposta durant l'execució del quiz
de: Reihenfolge der Antwortoptionen während der Quiz-Ausführung mischen
el: Ανακάτεμα της σειράς των επιλογών απάντησης κατά την εκτέλεση του κουίζ
es: Mezclar el orden de las opciones de respuesta durante la ejecución del quiz
eu: Quiz exekuzioan erantzun aukeren ordena nahastu
fr: Mélanger l'ordre des options de réponse pendant l'exécution du quiz
gl: Barallar a orde das opcións de resposta durante a execución do quiz
hi: क्विज़ निष्पादन के दौरान उत्तर विकल्पों का क्रम मिलाएं
it: Mescola l'ordine delle opzioni di risposta durante l'esecuzione del quiz
ja: クイズ実行中に回答選択肢の順序をシャッフル
pt: Embaralhar a ordem das opções de resposta durante a execução do quiz
zh: 在测验执行期间打乱答案选项的顺序

# showCorrectAnswerCountTitle
source: Show Correct Answer Count
ar: إظهار عدد الإجابات الصحيحة
ca: Mostrar nombre de respostes correctes
de: Anzahl richtiger Antworten anzeigen
el: Εμφάνιση Αριθμού Σωστών Απαντήσεων
es: Mostrar número de respuestas correctas
eu: Erantzun Zuzen Kopurua Erakutsi
fr: Afficher le Nombre de Réponses Correctes
gl: Mostrar número de respostas correctas
hi: सही उत्तर संख्या दिखाएं
it: Mostra numero risposte corrette
ja: 正解数を表示
pt: Mostrar número de respostas corretas
zh: 显示正确答案数量

# showCorrectAnswerCountDescription
source: Display the number of correct answers in multiple choice questions
ar: عرض عدد الإجابات الصحيحة في أسئلة الاختيار المتعدد
ca: Mostrar el nombre de respostes correctes en preguntes d'elecció múltiple
de: Anzahl der richtigen Antworten in Mehrfachauswahl-Fragen anzeigen
el: Εμφάνιση του αριθμού των σωστών απαντήσεων σε ερωτήσεις πολλαπλής επιλογής
es: Mostrar el número de respuestas correctas en preguntas de opción múltiple
eu: Erantzun zuzenen kopurua erakutsi aukera anitzeko galderetan
fr: Afficher le nombre de réponses correctes dans les questions à choix multiple
gl: Mostrar o número de respostas correctas en preguntas de elección múltiple
hi: बहुविकल्पीय प्रश्नों में सही उत्तरों की संख्या प्रदर्शित करें
it: Visualizza il numero di risposte corrette nelle domande a scelta multipla
ja: 複数選択問題で正解の数を表示
pt: Exibir o número de respostas corretas em perguntas de múltipla escolha
zh: 在多选题中显示正确答案的数量

# showCorrectAnswerCountOffDescription
source: The number of correct answers will not be shown for multiple-choice questions
ar: لن يتم عرض عدد الإجابات الصحيحة لأسئلة الاختيار من متعدد
ca: El nombre de respostes correctes no es mostrarà en les preguntes d'opció múltiple
el: Ο αριθμός των σωστών απαντήσεων δεν θα εμφανίζεται για ερωτήσεις πολλαπλής επιλογής
es: No se mostrará el número de respuestas correctas en las preguntas de opción múltiple
eu: Aukera anitzeko galderetan ez da erantzun zuzenen kopurua erakutsiko
hi: बहुविकल्पीय प्रश्नों के लिए सही उत्तरों की संख्या नहीं दिखाई जाएगी
it: Il numero di risposte corrette non verrà mostrato per le domande a scelta multipla
zh: 多选题将不显示正确答案的数量

# correctAnswersCount
source: Select {count} correct answers
ar: اختر {count} إجابات صحيحة
ca: Seleccioneu {count} respostes correctes
de: Wählen Sie {count} richtige Antworten
el: Επιλέξτε {count} σωστές απαντήσεις
es: Selecciona {count} respuestas correctas
eu: Hautatu {count} erantzun zuzen
fr: Sélectionnez {count} réponses correctes
gl: Selecciona {count} respostas correctas
hi: {count} सही उत्तर चुनें
it: Seleziona {count} risposte corrette
ja: {count}つの正解を選択
pt: Selecione {count} respostas corretas
zh: 选择{count}个正确答案

# correctSelectedLabel
source: Correct
ar: صحيح
ca: Correcte
de: Richtig
el: Σωστό
es: Correcta
eu: Zuzena
gl: Correcta
hi: सही
it: Corretto
ja: 正解
pt: Correto
zh: 正确

# correctMissedLabel
source: Correct
ar: صحيح
ca: Correcte
de: Richtig
el: Σωστό
es: Correcta
eu: Zuzena
gl: Correcta
hi: सही
it: Corretto
ja: 正解
pt: Correto
zh: 正确

# incorrectSelectedLabel
source: Incorrect
ar: خطأ
ca: Incorrecte
de: Falsch
el: Λάθος
es: Incorrecta
eu: Okerra
gl: Incorrecta
hi: गलत
it: Errato
ja: 不正解
pt: Incorreto
zh: 错误

# aiGenerateDialogTitle
source: Generate Questions with AI
ar: إنتاج أسئلة بالذكاء الاصطناعي
ca: Generar preguntes amb IA
de: Fragen mit KI generieren
el: Δημιουργία Ερωτήσεων με AI
es: Generar preguntas con IA
eu: AI-rekin Galderak Sortu
fr: Générer des Questions avec l'IA
gl: Xerar preguntas con IA
hi: AI के साथ प्रश्न बनाएं
it: Genera domande con IA
ja: AIで問題を生成
pt: Gerar perguntas com IA
zh: 使用AI生成问题

# aiQuestionCountLabel
source: Number of Questions (Optional)
ar: عدد الأسئلة (اختياري)
ca: Nombre de preguntes (Opcional)
de: Anzahl der Fragen (Optional)
el: Αριθμός Ερωτήσεων (Προαιρετικό)
es: Número de preguntas (Opcional)
eu: Galdera Kopurua (Aukerakoa)
fr: Nombre de Questions (Optionnel)
gl: Número de preguntas (Opcional)
hi: प्रश्नों की संख्या (वैकल्पिक)
it: Numero di domande (Opzionale)
ja: 問題数（任意）
pt: Número de perguntas (Opcional)
zh: 问题数量（可选）

# aiQuestionCountHint
source: Leave empty for AI to decide
ar: اتركه فارغاً ليقرر الذكاء الاصطناعي
ca: Deixeu buit perquè la IA decideixi
de: Leer lassen, damit KI entscheidet
el: Αφήστε κενό για να αποφασίσει το AI
es: Déjalo vacío para que la IA decida
eu: Utzi hutsik AI-ak erabaki dezan
fr: Laisser vide pour laisser l'IA décider
gl: Deixa baleiro para que a IA decida
hi: AI को निर्णय लेने के लिए खाली छोड़ें
it: Lascia vuoto per far decidere all'IA
ja: AIに決めさせる場合は空白のままにしてください
pt: Deixe vazio para a IA decidir
zh: 留空让AI决定

# aiQuestionCountValidation
source: Must be a number between 1 and 50
ar: يجب أن يكون رقماً بين 1 و 50
ca: Ha de ser un número entre 1 i 50
de: Muss eine Zahl zwischen 1 und 50 sein
el: Πρέπει να είναι αριθμός μεταξύ 1 και 50
es: Debe ser un número entre 1 y 50
eu: 1 eta 50 arteko zenbakia izan behar da
fr: Doit être un nombre entre 1 et 50
gl: Debe ser un número entre 1 e 50
hi: 1 से 50 के बीच संख्या होनी चाहिए
it: Deve essere un numero tra 1 e 50
ja: 1から50までの数字である必要があります
pt: Deve ser um número entre 1 e 50
zh: 必须是1到50之间的数字

# aiQuestionTypeLabel
source: Question Type
ar: نوع السؤال
ca: Tipus de pregunta
de: Fragentyp
el: Τύπος Ερώτησης
es: Tipo de preguntas
eu: Galdera Mota
fr: Type de Question
gl: Tipo de pregunta
hi: प्रश्न प्रकार
it: Tipo di domanda
ja: 問題の種類
pt: Tipo de pergunta
zh: 问题类型

# aiQuestionTypeRandom
source: Random (Mixed)
ar: عشوائي (مختلط)
ca: Aleatori (Mixt)
de: Zufällig (Gemischt)
el: Τυχαίο (Μικτό)
es: Aleatorio (Mezcla)
eu: Ausazkoa (Mistoa)
fr: Aléatoire (Mixte)
gl: Aleatorio (Mixto)
hi: यादृच्छिक (मिश्रित)
it: Casuale (Misto)
ja: ランダム（混合）
pt: Aleatório (Misto)
zh: 随机（混合）

# aiLanguageLabel
source: Question Language
ar: لغة الأسئلة
ca: Idioma de les preguntes
de: Fragensprache
el: Γλώσσα Ερώτησης
es: Idioma de las preguntas
eu: Galderen Hizkuntza
fr: Langue des Questions
gl: Idioma das preguntas
hi: प्रश्न भाषा
it: Lingua domande
ja: 問題の言語
pt: Idioma das perguntas
zh: 问题语言

# aiContentLabel
source: Content to generate questions from
ar: المحتوى لإنتاج الأسئلة منه
ca: Contingut per generar preguntes
de: Inhalt für die Fragengenerierung
el: Περιεχόμενο για δημιουργία ερωτήσεων
es: Contenido para generar preguntas
eu: Galderak sortzeko edukia
fr: Contenu pour générer des questions
gl: Contido para xerar preguntas
hi: प्रश्न बनाने के लिए सामग्री
it: Contenuto per generare domande
ja: 問題生成元のコンテンツ
pt: Conteúdo para gerar perguntas
zh: 生成问题的内容

# aiWordCount
source: {current} / {max} words
ar: {current} / {max} كلمة
ca: {current} / {max} paraules
de: {current} / {max} Wörter
el: {current} / {max} λέξεις
es: {current} / {max} palabras
eu: {current} / {max} hitz
fr: {current} / {max} mots
gl: {current} / {max} palabras
hi: {current} / {max} शब्द
it: {current} / {max} parole
ja: {current} / {max} 語
pt: {current} / {max} palavras
zh: {current} / {max} 词

# aiContentHint
source: Enter the text, topic, or content from which you want to generate questions...
ar: أدخل النص أو الموضوع أو المحتوى الذي تريد إنتاج أسئلة منه...
ca: Introduïu el text, tema, o contingut a partir del qual voleu generar preguntes...
de: Geben Sie den Text, das Thema oder den Inhalt ein, aus dem Sie Fragen generieren möchten...
el: Εισάγετε το κείμενο, θέμα ή περιεχόμενο από το οποίο θέλετε να δημιουργήσετε ερωτήσεις...
es: Introduce el texto, tema o contenido del cual quieres generar preguntas...
eu: Sartu testua, gaia, edo edukia zeinetatik galderak sortu nahi dituzun...
fr: Entrez le texte, sujet, ou contenu à partir duquel vous voulez générer des questions...
gl: Introduce o texto, tema, ou contido a partir do cal queres xerar preguntas...
hi: वह पाठ, विषय या सामग्री दर्ज करें जिससे आप प्रश्न बनाना चाहते हैं...
it: Inserisci il testo, argomento, o contenuto da cui vuoi generare domande...
ja: 問題を生成したいテキスト、トピック、またはコンテンツを入力してください...
pt: Digite o texto, tópico, ou conteúdo a partir do qual deseja gerar perguntas...
zh: 输入您想生成问题的文本、主题或内容...

# aiContentHelperText
source: AI will create questions based on this content
ar: سينشئ الذكاء الاصطناعي أسئلة بناءً على هذا المحتوى
ca: La IA crearà preguntes basades en aquest contingut
de: KI wird basierend auf diesem Inhalt Fragen erstellen
el: Το AI θα δημιουργήσει ερωτήσεις με βάση αυτό το περιεχόμενο
es: La IA creará preguntas basadas en este contenido
eu: AI-ak eduki honen oinarrian galderak sortuko ditu
fr: L'IA créera des questions basées sur ce contenu
gl: A IA creará preguntas baseadas neste contido
hi: AI इस सामग्री के आधार पर प्रश्न बनाएगा
it: L'IA creerà domande basate su questo contenuto
ja: AIはこのコンテンツに基づいて問題を作成します
pt: IA criará perguntas baseadas neste conteúdo
zh: AI将基于此内容创建问题

# aiWordLimitError
source: You have exceeded the limit of {max} words
ar: لقد تجاوزت حد {max} كلمة
ca: Heu excedit el límit de {max} paraules
de: Sie haben das Limit von {max} Wörtern überschritten
el: Έχετε υπερβεί το όριο των {max} λέξεων
es: Has superado el límite de {max} palabras
eu: {max} hitzen muga gainditu duzu
fr: Vous avez dépassé la limite de {max} mots
gl: Superaches o límite de {max} palabras
hi: आपने {max} शब्दों की सीमा पार कर दी है
it: Hai superato il limite di {max} parole
ja: {max}語の制限を超えています
pt: Você excedeu o limite de {max} palavras
zh: 您已超过{max}词的限制

# aiContentRequiredError
source: You must provide content to generate questions
ar: يجب أن تقدم محتوى لإنتاج الأسئلة
ca: Heu de proporcionar contingut per generar preguntes
de: Sie müssen Inhalt bereitstellen, um Fragen zu generieren
el: Πρέπει να παρέχετε περιεχόμενο για τη δημιουργία ερωτήσεων
es: Debes proporcionar contenido para generar las preguntas
eu: Galderak sortzeko edukia eman behar duzu
fr: Vous devez fournir du contenu pour générer des questions
gl: Debes proporcionar contido para xerar preguntas
hi: प्रश्न बनाने के लिए आपको सामग्री प्रदान करनी होगी
it: Devi fornire contenuto per generare domande
ja: 問題を生成するためにコンテンツを提供する必要があります
pt: Você deve fornecer conteúdo para gerar perguntas
zh: 您必须提供内容来生成问题
