Repository: vicajilau/quizlab_ai
Catalog: lib/core/l10n/app_*.arb
Languages: ar, ca, de, el, es, eu, fr, gl, hi, it, ja, pt, zh

# aiContentLimitError
source: Content exceeds the limit of {max} words
ar: المحتوى يتجاوز حد {max} كلمة
ca: El contingut supera el límit de {max} paraules
de: Inhalt überschreitet das Limit von {max} Wörtern
el: Το περιεχόμενο υπερβαίνει το όριο των {max} λέξεων
es: El contenido supera el límite de {max} palabras
eu: Edukiak {max} hitzen muga gainditzen du
fr: Le contenu dépasse la limite de {max} mots
gl: O contido supera o límite de {max} palabras
hi: सामग्री {max} शब्दों की सीमा से अधिक है
it: Il contenuto supera il limite di {max} parole
ja: コンテンツが{max}語の制限を超えています
pt: Conteúdo excede o limite de {max} palavras
zh: 内容超过{max}词限制

# aiMinWordsError
source: Provide at least 10 words to generate quality questions
ar: قدم 10 كلمات على الأقل لإنتاج أسئلة عالية الجودة
ca: Proporcioneu almenys 10 paraules per generar preguntes de qualitat
de: Geben Sie mindestens 10 Wörter an, um qualitativ hochwertige Fragen zu generieren
el: Παρέχετε τουλάχιστον 10 λέξεις για τη δημιουργία ποιοτικών ερωτήσεων
es: Proporciona al menos 10 palabras para generar preguntas de calidad
eu: Kalitatezkoak galderak sortzeko gutxienez 10 hitz eman
fr: Fournissez au moins 10 mots pour générer des questions de qualité
gl: Proporciona polo menos 10 palabras para xerar preguntas de calidade
hi: गुणवत्तापूर्ण प्रश्न बनाने के लिए कम से कम 10 शब्द प्रदान करें
it: Fornisci almeno 10 parole per generare domande di qualità
ja: 質の高い問題を生成するために少なくとも10語を提供してください
pt: Forneça pelo menos 10 palavras para gerar perguntas de qualidade
zh: 至少提供10个词以生成高质量问题

# aiInfoTitle
source: Information
ar: معلومات
ca: Informació
el: Πληροφορίες
es: Información
eu: Informazioa
gl: Información
hi: जानकारी
it: Informazioni
ja: 情報
pt: Informação
zh: 信息

# aiInfoDescription
source: • AI will analyze the content and generate relevant questions • If you write fewer than 10 words, you'll enter Topic mode where questions will be asked about those specific topics • With more than 10 words, you'll enter Content mode which will ask questions about that same text (more words = more precision) • You can include text, definitions, explanations, or any educational material\n• Questions will include answer options and explanations\n• The process may take a few seconds
ar: • سيحلل الذكاء الاصطناعي المحتوى وينتج أسئلة ذات صلة • إذا كتبت أقل من 10 كلمات، فستدخل في وضع الموضوع حيث سيطرح أسئلة حول تلك المواضيع المحددة • مع أكثر من 10 كلمات ستدخل في وضع المحتوى الذي سيطرح أسئلة حول النص نفسه (مزيد من الكلمات = مزيد من الدقة) • يمكنك تضمين نصوص وتعريفات وشروحات أو أي مادة تعليمية • ستتضمن الأسئلة خيارات إجابة وشروحات • قد تستغرق العملية بضع ثوانٍ
ca: • La IA analitzarà el contingut i generarà preguntes rellevants • Si escrius menys de 10 paraules entraràs en modo Tema on es realitzaran preguntes sobre aquests temes específics • Amb més de 10 paraules entraràs en modo Contingut que farà preguntes sobre el mateix text (més paraules = més precisió) • Podeu incloure text, definicions, explicacions, o qualseval material educatiu • Les preguntes inclouran opcions de resposta i explicacions • El procés pot trigar uns segons
de: • KI wird den Inhalt analysieren und relevante Fragen generieren • Wenn du weniger als 10 Wörter schreibst, gelangst du in den Themenmodus, in dem Fragen zu diesen spezifischen Themen gestellt werden • Mit mehr als 10 Wörtern gelangst du in den Inhaltsmodus, in dem Fragen zu demselben Text gestellt werden (mehr Wörter = mehr Präzision) • Du kannst Text, Definitionen, Erklärungen oder beliebiges Lernmaterial einschließen • Fragen werden Antwortoptionen und Erklärungen beinhalten • Der Vorgang kann einige Sekunden dauern
el: • Το AI θα αναλύσει το περιεχόμενο και θα δημιουργήσει σχετικές ερωτήσεις • Εάν γράψεις λιγότερες από 10 λέξεις, θα μπεις στη λειτουργία Θέμα όπου θα γίνουν ερωτήσεις για αυτά τα συγκεκριμένα θέματα • Με περισσότερες από 10 λέξεις, θα μπεις στη λειτουργία Περιεχόμενο που θα κάνει ερωτήσεις για το ίδιο κείμενο (περισσότερες λέξεις = μεγαλύτερη ακρίβεια) • Μπορείτε να συμπεριλάβετε κείμενο, ορισμούς, εξηγήσεις ή οποιοδήποτε εκπαιδευτικό υλικό • Οι ερωτήσεις θα περιλαμβάνουν επιλογές απάντησης και εξηγήσεις • Η διαδικασία μπορεί να διαρκέσει μερικά δευτερόλεπτα
es: • La IA analizará el contenido y generará preguntas relevantes • Si escribes menos de 10 palabras entrarás en modo Tema donde se realizarán preguntas sobre esos temas específicos • Con más de 10 palabras entrarás en modo Contenido que hará preguntas sobre ese mismo texto (más palabras = más precisión) • Puedes incluir texto, definiciones, explicaciones o cualquier material educativo • Las preguntas incluirán opciones de respuesta y explicaciones • El proceso puede tardar unos segundos
eu: • AI-ak edukia aztertuko du eta galdera garrantzitsuak sortuko ditu • 10 hitz baino gutxiago idazten badituzu, Gai moduan sartuko zara eta gai zehatz horiei buruzko galderak egingo ditu • 10 hitz baino gehiagorekin, Eduki moduan sartuko zara eta testu berari buruzko galderak egingo ditu (hitz gehiago = doitasun handiagoa) • Testua, definizioak, azalpenak, edo edozein hezkuntza material sar dezakezu • Galderek erantzun aukerak eta azalpenak izango dituzte • Prozesuak segundo batzuk har ditzake
fr: • L'IA analysera le contenu et générera des questions pertinentes • Si tu écris moins de 10 mots, tu entreras en mode Thème où des questions sur ces sujets spécifiques seront posées • Avec plus de 10 mots, tu entreras en mode Contenu qui posera des questions sur ce même texte (plus de mots = plus de précision) • Tu peux inclure du texte, des définitions, des explications, ou tout matériel éducatif • Les questions incluront des options de réponse et des explications • Le processus peut prendre quelques secondes
gl: • A IA analizará o contido e xerará preguntas relevantes • Se escribes menos de 10 palabras entrarás no modo Tema onde se farán preguntas sobre eses temas específicos • Con máis de 10 palabras entrarás no modo Contido que fará preguntas sobre ese mesmo texto (máis palabras = máis precisión) • Podes incluír testo, definicións, explicacións, o calquera material educativo • As preguntas incluirán opcións de resposta e explicacións • O proceso pode tardar uns segundos
hi: • AI सामग्री का विश्लेषण करके प्रासंगिक प्रश्न बनाएगा • यदि तुम 10 से कम शब्द लिखते हो, तो यह 'विषय' (Topic) मोड में चला जाएगा जहाँ उन विशिष्ट विषयों के बारे में प्रश्न पूछे जाएंगे • 10 से अधिक शब्दों के साथ, यह 'सामग्री' (Content) मोड में चला जाएगा जो उसी पाठ के बारे में प्रश्न पूछेगा (अधिक शब्द = अधिक सटीकता) • तुम पाठ, परिभाषाएं, स्पष्टीकरण या कोई भी शैक्षिक सामग्री शामिल कर सकते हो • प्रश्नों में उत्तर विकल्प और स्पष्टीकरण शामिल होंगे • इस प्रक्रिया में कुछ सेकंड लग सकते हैं
it: • L'IA analizzerà il contenuto e genererà domande pertinenti • Se scrivi meno di 10 parole entrerai in modalità Argomento dove verranno fatte domande su quei temi specifici • Con più di 10 parole entrerai in modalità Contenuto che farà domande sullo stesso testo (più parole = più precisione) • Puoi includere testo, definizioni, spiegazioni, o qualsiasi materiale educativo • Le domande includeranno opzioni di risposta e spiegazioni • Il processo può richiedere alcuni secondi
ja: • AIがコンテンツを分析して関連する問題を生成します • 10語未満であれば「トピックモード」になり、特定のテーマについて質問します • 10語以上であれば「コンテンツモード」になり、入力されたテキストに基づいて質問します（単語数が多いほど、精度が高まります） • テキスト、定義、説明、または任意の教育材料を含めることができます • 問題には回答選択肢と解説が含まれます • 処理には数秒かかる場合があります
pt: • IA analisará o conteúdo e gerará perguntas relevantes • Se escreveres menos de 10 palavras entrarás no modo Tema, onde serão feitas perguntas sobre esses temas específicos • Com mais de 10 palavras entrarás no modo Conteúdo, que fará perguntas sobre o mesmo texto (mais palavras = mais precisão) • Você pode incluir texto, definições, explicações, o qualquer material educativo • Perguntas incluirão opções de resposta e explicações • O processo pode levar alguns segundos
zh: • AI将分析内容并生成相关问题 • 如果你输入的字数少于10个词，将进入“主题模式”，针对特定话题进行提问 • 字数超过10个词，将进入“内容模式”，针对你提供的文本进行提问（字数越多 = 精确度越高） • 你可以包含文本、定义、解释或任何教育材料 • 问题将包括答案选项和解释 • 该过程可能需要几秒钟

# aiGenerateButton
source: Generate Questions
ar: إنتاج الأسئلة
ca: Generar Preguntes
de: Fragen generieren
el: Δημιουργία Ερωτήσεων
es: Generar preguntas
eu: Galderak Sortu
fr: Générer des Questions
gl: Xerar Preguntas
hi: प्रश्न बनाएं
it: Genera Domande
ja: 問題を生成
pt: Gerar Perguntas
zh: 生成问题

# languageSpanish
source: Español
el: Ισπανικά

# languageEnglish
source: English
el: Αγγλικά

# languageFrench
source: Français
el: Γαλλικά

# languageGerman
source: Deutsch
el: Γερμανικά

# languageItalian
source: Italiano
el: Ιταλικά

# languagePortuguese
source: Português
el: Πορτογαλικά

# languageCatalan
source: Català
el: Καταλανικά

# languageBasque
source: Euskera
el: Βασκικά

# languageGalician
source: Galego
el: Γαλικιανά

# languageHindi
source: हिन्दी
el: Χίντι

# languageChinese
source: 中文
el: Κινεζικά

# languageArabic
source: العربية
el: Αραβικά

# languageJapanese
source: 日本語
el: Ιαπωνικά

# aiServicesLoading
source: Loading AI services...
ar: جاري تحميل خدمات الذكاء الاصطناعي...
ca: Carregant serveis IA...
de: KI-Services werden geladen...
el: Φόρτωση υπηρεσιών AI...
es: Cargando servicios de IA...
eu: AI zerbitzuak kargatzen...
fr: Chargement des services IA...
gl: Cargando servizos IA...
hi: AI सेवाएं लोड हो रही हैं...
it: Caricamento servizi IA...
ja: AIサービスを読み込み中...
pt: Carregando serviços IA...
zh: 正在加载AI服务...

# aiServicesNotConfigured
source: No AI services configured
ar: لم يتم تكوين خدمات الذكاء الاصطناعي
ca: Cap servei IA configurat
de: Keine KI-Services konfiguriert
el: Δεν έχουν ρυθμιστεί υπηρεσίες AI
es: No hay servicios de IA configurados
eu: Ez da AI zerbitzurik konfiguratu
fr: Aucun service IA configuré
gl: Non hai servizos IA configurados
hi: कोई AI सेवा कॉन्फ़िगर नहीं की गई
it: Nessun servizio IA configurato
ja: AIサービスが設定されていません
pt: Nenhum serviço IA configurado
zh: 未配置AI服务

# aiGeneratedQuestions
source: AI Generated
ar: منتج بالذكاء الاصطناعي
ca: Generat per IA
de: KI-generiert
el: Δημιουργήθηκε από AI
es: IA Generadas
eu: AI-ak sortutakoak
fr: Généré par IA
gl: Xerado por IA
hi: AI द्वारा बनाए गए
it: Generato da IA
ja: AI生成
pt: Gerado por IA
zh: AI生成

# aiApiKeyRequired
source: Please configure at least one AI API key in Settings to use AI generation.
ar: يرجى تكوين مفتاح API واحد على الأقل للذكاء الاصطناعي في الإعدادات لاستخدام الإنتاج بالذكاء الاصطناعي.
ca: Configureu almenys una clau API IA a la Configuració per usar generació IA.
de: Bitte konfigurieren Sie mindestens einen KI-API-Schlüssel in den Einstellungen, um KI-Generierung zu verwenden.
el: Παρακαλώ ρυθμίστε τουλάχιστον ένα κλειδί API AI στις Ρυθμίσεις για να χρησιμοποιήσετε τη δημιουργία AI.
es: Por favor, configura al menos una clave API de IA en Ajustes para usar la generación con IA.
eu: Konfiguratu gutxienez AI API gako bat Ezarpenetan AI sorkuntza erabiltzeko.
fr: Veuillez configurer au moins une clé API IA dans les Paramètres pour utiliser la génération IA.
gl: Configura polo menos unha clave API IA na Configuración para usar xeración IA.
hi: AI जेनरेशन का उपयोग करने के लिए कृपया सेटिंग्स में कम से कम एक AI API key कॉन्फ़िगर करें।
it: Configura almeno una chiave API IA nelle Impostazioni per usare la generazione IA.
ja: AI生成を使用するには、設定で少なくとも1つのAI APIキーを設定してください。
pt: Configure pelo menos uma chave API IA nas Configurações para usar geração IA.
zh: 请在设置中配置至少一个AI API密钥以使用AI生成。

# aiGenerationFailed
source: Could not generate questions. Try with different content.
ar: لم أتمكن من إنتاج الأسئلة. جرب بمحتوى مختلف.
ca: No s'han pogut generar preguntes. Proveu amb contingut diferent.
de: Fragen konnten nicht generiert werden. Versuchen Sie es mit anderem Inhalt.
el: Αδυναμία δημιουργίας ερωτήσεων. Δοκιμάστε με διαφορετικό περιεχόμενο.
es: No se pudieron generar preguntas. Intenta con un contenido diferente.
eu: Ezin izan dira galderak sortu. Saiatu eduki ezberdinarekin.
fr: Impossible de générer des questions. Essayez avec un contenu différent.
gl: Non se puideron xerar preguntas. Proba con contido diferente.
hi: प्रश्न नहीं बना सके। अलग सामग्री के साथ प्रयास करें।
it: Impossibile generare domande. Prova con contenuto diverso.
ja: 問題を生成できませんでした。異なるコンテンツで試してください。
pt: Não foi possível gerar perguntas. Tente com conteúdo diferente.
zh: 无法生成问题。请尝试不同的内容。

# aiGenerationErrorTitle
source: Error generating questions
ar: خطأ في إنتاج الأسئلة
ca: Error en generar preguntes
de: Fehler beim Generieren von Fragen
el: Σφάλμα δημιουργίας ερωτήσεων
es: Error al generar preguntas
eu: Errorea galderak sortzean
fr: Erreur de génération de questions
gl: Erro xerando preguntas
hi: प्रश्न बनाने में त्रुटि
it: Errore nella generazione domande
ja: 問題生成エラー
pt: Erro ao gerar perguntas
zh: 生成问题时出错

# noQuestionsInFile
source: No questions found in the imported file
ar: لم توجد أسئلة في الملف المستورد
ca: Cap pregunta trobada al fitxer importat
de: Keine Fragen in der importierten Datei gefunden
el: Δεν βρέθηκαν ερωτήσεις στο εισαγόμενο αρχείο
es: No se encontraron preguntas en el archivo importado
eu: Ez da galderarik aurkitu inportatutako fitxategian
fr: Aucune question trouvée dans le fichier importé
gl: Non se atoparon preguntas no ficheiro importado
hi: आयातित फ़ाइल में कोई प्रश्न नहीं मिले
it: Nessuna domanda trovata nel file importato
ja: インポートされたファイルに問題が見つかりませんでした
pt: Nenhuma pergunta encontrada no arquivo importado
zh: 导入的文件中未找到问题

# couldNotAccessFile
source: Could not access the selected file
ar: لا يمكن الوصول إلى الملف المحدد
ca: No s'ha pogut accedir al fitxer seleccionat
de: Zugriff auf die ausgewählte Datei nicht möglich
el: Αδυναμία πρόσβασης στο επιλεγμένο αρχείο
es: No se pudo acceder al archivo seleccionado
eu: Ezin izan da hautatutako fitxategira sartu
fr: Impossible d'accéder au fichier sélectionné
gl: Non se puido acceder ao ficheiro seleccionado
hi: चयनित फ़ाइल तक पहुंच नहीं सकी
it: Impossibile accedere al file selezionato
ja: 選択されたファイルにアクセスできませんでした
pt: Não foi possível acessar o arquivo selecionado
zh: 无法访问所选文件

source: Generate questions with AI
ar: إنتاج أسئلة بالذكاء الاصطناعي
ca: Generar preguntes amb IA
de: Fragen mit KI generieren
el: Δημιουργία ερωτήσεων με AI
es: Generar preguntas con IA
eu: AI-rekin galderak sortu
fr: Générer des questions avec l'IA
gl: Xerar preguntas con IA
hi: AI के साथ प्रश्न बनाएं
it: Genera domande con IA
ja: AIで問題を生成
pt: Gerar perguntas com IA
zh: 使用AI生成问题

source: Add questions with AI
ar: إضافة أسئلة باستخدام الذكاء الاصطناعي
ca: Afegir preguntes amb IA
de: Fragen mit KI hinzufügen
el: Προσθήκη ερωτήσεων με AI
es: Añadir preguntas con IA
eu: Gehitu galderak AI bidez
fr: Ajouter des questions avec l'IA
gl: Engadir preguntas con IA
hi: AI के साथ प्रश्न जोड़ें
it: Aggiungi domande con l'IA
ja: AIで質問を追加
pt: Adicionar perguntas com IA
zh: 使用 AI 添加问题

# aiServiceLimitsWithChars
source: Limit: {words} words or {chars} characters
ar: الحد: {words} كلمة أو {chars} حرف
ca: Límit: {words} paraules o {chars} caràcters
de: Limit: {words} Wörter oder {chars} Zeichen
el: Όριο: {words} λέξεις ή {chars} χαρακτήρες
es: Límite: {words} palabras o {chars} caracteres
eu: Muga: {words} hitz edo {chars} karaktere
fr: Limite : {words} mots ou {chars} caractères
gl: Límite: {words} palabras ou {chars} caracteres
hi: सीमा: {words} शब्द या {chars} अक्षर
it: Limite: {words} parole o {chars} caratteri
ja: 制限：{words}語または{chars}文字
pt: Limite: {words} palavras ou {chars} caracteres
zh: 限制：{words}词或{chars}字符

# aiServiceLimitsWordsOnly
source: Limit: {words} words
ar: الحد: {words} كلمة
ca: Límit: {words} paraules
de: Limit: {words} Wörter
el: Όριο: {words} λέξεις
es: Límite: {words} palabras
eu: Muga: {words} hitz
fr: Limite : {words} mots
gl: Límite: {words} palabras
hi: सीमा: {words} शब्द
it: Limite: {words} parole
ja: 制限：{words}語
pt: Limite: {words} palavras
zh: 限制：{words}词

source: AI Assistant Disabled
ar: مساعد الذكاء الاصطناعي معطل
ca: Assistent d'IA Deshabilitat
de: KI-Assistent Deaktiviert
el: Βοηθός AI Απενεργοποιημένος
es: Asistente de IA Deshabilitado
eu: AI Laguntzailea Desgaituta
fr: Assistant IA Désactivé
gl: Asistente de IA Deshabilitado
hi: AI सहायक अक्षम
it: Assistente IA Disabilitato
ja: AI学習アシスタントが無効
pt: Assistente IA Desabilitado
zh: AI助手已禁用

# enableAiAssistant
source: The AI assistant is disabled. Please enable it in settings to use AI features.
ar: مساعد الذكاء الاصطناعي معطل. يرجى تفعيله في الإعدادات لاستخدام ميزات الذكاء الاصطناعي.
ca: L'assistent d'IA està desactivat. Si us plau, activa'l a la configuració per utilitzar les funcions d'IA.
de: KI-Assistent ist deaktiviert. Bitte aktivieren Sie ihn in den Einstellungen, um KI-Funktionen zu nutzen.
el: Ο βοηθός AI είναι απενεργοποιημένος. Παρακαλώ ενεργοποιήστε τον στις ρυθμίσεις για να χρησιμοποιήσετε τις λειτουργίες AI.
es: El asistente de IA está deshabilitado. Por favor, actívalo en la configuración para usar las funciones de IA.
eu: AI laguntzailea desgaituta dago. Mesedez, gaitu ezazu konfigurazioan AI funtzioak erabiltzeko.
fr: L'assistant IA est désactivé. Veuillez l'activer dans les paramètres pour utiliser les fonctionnalités IA.
gl: O asistente de IA está deshabilitado. Actívao na configuración para usar as funcionalidades de IA.
hi: AI सहायक अक्षम है। AI सुविधाओं का उपयोग करने के लिए कृपया इसे सेटिंग्स में सक्षम करें।
it: L'assistente IA è disabilitato. Si prega di abilitarlo nelle impostazioni per utilizzare le funzionalità IA.
ja: AIアシスタントが無効になっています。AI機能を使用するために設定で有効にしてください。
pt: O assistente de IA está desabilitado. Por favor, habilite-o nas configurações para usar recursos de IA.
zh: AI助手已禁用。请在设置中启用它以使用AI功能。

# aiMinWordsRequired
source: Minimum {minWords} words required
ar: مطلوب الحد الأدنى {minWords} كلمة
ca: Mínim {minWords} paraules necessàries
de: Mindestens {minWords} Wörter erforderlich
el: Απαιτούνται τουλάχιστον {minWords} λέξεις
es: Mínimo {minWords} palabras requeridas
eu: Gutxienez {minWords} hitz behar dira
fr: Minimum {minWords} mots requis
gl: Mínimo {minWords} palabras necesarias
hi: न्यूनतम {minWords} शब्द आवश्यक
it: Minimo {minWords} parole richieste
ja: 最低{minWords}語が必要です
pt: Mínimo de {minWords} palavras necessárias
zh: 需要至少{minWords}个单词

# aiWordsReadyToGenerate
source: {wordCount} words ✓ Ready to generate
ar: {wordCount} كلمة ✓ جاهز للتوليد
ca: {wordCount} paraules ✓ Llest per generar
de: {wordCount} Wörter ✓ Bereit zu generieren
el: {wordCount} λέξεις ✓ Έτοιμο για δημιουργία
es: {wordCount} palabras ✓ Listo para generar
eu: {wordCount} hitz ✓ Sortzeko prest
fr: {wordCount} mots ✓ Prêt à générer
gl: {wordCount} palabras ✓ Listo para xerar
hi: {wordCount} शब्द ✓ उत्पन्न करने के लिए तैयार
it: {wordCount} parole ✓ Pronto a generare
ja: {wordCount}語 ✓ 生成準備完了
pt: {wordCount} palavras ✓ Pronto para gerar
zh: {wordCount}个单词 ✓ 准备生成

# aiWordsProgress
source: {currentWords}/{minWords} words ({moreNeeded} more needed)
ar: {currentWords}/{minWords} كلمة (نحتاج {moreNeeded} أكثر)
ca: {currentWords}/{minWords} paraules ({moreNeeded} més necessàries)
de: {currentWords}/{minWords} Wörter ({moreNeeded} weitere benötigt)
el: {currentWords}/{minWords} λέξεις ({moreNeeded} ακόμη χρειάζονται)
es: {currentWords}/{minWords} palabras ({moreNeeded} más necesarias)
eu: {currentWords}/{minWords} hitz ({moreNeeded} gehiago behar dira)
fr: {currentWords}/{minWords} mots ({moreNeeded} de plus nécessaires)
gl: {currentWords}/{minWords} palabras ({moreNeeded} máis necesarias)
hi: {currentWords}/{minWords} शब्द ({moreNeeded} और चाहिए)
it: {currentWords}/{minWords} parole ({moreNeeded} altre necessarie)
ja: {currentWords}/{minWords}語 (あと{moreNeeded}語必要)
pt: {currentWords}/{minWords} palavras ({moreNeeded} mais necessárias)
zh: {currentWords}/{minWords}个单词（还需要{moreNeeded}个）

# aiValidationMinWords
source: Minimum {minWords} words required ({moreNeeded} more needed)
ar: مطلوب الحد الأدنى {minWords} كلمة (نحتاج {moreNeeded} أكثر)
ca: Mínim {minWords} paraules necessàries ({moreNeeded} més necessàries)
de: Mindestens {minWords} Wörter erforderlich ({moreNeeded} weitere benötigt)
el: Απαιτούνται τουλάχιστον {minWords} λέξεις ({moreNeeded} ακόμη χρειάζονται)
es: Mínimo {minWords} palabras necesarias ({moreNeeded} más necesarias)
eu: Gutxienez {minWords} hitz behar dira ({moreNeeded} gehiago behar dira)
fr: Minimum {minWords} mots requis ({moreNeeded} de plus nécessaires)
gl: Mínimo {minWords} palabras necesarias ({moreNeeded} máis necesarias)
hi: न्यूनतम {minWords} शब्द आवश्यक ({moreNeeded} और चाहिए)
it: Minimo {minWords} parole richieste ({moreNeeded} altre necessarie)
ja: 最低{minWords}語が必要です（あと{moreNeeded}語必要）
pt: Mínimo de {minWords} palavras necessárias ({moreNeeded} mais necessárias)
zh: 需要至少{minWords}个单词（还需要{moreNeeded}个）

source: Enable question
ar: تفعيل السؤال
ca: Activar pregunta
de: Frage aktivieren
el: Ενεργοποίηση ερώτησης
es: Activar la pregunta
eu: Galdera gaitu
fr: Activer la question
gl: Activar pregunta
hi: प्रश्न सक्रिय करें
it: Abilita domanda
ja: 質問を有効にする
pt: Ativar pergunta
zh: 启用问题

source: Disable question
ar: تعطيل السؤال
ca: Desactivar pregunta
de: Frage deaktivieren
el: Απενεργοποίηση ερώτησης
es: Desactivar la pregunta
eu: Galdera desgaitu
fr: Désactiver la question
gl: Desactivar pregunta
hi: प्रश्न निष्क्रिय करें
it: Disabilita domanda
ja: 質問を無効にする
pt: Desativar pergunta
zh: 禁用问题

# questionDisabled
source: Disabled
ar: معطل
ca: Desactivada
de: Deaktiviert
el: Απενεργοποιημένο
es: Desactivada
eu: Desgaituta
fr: Désactivée
gl: Desactivada
hi: निष्क्रिय
it: Disabilitata
ja: 無効
pt: Desativada
zh: 已禁用

# noEnabledQuestionsError
source: No enabled questions available to run the quiz
ar: لا توجد أسئلة مفعلة لتشغيل الاختبار
ca: No hi ha preguntes activades disponibles per executar el qüestionari
de: Keine aktivierten Fragen verfügbar, um das Quiz zu starten
el: Δεν υπάρχουν ενεργοποιημένες ερωτήσεις για την εκτέλεση του κουίζ
es: No hay preguntas habilitadas para ejecutar el examen
eu: Ez dago gaitutako galderarik eskuragarri galdetegia exekutatzeko
fr: Aucune question activée disponible pour lancer le quiz
gl: Non hai preguntas activadas dispoñibles para executar o cuestionario
hi: क्विज़ चलाने के लिए कोई सक्रिय प्रश्न उपलब्ध नहीं है
it: Nessuna domanda abilitata disponibile per avviare il quiz
ja: クイズを実行するための有効な質問がありません
pt: Nenhuma pergunta ativada disponível para executar o quiz
zh: 没有启用的问题可以运行测验

source: Evaluate with AI
ar: تقييم بالذكاء الاصطناعي
ca: Avaluar amb IA
de: Mit KI bewerten
el: Αξιολόγηση με AI
es: Evaluar con IA
eu: Ebaluatu AIrekin
fr: Évaluer avec l'IA
gl: Avaliar con IA
hi: AI के साथ मूल्यांकन करें
it: Valuta con AI
ja: AIで評価
pt: Avaliar com IA
zh: 用 AI 评估

source: AI Evaluation
ar: تقييم الذكاء الاصطناعي
ca: Avaluació IA
de: KI-Bewertung
el: Αξιολόγηση AI
es: Evaluación IA
eu: AI Ebaluazioa
fr: Évaluation IA
gl: Avaliación de IA
hi: AI मूल्यांकन
it: Valutazione AI
ja: AI評価
pt: Avaliação da IA
zh: AI 评估

# aiEvaluationError
source: Error evaluating response: {error}
ar: خطأ في تقييم الإجابة: {error}
ca: Error en avaluar la resposta: {error}
de: Fehler beim Bewerten der Antwort: {error}
el: Σφάλμα αξιολόγησης απάντησης: {error}
es: Error al evaluar la respuesta: {error}
eu: Errorea erantzuna ebaluatzean: {error}
fr: Erreur lors de l'évaluation de la réponse : {error}
gl: Erro ao avaliar a resposta: {error}
hi: उत्तर का मूल्यांकन करने में त्रुटि: {error}
it: Errore nella valutazione della risposta: {error}
ja: 回答の評価中にエラーが発生しました：{error}
pt: Erro ao avaliar a resposta: {error}
zh: 评估回答时出错：{error}
